{"appId":"winget_app_dotPDN.PaintDotNet","appShortcutName":"Winget Application","appDisplayName":"paint.net","authorId":"winget","releaseTagName":"winget-5.1","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Paint.NET is image and photo editing software for PCs that run Windows.\n\nPaint.NET is image and photo editing software for PCs that run Windows. It features an intuitive and innovative user interface with support for layers, unlimited undo, special effects, and a wide variety of useful and powerful tools. An active and growing online community provides friendly help, tutorials, and plugins.\nChanges since 5.0.13:\n- New: Color Management support\n  - Images with embedded color profiles will now be displayed correctly using real-time color conversion built on PhotoSauce and Direct2D.\n  - On HDR and WCG (Wide Color Gamut) displays, Paint.NET will make use of Windows Advanced Color which then enables high bit-depth output and use of the display's full color gamut. Windows ensures color consistency and accuracy for the whole desktop.\n  - On SDR displays, Paint.NET will operate in sRGB mode and provide consistent color reproduction. If the display is configured for sRGB then colors will also be accurate.\n- New: Image->Color Profile replaces Image->Apply Embedded Color Profile, and provides the ability to change the image's color profile via Assign and Convert actions.\n- New: Fully modernized canvas presentation engine that utilizes DXGI Flip Model, Advanced Color, and Windows.UI.Composition.\n- Improved: Input latency has been significantly reduced by using DXGI Flip Model and Async Present.\n- New: Canvas section in Settings provides the ability to customize the canvas brightness, border color, and shadow\n- Improved the canvas rendering quality by using linear gamma. This improves overall performance and also improves the appearance of selection handles and other canvas UI elements.\n- Updated: All remaining effects and adjustments have been ported to use the GPU\n  - Newly converted in 5.1 are: Auto-Level, Curves, Levels, Oil Painting, Surface Blur, Reduce Noise, and Outline.\n  - The two exceptions to this are Effects->Color->Quantize and Effects->Photo->Red Eye Removal. The first is not amenable to running on the GPU, and the second is actually a wrapper around an old GDI+ effect.\n- New: Effects->Blur->Sketch Blur is a new blur effect that gives the appearance of a painting drawn with a coarse brush.\n- New: Effects->Blur->Median Blur replaces Effects->Noise->Median, and now runs on the GPU with much higher quality.\n- New: Effects->Blur->Square Blur\n- Changed: Gaussian Blur and Bokeh Blur now have a \"Gamma Boost\" slider instead of a \"Gamma\" property. This is now used to configure the change in gamma rather than specifying the gamma that the image should be assumed to have. The intent is still to provide something of a brightness/highlights amplifier for creative purposes.\n- Changed: Effects -> Blur -> Motion Blur now uses a Gaussian kernel.\n- New: Effects->Render->Clouds now has a Colors tab for configuring the colors that are used\n- Changed: Image->Canvas Size will no longer use the secondary color to fill in new areas for the \"background\" layer. It will always fill with transparent black (#00000000).\n- Improved dithering quality when saving an image at 8-bit or lower color depth, and when using Effects->Color->Quantize\n- New: Updated to use Mica effects in the title bar on Windows 11\n- Fixed some more scrollbars to respect dark theme (thanks @toe_head2001!)\n- Fixed: The Move Selected Pixels tool will no longer finish (commit) when toggling layer visibility. This was a workaround for a bug during an early beta of 4.0 that does not seem to be necessary anymore.\n- Improved: Greatly reduced CPU memory usage by maintaining the tile cache only on the GPU instead of having a copy on the CPU-side as well.\n- Improved: Significantly reduced GPU memory usage by consolidating down to 2 swapchains that are shared among image tabs, instead of each image tab having its own private swapchain.\n- Improved: GPU effects now use a smaller tile size on GPUs with less RAM, which should enable faster updates and cancellation response on older GPUs. This also significantly lowers the probability of TDR events, particularly for expensive effects like Median Blur.\n- Fixed: The Save Configuration dialog sometimes looked like it was having a seizure when panning after zooming (w/ Ctrl + Mouse Wheel)\n- Fixed: The Line/Curve and Shapes tools would cancel instead of commit (Finish) when pressing ESC too soon after using the arrow keys to move the shape\n- Improved the performance of the portable release by reducing how often the JSON settings file is flushed.\n- New: CMYK64 images can now be loaded. Note that CMYK images are always transformed to Adobe RGB.\n- New: Added the ExponentialScale double property for IndirectUI. The default value is 2.0. It goes along with the UseExponentialScale boolean property.\n- New: GPU effect plugins can now use compute shaders. Note that this is \"raw\" support by providing access to the necessary Direct2D interfaces (e.g. ID2D1ComputeInfo).\n- Deprecated: The classic/legacy effect system has been marked as [Obsolete]. Compiling a classic/legacy effect will produce a compile-time warning along with a message about migrating to the new GpuEffect or BitmapEffect systems. This will be changed to a compile-time error in a future update (either v5.2 or v6.0, whichever is next).\n- Removed: Settings -> UI -> Show image previews in the Windows taskbar.\n- Removed: Settings -> UI -> Enable scrolling past the edge of the canvas (overscroll). This is now always enabled.\n- Updated to use .NET 9.0 (previously this was .NET 7.0)\n- Updated the minimum OS requirement to Windows 10 v21H2 (previously this was Windows 10 v1809)\n- Updated the bundled AVIF FileType to version 3.10.0.0. Thanks @null54!\n- Updated the bundled DDS FileType Plus to version 1.12.11.0. Thanks @null54!\n- Updated the bundled WebP FileType to version 1.4.0.0. Thanks @null54!","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"5.1","site":"https://dotpdn.com/","source":"dotPDN LLC","license_or_tos":"Proprietary","resources":null,"verified":false}