{"appId":"winget_app_WesternDigital.Dashboard","appShortcutName":"Winget Application","appDisplayName":"Dashboard","authorId":"winget","releaseTagName":"winget-4.2.2.5","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A software that checks on Western Digital drives in Windows.\n\nWestern Digital Dashboard is software that checks on Western Digital drives in Windows. Tools for checking health, firmware versions and updates are included.\nApplication\n- Added a new service to monitor and generate Windows Desktop Notifications.\n- Added feature to automatically enable Start with Windows & Start Minimized options when Gaming Mode 2.0 AUTO mode is selected by the user.\n- Added Windows context menu option to add a folder to Game Mode 2.0 automatic game launch detection watch list.\n- Added a feature to disable background tasks while running device self test diagnostics to reduce interruptions.\n- Improved user experience by personalizing marketing messages in Notification panel based on the devices detected.\n- Enhanced Start with Windows task scheduler option to account for username changes.\n- Streamlined brand recognition so that all Western Digital products are well represented.\n- Reduced ad caching time from 2 days to 1 day.\n- Added support for new SD cards and readers.\n- Adjusted serial number reported by Dashboard for more ATA drives to reflect the product serial number printed on the case, not the serial number of the internal storage component. Internal serial number is still available in the Identify data in the Tools page if needed.\n- Fixed an issue with performance monitoring for devices with multiple volumes.\n- Fixed an issue with WD_BLACK D10 detection.\n- Fixed an issue with CFExpress temperature reading display.\n- Fixed an issue with some USB devices.\n- Added support for WD BLUE SN5000 4TB NVMe SSD.\n- Added support for G-DRIVE SSD.\n\nInstaller (6.0.2.11)\n- Added a check to see if the installer is already running and display that instead of opening a new instance of the installer.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"4.2.2.5","site":"https://www.westerndigital.com/","source":"Western Digital Corporation","license_or_tos":"Freeware","resources":null,"verified":false}