{"appId":"winget_app_JohannesMillan.superProductivity","appShortcutName":"Winget Application","appDisplayName":"superProductivity","authorId":"winget","releaseTagName":"winget-10.1.1","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/johannesjo/super-productivity/releases/download/v10.1.1/Super-Productivity-Setup-arm64.exe"}},"install":{"win32":null,"winarm":{"assetId":0,"exec":null,"installerArgs":null},"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Personal Task Management App to help you with your daily struggle with JIRA etc.\n\nFeatures\n- Keep organized and focused!\nPlan and categorize your tasks using sub-tasks, projects and tags and color code them as needed.\n- Use timeboxing and track your time.\nCreate time sheets and work summaries in a breeze to easily export them to your company's time tracking system.\n- Helps you to establish healthy & productive habits:\nA break reminder reminds you when it's time to step away.\nThe anti-procrastination feature helps you gain perspective when you really need to.\nNeed some extra focus?\nA Pomodoro timer is also always at hand.\nCollect personal metrics to see, which of your work routines need adjustments.\n- Integrate with Jira, GitHub, GitLab, and OpenProject.\nAuto import tasks assigned to you, plan the details locally, automatically create work logs, and get notified immediately, when something changes.\n- Attach context information to tasks and projects.\nCreate notes, attach files or create project-level bookmarks for links, files, and even commands.\n- Super Productivity respects your privacy and does NOT collect any data and there are no user accounts or registration.\nYou decide where you store your data!\n- It's free and open source and always will be.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"10.1.1","site":"https://super-productivity.com","source":"WinGet","license_or_tos":"MIT","resources":null,"verified":false}