{"appId":"winget_app_Evernote.Evernote","appShortcutName":"Winget Application","appDisplayName":"Evernote","authorId":"winget","releaseTagName":"winget-10.113.5","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://win.desktop.evernote.com/builds/Evernote-10.113.5-win-ddl-stage-20241029194623-305d6db3571a3b18983b76681e82ba32d6e01350-setup.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Remember everything and tackle any project with your notes, tasks, and schedule all in one place.\n\nEvernote helps you focus on what matters most and have access to your information when you need it. Input typed notes or scan handwritten notes. Add to-do’s, photos, images, web pages, or audio ... and it’s all instantly searchable. Organize notes any way you want and share with anyone. And Evernote syncs across your devices so your information is always with you, everywhere you go.\nFixes:\n- Fixes an issue where some users couldn't see the AI Edit options on the desktop version\n- The slash command ghost text now matches the default font size.\n- Fixed an issue where sometimes changing the note and updating an attachment in an external editor, the update was reflected in the wrong note.\n- Fixed an issue where most insert menu items were lost when exporting-importing ENEX files\n\nNew features:\n- You can now easily dismiss modals by clicking on their overlays.\n- You can now easily create a new line by clicking at the end of the text.\n- We've refined the experience around quote blocks, providing a clearer, more intuitive way to format and work with quoted text.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"10.113.5","site":"https://evernote.com/","source":"Evernote Corporation","license_or_tos":"Proprietary","resources":null,"verified":false}