{"appId":"winget_app_HARMAN.AdobeAIR","appShortcutName":"Winget Application","appDisplayName":"Adobe AIR","authorId":"winget","releaseTagName":"winget-51.1.2.2","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Enabling cross-platform application and game development\n\nHARMAN have taken over the development and support for the Adobe AIR SDK, a cross-platform framework used by a wide range of applications and games. Enabling rapid development including animations created via Adobe Animate, AIR supports the deployment of applications on desktop and mobile platforms, including the ability to develop and deploy iPhone and iPad applications using a Windows machine.\nAIR-7364: ADT to abort if a malformed ABC block is found during IPA creation\nAIR-7402: Crashes reported in Android runtime - strstr and JNI exceptions\nAIR-7437: Ensuring trace() output works in command-line apps\nAIR-7441: Fixing iPhone build target and eliminating duplicate symbols\nGithub-78: Correcting adjustment for italic text in Windows direct mode\nGithub-1453: Fixing certificateError behaviour on Linux and for Loader\nGithub-2088: Updating AIR mac app bundle signing to remove entitlements from libraries\nGithub-2610: TimeZone.getTimeZone(null) returns null\nGithub-3516: Android stability fixes for reported crashes\nGithub-3521: Partial fix for problems with Chinese font in iOS 18\nGithub-3534: Removing hard dependency on libsecret in AIR Linux runtime\nGithub-3542: Ensuring ADT does not package up .DS_Store files\nGithub-3552: Ensuring activate events are not sent when minimising an app in Windows","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"51.1.2.2","site":"https://airsdk.harman.com/","source":"HARMAN International","license_or_tos":"Proprietary","resources":null,"verified":false}