{"appId":"winget_app_Wazuh.WazuhAgent","appShortcutName":"Winget Application","appDisplayName":"Wazuh Agent","authorId":"winget","releaseTagName":"winget-4.9.0","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/microsoft/winget-pkgs/releases/download/winget-4.9.0/"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/microsoft/winget-pkgs/releases/download/winget-4.9.0/"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Wazuh helps you to gain deeper security visibility into your infrastructure by monitoring hosts at an operating system and application level.\n\n\n#19753 Removed the directory /boot from the default FIM settings for AIX.\n\n#21690 Improved debugging logs for Windows registry monitoring configuration. Now the Wrong registry value type warnings include the registry path to help troubleshooting. Thanks to Zafer Balkan (@zbalkan).\n\n#21287 Added Amazon Linux 1 and Amazon Linux 2023 support for the Wazuh installation assistant.\n\n#23137 Added Journald support in Logcollector.\n\n#20727 Fixed Windows Agent 4.8.0 permission errors on Windows 11 after upgrade.\n\n#22440 Fixed Syscollector not checking if there's a scan in progress before starting a new one.\n\n#16487 Fixed alerts are created when syscheck diff DB is full.\n\n#2195 Fixed Wazuh deb uninstallation to remove non-config files.\n\n#23273 Fixed improper Windows agent ACL on non-default installation directory.\n\n#17664 Fixed socket configuration of an agent is displayed.\n\n#18494 Fixed wazuh-modulesd printing child process not found error.\n\n#23848 Fixed issue with an agent starting automatically without reason.\n\n#17415 Fixed GET /syscheck to properly report size for files larger than 2GB.\n\n#23203 Added support for Amazon Security Hub via AWS SQS.\n\n#20624 Refactored and modularized the Azure integration code.\n\n#23790 Improved logging of errors in Azure and AWS modules.\n\n#22583 Dropped support for Python 3.7 in cloud integrations.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"4.9.0","site":null,"source":"WinGet","license_or_tos":"GNU General Public License (version 2)","app_page":null,"resources":null}