{"appId":"winget_app_Derailed.k9s","appShortcutName":"Winget Application","appDisplayName":"k9s","authorId":"winget","releaseTagName":"winget-0.32.7","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Kubernetes CLI To Manage Your Clusters In Style!\n\n\nRelease v0.32.7\nNotes\nThank you to all that contributed with flushing out issues and enhancements for K9s!\nI'll try to mark some of these issues as fixed. But if you don't mind grab the latest rev\nand see if we're happier with some of the fixes!\nIf you've filed an issue please help me verify and close.\n\nYour support, kindness and awesome suggestions to make K9s better are, as ever, very much noted and appreciated!\nAlso big thanks to all that have allocated their own time to help others on both slack and on this repo!!\n\nAs you may know, K9s is not pimped out by corps with deep pockets, thus if you feel K9s is helping your Kubernetes journey,\nplease consider joining our sponsorship program and/or make some noise on social! @kitesurfer\n\nOn Slack? Please join us K9slackers\n\nMaintenance Release!\n\nResolved Issues\n#2970 Ctrl-z on events view causes runtime error in v0.32.6\n#2969 When using impersonation user information and permissions not preserved when switching context\n#2966 Go to the Contexts page and filter, contexts that are matched will be filtered ou\n#2962 Small colour/filtering related bug\n#2961 Drain node with the -disable-eviction\n#2958 Restart count in container view associated with the wrong container\n#2945 Could we add ServiceAccount Column in v1/POD view\nContributed PRs\nPlease be sure to give Big Thanks! and ATTA Girls/Boys! to all the fine contributors for making K9s better for all of us!!\n\n#2968 Update go version to 1.23.X in README\n#2964 feat(dao,used-by-cmd): check imagePullSecrets as well\n#2960 Put log levels in order in cmd help\n© 2024 Imhotep Software LLC. All materials licensed under Apache v2.0","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"0.32.7","site":"https://github.com/derailed","source":"Derailed","license_or_tos":"Apache-2.0","resources":null,"verified":false}