{"appId":"winget_app_RProject.R","appShortcutName":"Winget Application","appDisplayName":"R for Windows","authorId":"winget","releaseTagName":"winget-4.4.1","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/microsoft/winget-pkgs/releases/download/winget-4.4.1/"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/microsoft/winget-pkgs/releases/download/winget-4.4.1/"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"R is a free software environment for statistical computing and graphics.\n\nR is a language and environment for statistical computing and graphics. It is a GNU project which is similar to the S language and environment which was developed at Bell Laboratories (formerly AT&T, now Lucent Technologies) by John Chambers and colleagues. R can be considered as a different implementation of S. There are some important differences, but much code written for S runs unaltered under R.\nR provides a wide variety of statistical (linear and nonlinear modelling, classical statistical tests, time-series analysis, classification, clustering, …) and graphical techniques, and is highly extensible. The S language is often the vehicle of choice for research in statistical methodology, and R provides an Open Source route to participation in that activity.\nOne of R’s strengths is the ease with which well-designed publication-quality plots can be produced, including mathematical symbols and formulae where needed. Great care has been taken over the defaults for the minor design choices in graphics, but the user retains full control.\nR is available as Free Software under the terms of the Free Software Foundation’s GNU General Public License in source code form. It compiles and runs on a wide variety of UNIX platforms and similar systems (including FreeBSD and Linux), Windows and MacOS.\nC-LEVEL FACILITIES\n- Functions R_atof and R_strtod declared in header ‘R_ext/Utils.h’ are now documented in ‘Writing R Extensions’ and so formally part of the API.\n- The non-API entry points Rf_setSVector, Rf_StringFalse, Rf_StringTrue and Rf_isBlankString have been added to those reported by R CMD check.\n- The new function Rf_allocLang is now available. This provides an alternative to the idiom of calling Rf_allocList followed by SET_TYPEOF.\nUTILITIES\n- R CMD check now reports as warnings what gfortran calls ‘Fortran 2018 deleted features’, all of which have long been marked as ‘obsolescent’ and some of which were deleted in Fortran 2008 or earlier. Fortran compilers are no longer required to support these.\nBUG FIXES\n- as.numeric(), scan(), type.convert() and other places which use the internal C function R_strtod now require a non-empty digit sequence in a decimal or binary exponent. This aligns with the C/POSIX standard for strtod and with ?NumericConstants.\n- as.data.frame(m, make.names=NA) now works correctly for a matrix m with NA's in row names.\n- The error message from <POSIXlt>[[\"hour\"]] and similar now mentions *[[, \"hour\"]], as wished for in PR#17409 and proposed by Michael Chirico.\n- qbinom() and potentially qpois(), qnbinom(), no longer sometimes fail accurate inversion (of pbinom(), etc), thanks to Christopher Chang's report and patch in PR#18711.\n- The internal help server on Windows can again serve requests sent in quick succession, fixing a regression in R 4.4.0.\n- debugcall(S3Generic()) now also works when a corresponding S4-generic version is in the methods cache (PR#18143).\n- Package tools' toTitleCase(ch0) now returns character(0) when ch0 is of zero length; fixing PR#18724, reported by David Hugh Jones.\n- R CMD check is no longer broken (without a check result and no explanation in ‘00check.log’) for a package which declares an invalid VignetteBuilder in ‘DESCRIPTION’ but has no vignettes.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"4.4.1","site":"https://www.r-project.org","source":"WinGet","license_or_tos":"GPL-2.0-or-later","app_page":"https://cloud.r-project.org","resources":null}