{"appId":"winget_app_Mozilla.Firefox","appShortcutName":"Winget Application","appDisplayName":"Mozilla Firefox","authorId":"winget","releaseTagName":"winget-131.0.2","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://download-installer.cdn.mozilla.net/pub/firefox/releases/131.0.2/win64/en-US/Firefox%20Setup%20131.0.2.exe"},"0":{"installerType":"WindowsInstallerExe","asset":"","url":"https://download-installer.cdn.mozilla.net/pub/firefox/releases/131.0.2/win64-aarch64/en-US/Firefox%20Setup%20131.0.2.exe"}},"install":{"win32":{"assetId":1,"exec":null,"installerArgs":null},"winarm":{"assetId":0,"exec":null,"installerArgs":null},"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Mozilla Firefox is free and open source software, built by a community of thousands from all over the world.\n\nFirefox Browser, also known as Mozilla Firefox or simply Firefox, is a free and open-source web browser developed by the Mozilla Foundation and its subsidiary, the Mozilla Corporation. Firefox uses the Gecko layout engine to render web pages, which implements current and anticipated web standards. In 2017, Firefox began incorporating new technology under the code name Quantum to promote parallelism and a more intuitive user interface. Firefox is officially available for Windows 7 or newer, macOS, and Linux. Its unofficial ports are available for various Unix and Unix-like operating systems including FreeBSD, OpenBSD, NetBSD, illumos, and Solaris Unix.\nNew\n- Firefox now allows translating selected text portions to different languages after a full-page translation.\n\n- Firefox now offers an easy way to try experimental features with a new Firefox Labs page in Settings.\n  - AI Chatbot feature lets you add the chatbot of your choice to the sidebar, for quick access as you browse.\n  - Picture-in-Picture auto-open experiment enables PiP on active videos when switching tabs.\n\n- Overscroll animations are now enabled as the default behavior for scrollable areas on Linux.\n- Users in the United States and Canada can view local weather directly on the new tab page. Additionally, they have the option to select a specific location to see current weather conditions.\n\nFixed\n- Various security fixes.\n- Fixed an issue where Copy and Paste context menu items intermittently were not enabled when expected.\nChanged\n- The following languages are now supported by Firefox translation:\n  - Catalan\n  - Croatian\n  - Czech\n  - Danish\n  - Indonesian\n  - Latvian\n  - Lithuanian\n  - Romanian\n  - Serbian\n  - Slovak\n  - Vietnamese\nEnterprise\n- You can find information about policy updates and enterprise-specific bug fixes in the Firefox for Enterprise 130 Release Notes.\nDeveloper\n\nWeb Platform\n- WebCryptoAPI now supports Curve25519 primitives (Ed25519 signatures and X25519 key generation).\n- Enabled the Web Codecs API on desktop platforms, allowing low-level access to audio and video encoders and decoders.\nCommunity Contributions\n- With the release of Firefox 130, we are pleased to welcome the developers who contributed their first code change to Firefox in this release, 15 of whom were brand new volunteers! Please join us in thanking each of these diligent and enthusiastic individuals, and take a look at their contributions:\n  - Balarama Raju: 1788437\n  - cauasene00: 1904310\n  - Daniele Ferla: 1647800\n  - Eragon: 1904640\n  - Gabriel Lee [:gabrielchl]: 1814168\n  - Harry Chen: 1907082\n  - Jiaxun Yang [:flygoat]: 1909587, 1909793, 1909897\n  - JL: 1882655\n  - Joshua Chen: 1907234, 1907369\n  - Kiril K: 1899813\n  - Liam DeBeasi: 1903840\n  - Matthew: 1900282\n  - Mikhail Galanin [:mikhainin]: 1829689\n  - Nico Burns: 1906395, 1906994, 1906995\n  - Weilon[:whale]: 1768758","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"131.0.2","site":"https://www.mozilla.org/","source":"WinGet","license_or_tos":"MPL-2.0","app_page":"https://www.mozilla.org/firefox/","resources":null}