{"appId":"winget_app_TeamViewer.TeamViewer","appShortcutName":"Winget Application","appDisplayName":"TeamViewer","authorId":"winget","releaseTagName":"winget-15.60.3","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://download.teamviewer.com/download/version_15x/TeamViewer_Setup_x64_15.60.3.exe"}},"install":{"win32":{"assetId":1,"exec":null,"installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Secure remote access and support\n\nTeamViewer is a comprehensive, remote access, remote control and remote support solution that works with almost every desktop and mobile platform, including Windows, macOS, Android, and iOS.\nTeamViewer lets you remote in to computers or mobile devices located anywhere in the world and use them as though you were there.\nNew Features\n- The advanced view UI has been improved. It now displays more device entries at one glance.\n- It is now possible to create custom fields, for managed devices, under admin settings.\n- Supporters can now join a session and wait for the user in a dedicated waiting room. This enhanced waiting room allows supporters to easily view and copy session details while awaiting connection with the user.\n- Global search has been extended to include features and settings. These options can now be easily accessed via the search results.\n- It is now possible to search for and filter devices/device groups in basic view.\n- It is now possible to view additional license columns in the user management overview. This will allow the administrator to have a quick overview of how licenses are assigned within the organization.\n- Additional columns for two-factor authentication status, visibility in company address book, and log session reporting status are now available in user management.\n\nImprovements\n- It is now possible for user groups to inherit permissions from device groups.\n- Conditional Access rules now display the email information of the source or target contact. This allows for improved user identification.\n- The connect tab now displays the easy access connection option when it is granted on device group level.\n- The messaging shown in device groups containing bookmarks has been improved. This allows for better education on such device types.\n- Deleted users will no longer be listed as managers of devices and device groups.\n- It is now possible to filter users, by user settings and statuses, in the user management overview.\n- The user management search bar now utilizes the same design as other search bars in the UI. Additionally, it will no longer close while a search is still filtering the results but remain open until the search is cleared. This will help users to understand why they can see which result at any point.\n\nBugfixes\n- Fixed a bug in global search where the main feature icons were the wrong size.\n- Fixed a bug in Device Dock which prevented users from connecting to a sleeping device via double click.\n- In user group management, the \"Assign role\" tab will no longer be visible when no user group is selected.\n- Fixed a bug that allowed users to filter on user data, under user management, before the user data had fully loaded. These options will now be disabled until the data has completely loaded in the user list.\n- Fixed a bug which meant that the \"Export to CSV\" option was not visible if a user was selected in the user list.\n- Fixed a bug that prevented users from being able to scroll dropdown menus on the in-session toolbar.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"15.60.3","site":"https://www.teamviewer.com/","source":"TeamViewer","license_or_tos":"Proprietary","resources":null,"verified":false}