{"appId":"winget_app_joncampbell123.DOSBox_X","appShortcutName":"Winget Application","appDisplayName":"DOSBox-X","authorId":"winget","releaseTagName":"winget-2024.10.01","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/joncampbell123/dosbox-x/releases/download/dosbox-x-v2024.10.01/dosbox-x-windows-2024.10.01-setup.exe"}},"install":{"win32":{"assetId":1,"exec":null,"installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"DOSBox-X is an open-source DOS emulator for running DOS games and applications.\n\nDOSBox-X emulates a PC necessary for running many DOS games and applications that simply cannot be run on modern PCs and operating systems, similar to DOSBox.\nHowever, while the main focus of DOSBox is for running DOS games, DOSBox-X goes much further than this.\nStarted as a fork of the DOSBox project, it retains compatibility with the wide base of DOS games and DOS gaming DOSBox was designed for.\nBut it is also a platform for running DOS applications, including emulating the environments to run Windows 3.x, 9x and ME and software written for those versions of Windows.\nBy adding official support for Windows 95, 98, ME emulation and acceleration, we hope that those old Windows games and applications could be enjoyed or used once more.\nMoreover, DOSBox-X adds support for DOS/V and NEC PC-98 emulations so that you can play DOS/V and PC-98 games with it.\n2024.10.01\n- Allow the \".inst\" extension for CUE sheets. (Allofich)\n- Add SET /FIRST, a DOSBox-X extension, that takes the specified\nvariable if it exists and moves it to the front of the environment\nblock. (joncampbell123).\n- SET command processing has been cleaned up and streamlined.\nAdded /ERASE command line switch to clear the environment\nblock (DOSBox-X extension). (joncampbell123).\n- VESA BIOS: Add new option to adjust reported linear framebuffer\naddress by a specific number of pixels. This is needed by\n\"Out of Control\" by Contract which for whatever reason,\nwill always draw to the LFB base minus 128 bytes. This option\nmakes it possible to correct the demo graphics. (joncampbell123).\n- Gravis Ultrasound: Officially, registers 0x0-0xF, the voice\ncontrol registers, are documented to have a 0x0-0xF write and\n0x80-0x8F read alias. Unofficially, according to the behavior\nof 1997 demo \"Out of Control\" by Contract, all GUS registers\nhave a N and (N+0x80) alias, or at least register 0x4C, and\nyou can read them back from either index. Or else the demo\nfails to detect the GUS. So add this alias, but only if\nenabled in dosbox.conf. Real hardware testing is required to\nknow if the actual GUS behaves this way and which versions.\n(joncampbell123).\n- Move the INT 3 default vector to well within the initial 16\nbytes of the DOS kernel, away from the List of Lists and SFT.\nThe previous placement caused certain versions of Windows 3.2\n(yes, the Chinese version) to crash on startup. (joncampbell123).\n- When using the running program to name screenshots and such,\nfilter out all invalid characters so that Windows users can\ntake snapshots even if junk characters are there (joncampbell123).\n- DOS FAT driver: If INT 13h reports disk change, adapt floppy\ndisk geometry to new disk image according to media byte. This\nallows DS_BLISS to present it's 720K fake floppy even if the\nuser initially mounted a 1.44MB floppy to drive A: (joncampbell123).\n- INT 10 mode list: Add \"pitch\" parameter. If nonzero, the value\n(in pixels) is how to program the pixels per scanline when\nsetting the mode.\n- VESAMOED: Add -pitch option to control the pitch (pixels per\nscanline). The intent is to work around DOS games that assume\nnonstandard pixels per scanline by allowing the VESA BIOS mode\nto use a different one. For example, Line Wars II has an S3\nacceleration mode that uses 800x600, but for whatever reason,\nassumes the video mode is 1024 pixels per scanline, and will\nrender garbled graphics if that is not the case. (joncampbell123).\n- S3 emulation: Follow S3 Trio64 documentation and mask the Linear\nWindow Position bits according to the size of the memory. You\ncan only place it on a multiple of the memory size. This silences\nwarnings caused by Line Wars II which appears to modify only the\nupper byte but not the lower when modifying this register, which\nthen leaves 0xA0 in the lower half. That lower half would be\nignored for 1MB or larger video memory sizes. (joncampbell123).\n- S3 XGA emulation: Add XGA acceleration for 4bpp packed 16-color\nSVGA modes. A CAD package has S3 support drivers that use the\n16-color 4bpp packed modes and expects XGA acceleration to work.\n(joncampbell123).\n- Add \"-o int13\" option to IMGMOUNT to direct the FAT driver to do\nall disk I/O through INT 13h instead of directly. This is intended\nfor certain demoscene productions that apparently like to make\nfiles appear out of thin air by intercepting INT 13h floppy disk\nI/O and then asking MS-DOS to run something from it. Hack for\n\"DS_BLISS\" demo. (joncampbell123).\n- Fixed crash when a language file is loaded on a Windows host with\nUS keyboard (maron2000)\n- Added Added sharp-bilinear Direct3D shader (RibShark)\n- Pass output dimensions to Direct3D shaders (RibShark)\n- Fixed BPB of floppy images made by IMGMAKE command (maron2000)\n- Fixed timestamp of volume label changed by LABEL command (maron2000)\n- Fixed pathname issues when mounting differencial VHD images (maxpat78)\n- Corrected relative/absolute track offset in subchannel data for\nCD-ROM images (RibShark).\n- Fixed particular dead keys were not working to input characters\nwith diacritics (maron2000).\n- Enabled \"Edit and Continue\" option for debug builds of Visual Studio\nIntel builds (aybe).\n- Updated libchdr to latest (treloret).\n- Fixed icon in Gnome dock bar (FredBezies).\n- add option \"[dos] automount drive directories\" for Windows builds,\nthis will mount existing drive directories from C to Y drive (aybe).\n- fix off-center and off-screen window after entering the\nconfiguration tool while using TTF output mode (aybe).\n- add menu item for centering window \"Video/Center window\" (aybe).\n- Fixed update-version-number script to patch all *.iss files, not\njust the specific one it did before, to ensure future releases have\ncorrect version numbers. (joncampbell123).\n- Updated Nuked-OPL3 code to nukeykt/Nuked-OPL3@cfedb09 (StevenSYS)\n- Updated SDL2 library to 2.30.4 (maron2000)\n- Fixed TTF mode didn't change to graphic mode when machine = Hercules\n(maron2000)\n- Configuration tool: (aybe)\n    - more Windows 3.1 look'n'feel (themes w/ host dark mode detection)\n    - enhance main window layout, it is now visible in its entirety\n    - fix layout issues, off by one in rectangle drawing functions\n    - fix 'list iterators incompatible' when pressing the Tab key\n    - properties/help: sorted alphabetically, mouse wheel scrollable\n    - remove few rendundant labels, adjust names of some others\n    - retain 'show advanced options' state throughout session\n- SVN r4483: Fix compilation in Visual Studio 2008 (Allofich)\n- DOSBox Staging: Decouple CMS and OPL emulations (Allofich)","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"2024.10.01","site":"https://dosbox-x.com/","source":"joncampbell123 [DOSBox-X Team]","license_or_tos":"GPL-2.0","resources":null,"verified":false}