{"appId":"winget_app_SpecialK.SpecialK","appShortcutName":"Winget Application","appDisplayName":"Special K","authorId":"winget","releaseTagName":"winget-24.11.5","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://sk-data.special-k.info/repository/SpecialK_24.11.5.exe"}},"install":{"win32":{"assetId":1,"exec":null,"installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"The Swiss Army Knife of PC Gaming\n\nLovingly referred to as the Swiss Army Knife of PC gaming, Special K does a bit of everything. It is best known for fixing and enhancing graphics, its many detailed performance analysis and correction mods, and a constantly growing palette of tools that solve a wide variety of issues affecting PC games.\nBelow are the highlights between v 24.11.2.3 - v 24.11.5:\n\n + Numerous input management improvements and optimizations\n + Win+Up/Down can minimize/restore a game, as can Xbox/PlayStation + Lt/Rt + Various bug fixes\n + Fixed changes to SK_WindowManager::StyleHasBorder (...) in 24.10.24.4\n     that were causing added window borders to Baldur's Gate 3 when set to\n       Borderless in-game.\n + Add new fallback for WMAITX support testing on CPUs with CPUIDs that\n     claim the instruction is unsupported... just run the instruction and\n       see if it generates and Illegal Instruction exception or not, lol.\n + Allow Multitasking-on-Top to be used without Global Injection service,\n     but turn off certain functionality that cannot work reliably without.\n + Handle window position changes that occur without showing up a game's\n     window message queue.\n + Cleanup various RawInput handling code.\n + Improved/made obsolete mouse anti-warp for games that move their cursor\n     to the center of the screen to implement mouselook (stupid devs...).\n + Remove old compatibility hack for ReShade that was changing Flip Model\n     SwapChains to Flip Sequential. ReShade works with Flip Discard now.\n + Added option block screensaver activation on controller input (default)\n + Added option to have Special K disable all game handling of screensavers,\n     and fully manage it based on its own configurable rules.\n\n    >> Without this option, SK adds additional blocking rules, but respects\n         the game's own attempts to block screensaver activation.\n\n    * Many games unconditionally block screensaver, and you may not want\n        that behavior if you have alt-tab to work a different application\n          and then go AFK while the game continues running.\n + Changed screensaver activation prevention to use the Windows-defined timeout\n     interval and factor in gamepad input, since Windows only uses KB&M.\n + Added a message when the system screensaver activates explaining how to\n     configure screensaver prevention.\n + Default screensaver policy has been changed to \"Game Default\".\n + Always use the fully qualified path when looking up NVIDIA driver profiles\n     for the current game in order to avoid creating duplicates.\n + Fix bug in Ys X where it may attempt to create 0x0 textures when its window\n     is minimized and then crash.\n + Add explicit overrides for many of the most important SDL input settings\n\n    ( -1 = No Override, 0 = Off, 1 = On )\n\n    * Refer to SDL_hints.h for details on each,\n\n      \"FullPlayStationBluetoothSupport\" is a combination of\n        SDL_JOYSTICK_HIDAPI_PS4_RUMBLE and SDL_JOYSTICK_HIDAPI_PS5_RUMBLE...\n\n      This setting is controversial, it will allow rumble and haptics over\n        Bluetooth, but will cause your gamepad to become incompatible with\n          games that use DirectInput until powered off and back on...\n\n      ^ If that sounds familiar, it is the entire reason ValvePlug was created.\n\n   *** Unlike the Steam Client, SDL never enables those things without consent,\n         and that means rumble may be missing from many games that use SDL.\n + Allow SDL to use DirectInput gamepads at sanity level 1\n + Improve Vulkan/DXGI Layer detection for NVIDIA drivers to handle cases\n     where vulkan-1.dll is calling DXGI directly instead of nvoglv{32|64}.\n + Turn Multitasking-on-Top off by default again, because at levels aggressive\n     enough to work, some windows will not be raised above the game.\n + Make sure SK always calls the real ShowWindow (...) instead of its hook.\n + Handle undocumented special cases SWP_NOCLIENTMOVE and SWP_NOCLIENTSIZE,\n     to fix problems with Sonic Generations\n + Added support for minimizing/restoring borderless games by pressing the\n     normal Windows keybinds to do so (Win+Down / Win+Up).\n + Avoid unnecessary window position and border style API calls when no actual\n     change is required.\n + Allow WS_ICONIC window style to be set if borderless override is not on.\n + Add WS_EX_WINDOWEDGE to list of extended window styles that have borders.\n + Fixed ReShade Plug-In selection UI not correctly turning Compatibility Mode\n     off (necessary for some ReShade Add-Ons to work).\n + HDR Remastered tooltip now ONLY counts memory for remastered RenderTargets\n     and Unordered Access Views that are -still- in memory, and values decrease\n       as a game unloads remastered resources.\n\n    * It now accurately measures extra VRAM used by having remasters enabled.\n\n + Remastered D3D11 RenderTargets and Unordered Access Views now have names\n     describing the type of resource, a unique ID and the original Surface\n       format before SK upgraded it to R16[G16[B16A16]]_{FLOAT|UNORM}.\n\n    * Names appear in debug logs and the Render Mod Tools (Live RenderTargets).\n\n + Fixed SKIF not being able to disable GFE notifications due to disabled code\n + Increase delay between first drawing an achievement unlock popup and taking\n     screenshot, so that statistics such as unlock time reliably appear.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"24.11.5","site":"https://special-k.info/","source":"WinGet","license_or_tos":"GPL-3.0","resources":null,"verified":false}