{"appId":"winget_app_OpenOrienteering.Mapper","appShortcutName":"Winget Application","appDisplayName":"OpenOrienteering Mapper","authorId":"winget","releaseTagName":"winget-0.9.5","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/microsoft/winget-pkgs/releases/download/winget-0.9.5/"},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/microsoft/winget-pkgs/releases/download/winget-0.9.5/"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A free software for drawing orienteering maps\n\n\nEnhancements\n- Mapper finally learned to export KMZ files (GH-138).\n  These files can also be used as templates.\n- For organisers of MapRun or Vikazimut events, the KMZ export is complemented by a \"Simple Course\" export feature, turning a single line object (course) into a KML or IOF Data Standard 3.0 course file.\n- Geospatial vector data export formats can be selected explicitly, instead of relying on the filename extension (GH-1779).\n- For the Paint-on-Template feature (aka Scribbling), it is now possible to select and modify alternative colour palettes (GH-945).\n- In touch mode, the editor can ignore touch input from palm and fingers when there is an alternative pointing device (inductive stylus, mouse) (GH-1368).\n- Template data saving (GPX, paint-on-template) is more robust now (GH-1785), and error reporting is improved (GH-1790).\n- The OMAP file format preserves the order of object tags, facilitating git version control (GH-1290).\n- Minor OCD support improvements (GH-1786).\n- Translations were updated again.\n- The User Manual was restructured in order to improve the usability of the online version.\n- qtbase, Qt's key component for cross-platform support, was updated to 5.12.10 plus selected extra patches.\nFixed bugs\n- Coordinate system issues with GeoTIFF (GH-1755).\n- Missing \"datumgrid\" files for precise georeferencing (GH-1802).\n- Minor OCD format improvements, including a fix for a crash (GH-1796).\n- Template saving now working for all file formats (GH-1791).\n- Consistent GPX track positioning (regression, GH-1709).\n- Area symbol patterns rotated properly when rotating the map (GH-1812), but not for North lines pattern (GH-1870).\n- Crash on early activation of GNSS location display (GH-1893).\n- ISSprOM 2019 Passable rock face symbol line width (GH-1875).\n- Symbol editing and Copy-and-paste quirks (GH-1837, GH-1828).\n- Editing values in template position dock widget (GH-1769).\n- Warnings without details at ocd import (GH-1766).\n- Windows (7 and up): You can choose between an installer (.exe) and a portable archive (.zip).\n- macOS (10.12 and up): You may need to run the app via Ctrl+Click the first time, in order to allow it to run despite coming from an \"unknown source\".\n- Android (4.1 and up): You can try arm64-v8a package on newer devices.  Otherwise, the armeabi-v7a package should work for most older devices.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"0.9.5","site":"https://www.openorienteering.org","source":"WinGet","license_or_tos":"GNU General Public License","app_page":"https://github.com/OpenOrienteering/mapper","resources":null}