{"appId":"winget_app_Redisant.KafkaAssistant","appShortcutName":"Winget Application","appDisplayName":"Kafka Assistant","authorId":"winget","releaseTagName":"winget-1.2.8.2","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/microsoft/winget-pkgs/releases/download/winget-1.2.8.2/"},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/microsoft/winget-pkgs/releases/download/winget-1.2.8.2/"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Kafka Visual Management & Monitoring\n\nKafka Visual Management and Monitoring - Manage Broker, Topic, Group, monitor server status, and support multiple message formats.\n\n- Status Monitoring: Allows you to monitor Kafka service status in real-time with the help of dashboards and Jolokia brokers.\n- Generate topology map: Generate topology map with one click for applications that use Streams API to realize streaming processing, and support exporting various formats such as png, svg, pdf, tk, and dot.\n- Data formatting: Kafka Assistant will automatically recognize and format different data formats, including Text, JSON, AVRO, XML, HEX, MessagePack, and various integer and floating point types.\n- Edit configuration: With Kafka Assistant, you can quickly view and update Broker and Topic configurations. The detailed description of each configuration item is built-in, and it is kept in sync with the Kafka official website.\n- Create a message: When creating a message, you can specify the compression type and ACKs; send messages in batches or use scheduled tasks to send messages regularly.\n- Add and remove themes and other management features\n- [Improved] Upgrade dependencies\n- [Fixed] Fix idempotent producer error, message batches cannot be fully rebuilt during retries\n- [Fixed] Fix segmentation errors in some cases","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"1.2.8.2","site":"https://www.redisant.com/","source":"WinGet","license_or_tos":"Proprietary","app_page":"https://www.redisant.com/ka","resources":null}