{"appId":"winget_app_dnSpyEx.dnSpy","appShortcutName":"Winget Application","appDisplayName":"dnSpy","authorId":"winget","releaseTagName":"winget-6.5.1","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"dnSpyEx is a unofficial continuation of the dnSpy project which is a debugger and .NET assembly editor.\n\ndnSpyEx is a unofficial continuation of the dnSpy project which is a debugger and .NET assembly editor. You can use\nit to edit and debug assemblies even if you don''t have any source code available. Main features: Debug .NET and\nUnity assemblies, Edit .NET and Unity assemblies, Light and dark themes.\n## New features:\n\n- Added a new command under the File menu to restart dnSpy as administrator. This is helpful when debugging files that require elevation\n- Add .NET runtimes to the predefined assembly lists in the File -> Open List... dialog. (by @QianMoXi)\n- Added a new analyzer node that shows all subtypes of the type being analyzed using the analyzer component\n- Added an additional field in the start debugging dialog which allows the user to customize the environment variables the program is started with\n- When running dnSpy on Windows 11, all windows now have rounded corners to match other applications on that OS\n\n## Improvements and bug fixes:\n\n- Support for static interface members has been added to the analyzer component. Usages and implementations should now be properly detected.\n- Fixed a jump to reference issue with pseudo custom attributes which on occasions prevented the feature from working\n- Improved XAML syntax highlighting\n- Improved XML doc lookup for members with special characters and explicit interface implementations\n- Improved text rendering performance and efficiency for controls other than the main text view\n- Fix a bug that caused the m_ulExtra field in the tables stream header structure to have an incorrect value.\n- Fix a bug that prevented the Show Data in Hex Editor command from showing on PE image section header nodes when the file was a non .NET PE file.\n- Updated translations\n- ILSpy Decompiler\n  - Fixed a decompiler crash that occurred for nested types with invalid generic parameter definitions\n  - Force the C# code labels for goto statements to always use an IL offset padded to 4 bytes\n  - Fixed a stack overflow that occurred when decompiling very large methods bodies that resulted in dnSpy completely crashing\n  - Improved handling of in parameters for method calls\n\n## Dependency updates:\n\n- Updated VS MEF to 17.10.37\n- Updated Roslyn to 4.10\n- Update NuGet.Configuration to 6.10\n- Updated dbgshim.dll component to the latest version\n\n## New Contributors\n\n- @geokar2006 made their first contribution in #294\n- @QianMoXi made their first contribution in #290\n- @Wulian233 made their first contribution in #309\n\nFull Changelog: https://github.com/dnSpyEx/dnSpy/compare/v6.5.0...v6.5.1\n\nThanks to everyone for reporting issues, opening pull requests, and supporting the project through other means! This release would not have been possible\notherwise :P A special thanks goes out to all my current and past GitHub Sponsors for supporting this project and me working on it!\n\nSHA-256 hashes:\ndnSpy-net-win32.zip: 90f31f7af3250c19e28641f37ed627e9aeb67b27332dd8e125084d605035c668\ndnSpy-net-win64.zip: 7b4e16ffdeded7e27785377f110388e4afb52250d4606246d52154e935be0ee8\ndnSpy-netframework.zip: 95816dae47093966ccdb780c063f71576640d85d3e8584de490be43b1452f4e4","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"6.5.1","site":"https://github.com/dnSpyEx/dnSpy","source":"WinGet","license_or_tos":"GPL-3.0","resources":null,"verified":false}