{"appId":"winget_app_Unity.Unity.CN.6000","appShortcutName":"Winget Application","appDisplayName":"Unity 6000 (CN Version)","authorId":"winget","releaseTagName":"winget-6000.0.19f1c1","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://download.unitychina.cn/download_unity/d2e6395b8809/Windows64EditorInstaller/UnitySetup64-6000.0.19f1c1.exe"}},"install":{"win32":{"assetId":1,"exec":null,"installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"The world’s leading platform for real-time content creation\n\nUnity is the ultimate game development platform.\nUse Unity to build high-quality 3D and 2D games, deploy them across mobile, desktop, VR/AR, consoles or the Web, and connect with loyal and enthusiastic players and customers.\nKnown Issues in 6000.0.19f1\n- 3D Physics: Crash on PhysicsDebugDrawSelectFilteringUpdate when entering play mode with Physics Debug window docked and unfocused (UUM-79618)\n- Android: Error in onPixelCopyFinished after updrading to Unity 6 (UUM-79451)\n- DirectX12: Crash on BufferD3D12::BeginWrite when enabling water exclusion in the Underwater sample scene (UUM-77863)\n- DirectX12: Crash on GfxDeviceD3D12Base::DrawBuffersCommon when opening a project after changing the Graphics API to DirectX12 (UUM-77757)\n- Editor Platform: [Linux] Crash on 'PPtr::operator RuntimeAnimatorController*() const' when saving a new animation file (UUM-79812)\n- Graphics Optimization Systems: Shader errors in DXC when building an empty URP project for Windows platform on a MacOS machine (UUM-78665)\n- Hybrid Renderer: [Linux] Crash on ScriptableBatchRenderer::GenerateBuiltInCBuffer when adding \"PerObjectData.ReflectionProbes\" (UUM-79332)\n- Lighting: Block compression leads to lightbaking artifacts in HDRP (UUM-74735)\n- PhysX Integration: OnTriggerStay is called indefinitely after first time it is triggered when there is no GameObject inside the trigger (UUM-78460)\n- SRP Core: [URP 3D Sample] Light rendering artifacts visible in Universal 3D Sample Template. It seems to be that Shader Graphs/Screen_Graph is causing the issue. Disabling objects with this material will no longer reproduce light artifacts.\n  [UUM-78796] <https://issuetracker.unity3d.com/issues/light-rendering-artifacts-visible-in-universal-3d-sample-template>\n- SRP Templates: Buffer count exceeding default GL_MAX_SHADER_STORAGE_BUFFER_BINDINGS Shader Warnings are thrown after switching platform to Linux/Linux Server when using Universal 3D Template (UUM-76186)\n- SRP Workflow: Missing dependencies in Universal RP package when installing Unity Editor offline (UUM-79004)\n- Vulkan: Editor crash when changing Vulkan Number of Swapchain Buffers (UUM-60016)\n6000.0.19f1 Release Notes\nFixes\n- 2D: Added depth write/test controls to sprite targets in shadergraph. (UUM-78999)\n- 2D: Fixed an issue where Grid Transform Tools can be selected for Tiles that had Lock Transform set. (UUM-79201)\n- 2D: Fixed case where ShaderGraph sprite is replaced by a blue box when using ShaderGraph Material. (UUM-77050)\n- Android: Fixed an issue with building Addressables content when an empty folder is added to the addressable group. (UUM-77003)\n- Editor: Fixed a crash in shader variant prefiltering when renderpipeline asset had a broken reference. (UUM-76152)\n- Editor: Fixed an issue in the Project browser where the top toolbar would not display correctly when the Escape key was pressed on macOS. (UUM-61582)\n- Editor: Fixed an issue where the loading fallback shader threw an error when first starting the editor in GRD-enabled projects. (UUM-74172)\n- Editor: Fixed crash when a Material Variant was missing its ancestor. (UUM-77741)\n- Editor: Removed material variant creation when any material selected. (UUM-78852)\n- GI: Made baking independent of color space and added test coverage. (GFXFEAT-829)\n- Graphics: Fixed a crash when trying to clear depth targets under special circumstances. (UUM-78063)\n- Graphics: Fixed an issue where the Editor crashed when context.DrawShadows(...) had an invalid light index. (UUM-78922)\n- HDRP: Fixed an issue so light intensity now correctly increases when 'Lux at Distance' increases and vice versa. (UUM-78394)\n- HDRP: Fixed an issue to push the correct cascade shadow matrix for each cascade. (UUM-72086)\n- HDRP: Fixed depth of field blocky artifacts when using a high blur radius. (UUM-74986)\n- HDRP: Fixed some depth of field jittering with objects in the near field and TAA enabled. (UUM-77173)\n- HDRP: PBR depth of field now has a bokeh shape that corresponds better to the aperture settings of the camera. (UUM-77172)\n- Physics: Fixed an issue where filtering data would not be properly propagated to a WheelCollider from its Rigidbody. (UUM-78024)\n- SRP Core: Added stencil flag to read-only depth logic in NRP compiler to avoid unintentional usage of depth read and stencil write states on some APIs. (UUM-79183)\n- SRP Core: Fixed potential data corruption due to incorrect native render pass store action in NRP compiler. (UUM-79181)\n- Undo System: Delayed undo diff calculations on Canvases within PrefabStage. (UUM-76366)\n- URP: Fixed some shader warnings in builds. (UUM-78471)\n- VFX Graph: Fixed corrupted graph when a custom type was missing. (UUM-69716)\n- VFX Graph: Fixed node search expand/collapse button, which could be blurry, depending on screen DPI setting. (UUM-75291)\n- WebGL: [WebGPU] Fixed webcam texture resolution scaling.\nPackage changes in 6000.0.19f1\nPackages updated\n- com.unity.2d.aseprite: 1.1.5 to 1.1.6\n- com.unity.inputsystem: 1.9.0 to 1.10.0\n- com.unity.ai.navigation: 2.0.3 to 2.0.4\n- com.unity.addressables.android: 1.0.3 to 1.0.4","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"6000.0.19f1c1","site":"https://unity.cn/","source":"WinGet","license_or_tos":"Proprietary","app_page":"https://unity.cn/releases","resources":null}