{"appId":"winget_app_GitHub.cli","appShortcutName":"Winget Application","appDisplayName":"GitHub CLI","authorId":"winget","releaseTagName":"winget-2.62.0","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/cli/cli/releases/download/v2.62.0/gh_2.62.0_windows_amd64.msi"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Take GitHub to the command line\n\nGitHub CLI (gh) is a command-line tool that brings pull requests, issues, GitHub Actions, and other GitHub features to your terminal, so you can do all your work in one place.\nWhat's Changed\n- Update monotonic verification logic and testing by @malancas in #9856\n- Check extension for latest version when executed by @andyfeller in #9866\n- Shorten extension release checking from 3s to 1s by @andyfeller in #9914\n- Mention GitHub CLI team on discussion issues by @andyfeller in #9920\n\nFull Changelog: https://github.com/cli/cli/compare/v2.61.0...v2.62.0\n\nSecurity\n  - A security vulnerability has been identified in GitHub CLI that could allow remote code execution (RCE) when users connect to a malicious Codespace SSH server and use the gh codespace ssh or gh codespace logs commands.\n  For more information, see https://github.com/cli/cli/security/advisories/GHSA-p2h2-3vg9-4p87\n\nGitHub CLI notifies users about latest extension upgrades\n  Similar to the notification of latest gh releases, the v2.62.0 version of GitHub CLI will notify users about latest extension upgrades when the extension is used.\n\n  This removes a common pain point of extension authors as they have had to reverse engineer and implement a similar mechanism within their extensions directly.\n\n  With this quality of life improvement, there are 2 big benefits:\n  1. Extension authors will hopefully see increased adoption of newer releases while having lower bar to maintaining their extensions.\n  2. GitHub CLI users will have greater awareness of new features, bug fixes, and security fixes to the extensions used.\n\n  Extension authors should review their extensions and consider removing any custom logic previously implemented to notify users of new releases.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"2.62.0","site":"https://github.com/home/","source":"GitHub, Inc.","license_or_tos":"MIT","resources":null,"verified":false}