{"appId":"winget_app_Unity.Unity.CN.2022","appShortcutName":"Winget Application","appDisplayName":"Unity 2022 (CN Version)","authorId":"winget","releaseTagName":"winget-2022.3.45f1c1","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://download.unitychina.cn/download_unity/1aff9500e86c/Windows64EditorInstaller/UnitySetup64-2022.3.45f1c1.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"The world’s leading platform for real-time content creation\n\nUnity is the ultimate game development platform.\nUse Unity to build high-quality 3D and 2D games, deploy them across mobile, desktop, VR/AR, consoles or the Web, and connect with loyal and enthusiastic players and customers.\nKnown Issues in 2022.3.45f1\n- Addressable Assets: [Android] [Entities] Build fails with the error “Asset has disappeared while building player to 'globalgamemanagers.assets' - path '', instancedID '-xxxxxx'“ when building (UUM-41830)\n- Asset - Database: Crash on GetAssetCachedInfoV2 when opening a project (UUM-14959)\n- DirectX12: Crash on GfxDeviceD3D12Base::DrawBuffersCommon when opening a project after changing the Graphics API to DirectX12 (UUM-77757)\n- Mono: [TypeCache] Crash on RaiseException when opening a specific project (UUM-66498)\n- Serialization: Crash on TypeTreeQueries::GetFullTypeNameFromReferencedType when an xoJunction GameObject is selected in the Hierarchy Window (UUM-74373)\n2022.3.45f1 Release Notes\nChanges\n- Editor: The editor now ships upstream 7-Zip (without support for zstandard compression), instead of 7-Zip-zstd/p7zip-zstd. (UUM-37529)\nFixes\n- AI: Nav mesh agent will not move in Y axis if the surface is rotated to 90 in X. (UUM-49446)\n- Android: Fixed misspelling in AndroidPluginImporterUtilities name. (UUM-77692)\n- Android: Fixed the problem with native plugin being skipped for ARMv7 architecture if target CPU is not set. (UUM-77679)\n- Audio: Reverted change to buffering code in OpenSL FMOD driver. (UUM-76489)\n- Editor: Editor: Fixed leak of Windows GDI objects when calling DisplayDialog. (UUM-76440)\n- Editor: Fixed for deadlock after domain reload. (UUM-72710)\n- Editor: Fixed issues with HDR rendering on visionOS using the built-in render pipeline. (UUM-78641)\n- Editor: Fixed the issue of Linux freezing whenever a file is dragged and drop from Unity to VSCode. (UUM-60652)\n- Editor: Fixed visionOS app icons warning.\n- Editor: Show the progress dialog when exporting a package on macOS to prevent the ability to perform other actions and lead to potential crashes or duplicate exports. (UUM-72387)\n- GI: Fixed an issue where shader variants with LIGHTMAP_ON, but which don't declare DIRLIGHTMAP_COMBINED, were stripped during player builds when using directional lightmapping. (UUM-68495)\n- iOS: Fixed the path where the image from a custom splash storyboard is stored. (UUM-75585)\n- Particles: Crash with Shape Module in Mesh mode while spawning inactive object through prefab or asset bundle. (UUM-43091)\n- Particles: Fixed invisible particles when shape Arc is set to 0 and Mode set to Loop. (UUM-78236)\n- Profiler: Fixed an error being logged the the console when hovering the BackgroundPattern element in UI Builder. (UUM-68488)\n- Profiler: Fixed high memory usage detection by profiler when there is still enough physical memory available. (UUM-78350)\n- Scripting: Added missing attribute MustDisposeResourceAttribute in JetBrains.Annotations. (UUM-75305)\n- Scripting: Fixed remapping lists of object references in InstantiateAsync. (UUM-77930)\n- Scripting: PluginImporter.ClearSettings shouldn't apply default values. (UUM-77816)\n- Shadergraph: Fixed a bug where the Custom Function node's \"Body\" field would expand off-screen instead of scrolling. (UUM-76270)\n- Shadergraph: Users can no longer select 'Delete' for context blocks. (UUM-76198)\n- UI Toolkit: Corrected implement background repeat rounded corner. (UUM-72717)\n- UI Toolkit: Fixed interactive slider in samples page. (UUM-76804)\n- UI Toolkit: Updated the background color in dark mode for the UI Builder foldouts. (UUM-76815)\n- Universal RP: Fixed an issue where Shader Prefiltering data wasn't updated properly for Asset Bundles. (UUM-52890)\n- Universal RP: Fixed camera offset in the UI editor for the RenderObject RenderFeature. (UUM-76307)\n- VFX Graph: Fixed potential error message in the console when starting Unity Editor. (UUM-76346)\n- Video: Fixed an issue where the sound of videos in Video Player is lost when Bluetooth headphones are connected or disconnected. (UUM-75469)\n- WebGL: Fixed a bug where mouse button canceled events would emit after clicking and moving a mouse. (UUM-65367)\n- Windows: Fixed issue where Arm64 architecture DLLs are incorrectly copied instead of x64 when building for Windows x64. (UUM-76845)\nPackage changes in 2022.3.45f1\nPackages updated\n- com.unity.2d.aseprite: 1.1.4 to 1.1.5\n- com.unity.services.vivox: 16.3.0 to 16.5.0\n- com.unity.transport: 1.4.1 to 1.5.0","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"2022.3.45f1c1","site":"https://unity.cn/","source":"WinGet","license_or_tos":"Proprietary","app_page":"https://unity.cn/releases","resources":null}