{"appId":"winget_app_Sinew.Enpass","appShortcutName":"Winget Application","appDisplayName":"Enpass","authorId":"winget","releaseTagName":"winget-6.11.6.1833","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Enpass is a cross-platform password management app to securely store passwords and other credentials in a virtual vault locked with a master password. Unlike most other popular password managers, Enpass is an offline password manager.\n\n\nHowdy Enpassians!\nAs 2024 draws to a close, we’re focused on clearing out the backlog of reported issues to enhance your Enpass experience. This update brings numerous fixes and improvements based on your feedback, ensuring a smoother, more reliable app experience.\nFixes:\n- Resolved an issue where some users were encountering error code 315993 during iCloud syncing.\n- Fixed an issue with folder sync and Wi-Fi sync that caused high CPU usage.\n- Fixed an issue preventing users from editing items when opened in compact window size.\n- Fixed interruptions during item editing, ensuring seamless syncing without view switching.\n- WebDAV sync now works seamlessly with Mailbox.org.\n- Fixed an issue with multi-monitor setups, ensuring both the app and browser extension open on the selected display.\n- 'Erase Everything' no longer resets the data location path.\n- Fixed an issue where users were unable to access data on network folders after changing permissions (on the network drive) to read-only.\n- Other minor bug fixes and crash fixes.\nFor Enpass Business Users:\n- Fixed shared vault write permissions mistakenly acting as read-only because of multiple permissions on the same vault.\n- Fixed an issue where vault sharing was not working for vaults in Private team channels.\n- Fixed false key conflict alerts after admin key resets.\n- Resolved duplicate registration errors during Hub authentication.\nQuestions? Visit discussion.enpass.io for help, email support@enpass.io, or tweet @EnpassApp.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"6.11.6.1833","site":"https://www.enpass.io/","source":"Enpass Technologies Inc.","license_or_tos":"Proprietary","resources":null,"verified":false}