{"appId":"winget_app_DOSBoxStaging.DOSBoxStaging","appShortcutName":"Winget Application","appDisplayName":"DOSBox Staging","authorId":"winget","releaseTagName":"winget-0.82.0-9df43","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/dosbox-staging/dosbox-staging/releases/download/v0.82.0/dosbox-staging-windows-x64-v0.82.0-setup.exe"}},"install":{"win32":{"assetId":1,"exec":null,"installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"DOSBox Staging is a modern continuation of DOSBox — your existing configurations will continue to work, and you will have access to many advanced features.\n\nDOSBox Staging is a modern continuation of DOSBox with advanced features and current development practices.\nIt is a (mostly) drop-in replacement for older DOSBox versions—your existing configurations will continue to work, and you will have access to many advanced features.\nDOSBox Staging comes with sensible defaults, so you’ll need to write a lot less configuration than with older DOSBox versions. Most games and applications require no tweaking and will work fine with the stock settings. However, the extensive configuration options and advanced features are available if you wish to delve deeper. Please refer to the Feature highlights on our front page to learn more about these.\nJust six short months after our monstre 0.81.0 release, we're back with another big one that adds\n- Pentium MMX emulation, - ESS Enhanced FM Audio, - numerous audio-related enhancements, - a large number of game compatibility fixes, - improved Windows 3.1x compatibility, - supercharged 3dfx Voodoo emulation performance, - experimental Windows ARM64 support,\nand a lot more!\nRead on to get the full story! :sunglasses:","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"0.82.0-9df43","site":"https://www.dosbox-staging.org/","source":"WinGet","license_or_tos":"GPL-2.0-or-later","resources":null,"verified":false}