{"appId":"winget_app_BleachBit.BleachBit","appShortcutName":"Winget Application","appDisplayName":"BleachBit","authorId":"winget","releaseTagName":"winget-4.6.0.2537","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Clean Your System and Free Disk Space\n\nWhen your computer is getting full, BleachBit quickly frees disk space. When your information is only your business, BleachBit guards your privacy. With BleachBit you can free cache, delete cookies, clear Internet history, shred temporary files, delete logs, and discard junk you didn't know was there. Designed for Linux and Windows systems, it wipes clean thousands of applications including Firefox, Adobe Flash, Google Chrome, Opera, and more. Beyond simply deleting files, BleachBit includes advanced features such as shredding files to prevent recovery, wiping free disk space to hide traces of files deleted by other applications, and vacuuming Firefox to make it faster. Better than free, BleachBit is open source.\nChanges\nThese are the changes since version 4.4.2:\n- Clean recently-closed tabs on Firefox (reported by Luran2132).\n- Clean autofill data in Chromium-based browsers (thanks to rados).\n- Clean more of Firefox: AlternativeServices.txt.\n- Improve support for FileZilla (thanks to fbruand).\n- Support new versions of GIMP and add runtime detection (thanks to Finoway).\n- Fix AttributeError and \"OperationalError: no such table\" when cleaning Firefox (thanks to rados and az0).\n- Add workaround for DLL security vulnerability (reported by Daniel Hulliger, aka dhulliger).\n- Prevent opening other dialogs when making chaff (thanks to sanjaykaria).\n- Vacuum last after other operations in every language (reported by Tobias-B-Besemer, fixed by sanjaykaria).\n- Add title for dialogs.\n- Enable more strings to be translated (reported by bovirus).\n- Improve organization of --help in the CLI (thanks to abitrolly).\n- Show debug information in CLI only if --debug or --preset is set (thanks to abitrolly).\n- Fix crash when wiping free space with Brazilian Portuguese (reported by fnfontana).\n- Specific to Linux\n  - Clean Microsoft Edge on Linux (requested by aoguang).\n  - Clean Firefox and Thunderbird when installed as Flatpak (thanks to MauroGuida).\n  - Clean Google Chrome as Flatpak (thanks to fbruand).\n  - Clean recent documents list on KDE 5 (thanks to Martii).\n  - Clean Firefox installed as a snap (thanks to rodin-ia).\n  - Add shred context menu for KDE (thanks to kenrap).\n  - Keep bookmark icons in Firefox (thanks to rados).\n  - Keep xauth files in /tmp (reported by iromeister).\n  - Fix \"Permission denied: /proc/\" (reported by igorog).\n  - Use branded icon in application launcher (thanks to baraeerriyachy).\n  - Fix detection of invalid .desktop files (thanks to kenrap).\n  - Fix the error \"The child memory-wiping process returned code 9.\" (thanks to jonas-w).\n  - Notify user when running as root with Wayland (thanks to rados).\n  - Fix ModuleNotFoundError (reported by hbednar).\n  - Remove Windows-specific files from Linux packages, again (reported by robots4life).\n  - Remove unneeded SafeConfigParser causing startup error on Python 3.12 (thanks to mhmdanas).\n  - Do not show error \"Gtk-CRITICAL **: gtk_text_view_scroll_mark_onscreen\" (reported by idiowar, fixed by mkhon).\n  - Add python3-psutil dependency.\n- Specific to Windows\n  - Clean more Windows updates (reported by liar666).\n  - Fix Windows redirection in Internet Explorer (reported by elgatov).\n  - Fix fullscreen bug (thanks to sanjaykaria).\n  - Internationalize Windows installer and translate to Italian (thanks to bovirus).\n  - Add descriptions for components in installer (thanks to bovirus).\n  - Do not report error when wiping path that does not exist (reported by i0629).\n  - Allow Winapp to have drive letter followed by filename (thanks to rados).\n  - Update bundled SQLite from 3.37.2 to 3.43.2.\n  - Update UPX executable compressor to 4.1.0.\n- Developers\n  - See the list of commits or list of closed issues.\n  - Translation has moved from Launchpad to Weblate, which automatically commits changes via Git, which in turn triggers CI builds. This means you can download a Windows build shortly after making translation changes. Weblate also has usability improvements and features to enhance quality.\n  - Install dependency chardet on Travis (thanks to abitrolly).\n  - Refactor (thanks to kenrap).\n  - Clean more files with make clean.\n\nKnown issues\nWhen installing on Windows, users may see the error \"Code execution cannot proceed because msvcr100.dll was not found.\" This happens during the font cache initialization, and the installer will show that fc-cache.exe is running. If you have this msvcr100.dll error, install Visual Studio 2010 (VC++ 10.0) redistributable SP1 x86. Even on 64-bit systems, the x64 version will have no effect, so please use the x86 version. If this does not help, please file a bug ticket in GitHub to get one-on-one support. Alternatively, you may downgrade to BleachBit 4.4.2 (final) or upgrade to BleachBit 4.6.1 (pre-beta).","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"4.6.0.2537","site":"https://www.bleachbit.org/","source":"WinGet","license_or_tos":"GPL-3.0","app_page":"https://www.bleachbit.org/","resources":null}