{"appId":"winget_app_AppFlowy.AppFlowy","appShortcutName":"Winget Application","appDisplayName":"AppFlowy","authorId":"winget","releaseTagName":"winget-0.7.0","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/microsoft/winget-pkgs/releases/download/winget-0.7.0/"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/microsoft/winget-pkgs/releases/download/winget-0.7.0/"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"The Open Source Alternative To Notion.\n\nAppFlowy is an open source alternative to Notion.\nYou are in charge of your data and customizations.\nRelease Notes\nVersion 0.7.0 - 19/09/2024\nNew Features\n- Support reordering blocks in document with drag and drop\n- Support for adding a cover to a row/card in databases\n- Added support for accessing settings on the sign-in page\n- Added \"Move to\" option to the document menu in top right corner\n- Support for adjusting the document width from settings\n- Show full name of a group on hover\n- Colored group names in kanban boards\n- Support \"Ask AI\" on multiple lines of text\n- Support for keyboard gestures to move cursor on Mobile\n- Added markdown support for quickly inserting a code block using three backticks\nBug Fixes\n- Fixed a critical bug where the backtick character would crash the application\n- Fixed an issue with signing-in from the settings dialog where the dialog would persist\n- Fixed a visual bug with icon alignment in primary cell of database rows\n- Fixed a bug with filters applied where new rows were inserted in wrong position\n- Fixed a bug where \"Untitled\" would override the name of the row\n- Fixed page title not updating after renaming from \"More\"-menu\n- Fixed File block breaking row detail document\n- Fixed issues with reordering rows with sorting rules applied\n- Improvements to the File & Media type in Database\n- Performance improvement in Grid view\n- Fixed filters sometimes not applying properly in databases","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"0.7.0","site":"https://github.com/AppFlowy-IO","source":"WinGet","license_or_tos":"AGPL-3.0","app_page":"https://github.com/AppFlowy-IO/AppFlowy","resources":null}