{"appId":"winget_app_pizzaboxer.Bloxstrap","appShortcutName":"Winget Application","appDisplayName":"Bloxstrap","authorId":"winget","releaseTagName":"winget-2.8.0","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/bloxstraplabs/bloxstrap/releases/download/v2.8.0/Bloxstrap-v2.8.0.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"An open-source, feature-packed alternative bootstrapper for Roblox.\n\n\nAdditions\n- There is now an analytics system, which will be enabled by default.\n  See the privacy policy for more information about that.\n  You can disable it in Bloxstrap Settings under the \"Bloxstrap\" tab.\nFeatures\n- Featuring the ability to view your game history, allowing you to see a summary of your play session or quickly rejoin servers.\n- Featuring the ability to show what Roblox account you're playing with on your Discord Rich Presence activity. (thank you @axellse!)\n- Featuring a new tool called \"test mode\", which allows you to easily test how your configured settings actually affect Roblox.\n- BloxstrapRPC now features the ability to set launch data for invite deeplinks.\nOther\n- Bloxstrap now has a proper installation UI, instead of barfing all the options in your face the first time you use it.\n- Bloxstrap now has a general launch menu.\n  Running the Bloxstrap executable directly now shows this menu instead of just launching Roblox.\n- It's now possible to cancel the bootstrapper when Roblox is in the middle of launching.\n- Bloxstrap now verifies if Roblox launches properly.\n- Bloxstrap now remembers the position and size of your Settings window.\n- Reporting a GitHub issue through the exception dialog now automatically includes the corresponding log file.\n- Bloxstrap now warns you of unsaved changes when you close the Settings window.\n- If your settings fail to load, Bloxstrap now warns you about that.\n- Added an easy option for resetting the FastFlag configuration back to defaults.\n- When installing/upgrading Roblox, the progress is now shown in the taskbar.\nExisting changes\n- \"Bloxstrap Menu\" is now called \"Bloxstrap Settings\", or just \"Settings\".\n  The dedicated shortcut for it is also now gone.\n  To get to it, use the \"Bloxstrap\" shortcut.\n- By default, there is now only one singular \"Bloxstrap\" shortcut which opens the launch menu.\n  In settings, you can choose to create shortcuts for specifically opening settings or launching Roblox.\n- Bloxstrap now installs Roblox to a static \\Roblox\\Player\\, instead of a constantly changing \\Versions\\version-xxxxxxxxxxxxxxxx\\ folder.\n  Therefore, it is now possible to make applications locate RobloxPlayerBeta without having to worry about the location changing.\n- Also, there's no longer a dedicated option for disabling fullscreen optimizations.\n  Instead, you can now do it through compatibility settings.\n- \"Fast Flags\" are now referred to as \"Engine Settings\" to better reflect what purpose they serve for general users.\n- Bloxstrap now shows friendly, helpful error messages when unable to write to the registry, or when the install process fails.\n- When creating a custom integration, the name is now autofilled when you choose an application. (thanks @Flikter!)\n- Discord Rich Presence no longers displays the word \"Playing\" on your activity details, now just showing the game name.\n- The \"Behaviour\" tab in Settings has been split into two smaller tabs: \"Bootstrapper\" and \"Bloxstrap\".\n- Better bootstrapper error handling, will allow Roblox to continue launching if there's a connectivity error.\n- All options in Bloxstrap Settings (such as configuration of mod presets) now take effect only and immediately when you click the Save button.\nBug fixes\n- Bloxstrap's installation system has been completely rewritten.\n  Besides the new installer UI, the new system should be far more stable, addressing all the issues with it that existed before.\n- Fixed flag presets being cleared when setting the texture quality to Automatic.\n- For the font size flag preset, negative font sizes can now be set for making text smaller than default.\n- The flag preset for the legacy escape menu options should now be fixed.\n- Fixed font file validation (#2982)\nFlag editor\n- PlaceFilter flags are now properly supported in the flag editor (thank you @srthMD!)\n- Importing a flag with a null value no longer causes a crash\n- Sorting the table by value no longer breaks things\nRemovals\n- The option for the advanced graphics quality slider is now gone, as it broke some time back.\nLocalisation\n- Malay and Czech are now supported languages.\n- Support for Bengali, Bosnian, Filipino, Hindi, Indonesian, Korean, Norwegian, and Chinese Traditional (Hong Kong) have had to be removed due to a lack of translators.\n  If you want to get into contributing translations, learn how to.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"2.8.0","site":"https://pizzaboxer.xyz","source":"WinGet","license_or_tos":"MIT","resources":null,"verified":false}