{"appId":"winget_app_JetBrains.Rider","appShortcutName":"Winget Application","appDisplayName":"JetBrains Rider","authorId":"winget","releaseTagName":"winget-2024.2.6","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/microsoft/winget-pkgs/releases/download/winget-2024.2.6/"},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/microsoft/winget-pkgs/releases/download/winget-2024.2.6/"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Fast & powerful cross-platform .NET IDE\n\nDevelop .NET, ASP.NET, .NET Core, Xamarin or Unity applications on Windows, Mac, Linux\nRider 2024.2.6 is available!\nRider has finally introduced support for the Solution File Persistence Model, aka the .slnx format for solution files (RIDER-110777), the latest clean and streamlined approach to storing all solution data. Upgrade your solution file to enjoy the benefits!\nWith Rider, you can now switch to the new format hassle-free right from the Solution Explorer. Just call the context menu for the solution node, navigate to Save As…, and select Save as XML Solution (.slnx). You will then have the option to open your solution via the newly created .slnx file to make the transition to the new format seamless.\nHere is the list of notable fixes:\n- The Show Diff Preview on Single Click option has been added back to the three dots menu on the Commit window, so you can once again choose the desired behavior (RIDER-115952).\n- There is no longer a problem with copying/cutting/pasting text from Rider with the Code With Me feature enabled (RIDER-117610).\n- A shortcut for the Rename refactoring action works in the File System view for files which aren’t included in a project or a solution (RIDER-116868).\nTo see the whole list of fixed issues, please visit this page.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"2024.2.6","site":"https://www.jetbrains.com/","source":"WinGet","license_or_tos":"Proprietary","app_page":"https://www.jetbrains.com/rider/","resources":null}