{"appId":"winget_app_Redisant.RedisAssistant","appShortcutName":"Winget Application","appDisplayName":"Redis Assistant","authorId":"winget","releaseTagName":"winget-2.0.2.5","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/microsoft/winget-pkgs/releases/download/winget-2.0.2.5/"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/microsoft/winget-pkgs/releases/download/winget-2.0.2.5/"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Redis Visual Management & Monitoring\n\nRedis visual management and monitoring - Applies to string, list, hash, set and sorted set.\n\n- Redis Assistant render the interface by making full use of GPU, leading to the higher fluidity and the less resource usage of the software.\n- Dashboard function helps you monitor the Redis service status in real time.\n- Redis Assistant will be smooth and stable even when processing millions of keys and fields.\n- Redis Assistant can recognizes and formats the different data automatically, including Text, JSON, XML, HEX, MessagePack. More data format will be added later.\n- As a good helper for troubleshooting, Redis Assistant could help you monitor the memory usage of the entire database timely.\n- You can search for Key, Hash, Set, ZSet, List, and even perform regular, whole word, and case matching in the value, so that the data you wanted will be displayed immediately.\n- With Redis Assistant, you can easily edit and execute Lua scripts: execute, terminate, clear Lua cache, load this into cache, search scripts.\n- [Fixed] Fixed the problem of not being able to display compressed data such as Gzip and Snappy [Improved] Upgraded dependencies","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"2.0.2.5","site":"https://www.redisant.com/","source":"WinGet","license_or_tos":"Proprietary","app_page":"https://www.redisant.com/","resources":null}