{"appId":"winget_app_vkbo.novelWriter","appShortcutName":"Winget Application","appDisplayName":"novelWriter","authorId":"winget","releaseTagName":"winget-2.5.2","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/vkbo/novelWriter/releases/download/v2.5.2/novelwriter-2.5.2-amd64-setup.exe"}},"install":{"win32":{"assetId":1,"exec":null,"installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A markdown-like editor for novels\n\nA markdown-like text editor designed for writing novels and larger projects of many smaller plain text documents.\nIt is designed to be a simple text editor that allows for easy organisation of text files and notes, with a meta data syntax for comments, synopsis, and cross-referencing between files, and built on plain text files for robustness.\nRelease Notes\nThis is a patch release that fixes a series of issues mostly affecting dialogue highlighting in the document viewer. The way the text is formatted in the viewer changed a lot in 2.5, and there were a few issues with the new implementation. The tab stop distance setting was also ignored, but has now been fixed as well.\nDetailed Changelog\nBugfixes\n- Fixed an issue where the tab stop distance setting was being ignored in the document viewer. It must be set again every time a document is loaded. Issue #1996. PR #2014.\n- Fixed an issue with overlapping formatting markers when processing text into new formats. This issues was introduced when dialogue highlighting was added to the document viewer and manuscript build. It arises because start and end of dialogue can occur on the same character as other formatting, and then the order these markers are processed matters. This was not properly handled in the code. Issue #2012. PR #2014.\n- Dialogue highlighting is now only applied to plain text paragraphs, not comments, headings, and other places where there should be no dialogue. Issue #2013. PR #2014.\n- Note documents no longer get dialogue highlighting. Issue #2011. PR #2014.\nDocumentation\n- Added a section about spell checking in the documentation. PR #2015.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"2.5.2","site":"https://berglyd.net/","source":"novelWriter","license_or_tos":"GPL-3.0","resources":null,"verified":false}