{"appId":"winget_app_MintplexLabs.AnythingLLM","appShortcutName":"Winget Application","appDisplayName":"AnythingLLM","authorId":"winget","releaseTagName":"winget-1.6.8","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://s3.us-west-1.amazonaws.com/public.useanything.com/latest/AnythingLLMDesktop.exe"}},"install":{"win32":{"assetId":1,"exec":null,"installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"The all-in-one AI app you were looking for. Chat with your docs, use AI Agents, hyper-configurable, multi-user, & no frustrating set up required.\n\nAnythingLLM is a full-stack application that enables you to turn any document, resource, or piece of content into context that any LLM can use as references during chatting. This application allows you to pick and choose which LLM or Vector Database you want to use as well as supporting multi-user management and permissions.\nWhat's New:\n\n-\n  You can now paste text, pictures, and files into the prompt input when focused if the items are on your clipboard.\n-\n  Generic OpenAI TTS connector is live. Any OpenAI compatible tts service will work now!\n-\n  Deepseek (opens in a new tab) LLM connector is now supported\n-\n  Apipie (opens in a new tab) LMM connector is now supported\n-\n  Fireworks (opens in a new tab) LLM connector is now supported\n-\n  XAI (opens in a new tab) Grok grok-beta LLM connector is now supported\n-\n  Tavily (opens in a new tab) SERP connector is now supported for agent web-search skill.\n-\n  O1 model support for OpenAI\n-\n  LiteLLM Agent support\n-\n  Workspace agent selection is no longer required to be set in the settings. It will auto-select the model and provider based on your workspace and then your system settings. You can still set it manually if you'd like.\n-\n  Bulk document removal from UI is now supported via checkbox selection on right panel.\n-\n  Select all is now supported in the directory component. Right-click on the directory panel to select/deselect all.\n-\n  Mistral multi-modal support\n-\n  Groq Image support (please use supported vision model.)\nImprovements:\n\n-\n  XLSX file upload support\n-\n  Gitlab connector can now pull issues in addition to code.\n-\n  Chat windows now auto-scrolls with reasonable behavior\n-\n  Show scrollbar Appearance setting to show scrollbar on right of chat windows for some users\n-\n  Freeform model input for chat models selection is now supported for LLMs with no /models endpoint. (Azure, Bedrock, etc.)\n-\n  Voyage model embedders were bumped to the latest versions.\n-\n  Github repo loader langchain was bumped to the latest version.\n-\n  Attachments in Dev API are now supported for API chats.\n-\n  File fetch speed improvements for the file picker\n-\n  UserID is now a supported option param in requests to the workspace thread endpoints for API.\nBug Fixes:\n\n-\n  Fixed a bug where the chat window would not scroll when you had a lot of messages.\n-\n  The agent model preference was not being respected for Bedrock and LMStudio. It now is.\n-\n  Handle non-ascii characters in single and bulk link scraper URLs\n-\n  Handle Bedrock models that cannot use system prompts (Titan)\n-\n  File name truncation on file rows overflowing the UI on file picker\n-\n  Dockerfile and Jenkinsfile file upload support\n-\n  Patch 11Labs selection bug not persisting in UI, while still being selected in the backend\n-\n  Patch bug in web-search and sql connector not persisting in UI, while still being selected in the backend\n-\n  GitHub handle /tree or /blob URLs from breaking collector.\nWhat's Next:\n\n- Community Hub for Agent skills, workspace sharing, and more.\n- True dark mode and light mode UI\n- Bump in internal OLLAMA provider to latest version + pulling in any valid Ollama tag via our UI.\n\n- optional - we may enable custom UI themes for AnythingLLM","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"1.6.8","site":"https://anythingllm.com/","source":"Mintplex Labs Inc","license_or_tos":"MIT","resources":null,"verified":false}