{"appId":"winget_app_OpenNoteBlockStudio.MinecraftNoteBlockStudio","appShortcutName":"Winget Application","appDisplayName":"Minecraft Note Block Studio","authorId":"winget","releaseTagName":"winget-3.10.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/microsoft/winget-pkgs/releases/download/winget-3.10.0/"},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/microsoft/winget-pkgs/releases/download/winget-3.10.0/"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Installer for Minecraft Note Block Studio\n\n\nAdditions\n- The MP3 export functionality has been reworked from scratch:\n- Renamed to 'Audio export', and added more output formats: WAV, AIFF, FLAC.\n- Added stereo support!\n  Panning on notes and layers will now be rendered correctly.\n- Added smart clipping detection!\n  Clipping will no longer occur on louder parts of the song, which is now normalized to 0 dBFS.\n- Added an option to choose the sampling rate of the exported track.\n- Added an option to choose between mono and stereo.\n- Fixed exported notes getting out-of-tune as they moved away from their original key.\n- The export time has been cut down by about 60%.\n- Added drop mode!\n  In this mode, instead of their usual grid arrangement, notes will scroll vertically and follow their corresponding key on the piano.\n  This mode is only accessible in the player mode.\n- The player mode can now be accessed from the greeting window, through a new button in the bottom-right corner, or by pressing F12.\n- Added smooth scrolling!\n  The workspace no longer clips to the grid while the song is playing.\n  This behavior can be enabled in Preferences > Playback.\n- Added a track export option, to create schematics in a straight line.\n- Added a setting to show flat symbols (b) instead of sharp symbols (#) on the piano.\n- Added a fading border effect when removing a note block by right-clicking, or deleting a selection.\n  This effect can be toggled in the Preferences.\n- Added Ctrl + middle-click to copy note velocity, panning and pitch values.\n- Added custom block selections for structure block export.\n- Added an option to place command blocks instead of note blocks in schematic export.\n- Added the ability to drag and drop pattern files into the window.\n- The 'Set velocity' macro can now be set above 100% in percentage mode.\nBugfixes and improvements\n- Note Block Studio is now compiled to a native executable with YYC, which should lead to a significant performance boost.\n- Added a preference to optimize the window scale for high resolutions.\n- With this option enabled, setting the window scale larger than 100% will no longer cause blurriness. (Only available in the Fluent theme).\n- The icon details in the Fluent theme will now reflect the accent color.\n- The Note Block Studio icon has been updated.\n  It's possible to return to the previous icon in Preferences.\n- The color of the window title bar will now match the program's theme.\n- The master volume bar can now be changed with the mouse wheel.\n- Fixed a rounding error in the global pitch calculation, which caused all played notes to gradually drift out of tune the more they moved away from their original key.\n- Fixed text boxes not registering key presses about half of the time.\n- Fixed the 'Get extra notes resource pack' button not working.\n- Fixed the mouse cursor flashing when dragging the edges of the window.\n- Fixed allowing the window to be resized too small.\n- Fixed the master volume bar being changeable while a window is open.\n- Fixed popups in the main area appearing while a window is open.\n- Fixed crashes under various circumstances.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"3.10.0","site":"https://github.com/HielkeMinecraft/OpenNoteBlockStudio","source":"WinGet","license_or_tos":"MIT License","app_page":"https://github.com/HielkeMinecraft/OpenNoteBlockStudio","resources":null}