{"appId":"winget_app_JohnMacFarlane.Pandoc","appShortcutName":"Winget Application","appDisplayName":"Pandoc","authorId":"winget","releaseTagName":"winget-3.5","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/jgm/pandoc/releases/download/3.5/pandoc-3.5-windows-x86_64.msi"}},"install":{"win32":{"assetId":1,"exec":null,"installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"If you need to convert files from one markup format into another, pandoc is your swiss-army knife.\n\n\n- Add command-line options --list-of-figures/--lof and --list-of-tables/--lot (#10029, Akash Patel). Only docx, latex, and context are affected by these options currently. Setting the lof and lot variables will also work for the formats that are currently supported.\n- Defaults files: interpolation of environment variables now works for to and from fields (#8024). This is needed because these files can contain paths of custom readers/writers.\n- Docx reader:\n    - Reset lists after headers in same list numId (#10258). To accomplish this, we add a Heading constructor to BodyPart and include on it all the information list items have.\n- DocBook reader:\n    - Parse id, class, and tabstyle on tables (#10181, Erik Rask). Add parsing of id (xml:id), class, and tabstyle XML attributes for table and informaltable in the DocBook reader. The tabstyle value is put in the ‘custom-style’ attribute.\n- Dokuwiki reader:\n    - Be more forgiving about misaligned lists, like dokuwiki itself (#8863).\n    - Improve blockquote parsing in dokuwiki. Allow for quoted code blocks.\n    - Enable smart extension.\n    - Properly parse -- and --- as dashes.\n    - Fix block quote behavior (#6461). Blockquotes are not really block containers in DokuWiki; the lines are interpreted literally (so, e.g., you can’t start a list), and line breaks are added at the ends.\n- EPUB reader:\n    - Fix links to other files in the EPUB, making them internal links to a fragment derived from the filename (#10207). There was already code to handle links like #foo, but not to handle links like ch0001.html#foo.\n- LaTeX reader:\n    - Add em, ex, px, mu to list of units for dimension args (#10212).\n- ANSI writer:\n    - Fix subscripts (Evan Silberman).\n- DokuWiki writer:\n    - Don’t emit <HTML> tags (#7413). The use of these tags is now strongly discouraged for security reasons, and will be removed. We previously used them as a fallback for lists that could not be represented using DokuWiki syntax, e.g. ordered lists with fancy numbers or lists with multiple blocks in their items. We also used them for block quotes with multiple blocks as their contents. We now use the <WRAP> syntax (from the optional WRAP plugin) to handle lists with multiple blocks as their contents. A new method of handling block quotes with complex contents has the side benefit of also handling nested block quotes, which weren’t supported before. <HTML> and <html> tags are only for raw HTML blocks and inlines, and only if the raw_html extension is enabled. (It is now a valid extension for dokuwiki, though off by default.)\n- Docx writer:\n    - Support --list-of-figures and --list-of-tables (or lof and lot variables) (Akash Patel).\n- HTML writer:\n    - Don’t emit missing title/lang warnings if templates does not contain the pagetitle or lang variables respectively (#9370).\n- LaTeX writer:\n    - Better fix for lists in definition lists (#10241). In commit we added an empty \\item[] to the beginning of a list that occurs first in a definition list, to avoid having one item on the line with the label. This gave bad results in some cases (#10241) and there is a more idiomatic solution anyway: using \\hfill.\n    - Avoid error on refs div with empty citations (#10185). If there are no citations, don’t emit an empty CSLReferences environment.\n- RST writer:\n    - Change bullet list hang from 3 to 2. This accords with the style in the RST reference docs.\n    - Handle cases where indented context starts with block quote (#10236). In these cases we emit an empty comment to fix the point from which indentation is measured; otherwise the block quote is not parsed as a block quote. This affects list items and admonitions.\n    - Don’t enclose the list table in a .. table::; this leads to doubled captions (#10226).\n    - Fix alignment of list table items corresponding to cells (#10227).\n- JATS template:\n    - Support floats-group (Albert Krewinkel, see #10196). The content of the floats-group variable is now rendered in a <floats-group> element when using the publishing or archiving tag sets.\n- LaTeX and Beamer templates:\n    - Split old default.latex into two templates, default.latex and default.beamer, factoring common parts into partials: fonts.latex, common.latex, passoptions.latex, hypersetup.latex, after-header-includes.latex.\n    - Make default.beamer the default template for beamer.\n    - Add shorttitle, shortsubtitle, shortauthor, shortinstitute, shortdate variables to beamer template (#10248, Thomas Hodgson).\n    - Make --number-sections work with beamer (#12045, Thomas Hodgson).\n    - Support a list of images for titlegraphic in beamer template (#10246, Thomas Hodgson). Title graphic options will be applied to each title graphic. Images will be separated by \\enspace.\n    - Beamer theme options (#10243)\n    - Add theme options to beamer template: colorthemeoptions, fontthemeoptions, innerthemeoptions, outerthemeoptions (#10243, Thomas Hodgson).\n    - Don’t load amsmath, amssym in beamer template. These are loaded by beamer automatically.\n- Text.Pandoc.SelfContained:\n    - Improve handling of links to remote CSS (#10261).\n- Text.Pandoc.Class:\n    - Allow extracting data: URIs even in PandocPure (--sandbox) (#10249).\n    - Export extractURIData [API change].\n- Text.Pandoc.PDF:\n    - Read .toc and .log files from output directory (#10186). When this is different from the input directory, this is where .toc and .log files are written.\n- Text.Pandoc.Shared:\n    - Modify addPandocAttributes for changes in commonmark-pandoc. The new commonmark-pandoc version automatically adds the attribute wrapper=\"1\" on all Divs and Spans that are introduced just as containers for attributes that belong properly to their contents. So we don’t need to add the attribute here. This gives much better results in some cases. Previously the wrapper attribute was being added even for explicit Divs and Spans in djot, but it is not needed in these cases.\n- Text.Pandoc.Options:\n    - Add writerListOfFigures and writerListOfTables fields to WriterOptions (#8245, Akash Patel). [API change]\n- Text.Pandoc.App:\n    - Add optListOfFigures and optListOfTables to Opt (#8245) [API change].\n- Lua subsystem (Albert Krewinkel):\n    - Update List module (#9835). The module now comes with a method :at(index[, def]) that allows to access indices, accepts negative indices to count from the end, and will return the def value as a default if the list has no item at the given position. Furthermore, the list constructor pandoc.List now accepts iterators. E.g., pandoc.List(text:gmatch '%S+') returns the list of words in text.\n    - Support character styling via pandoc.layout. The Doc values produced and handled by the pandoc.layout module can now be styled using bold, italic, underlined, or strikeout. The style is ignored in normal rendering, but becomes visible when rendering to ANSI output. The pandoc.layout.render function now takes a third parameter that defines the output style, either plain or ansi.\n    - It is now possible to return a single filter from a filter file, e.g.\n-- Switch single- and double quotes\nreturn {\n  Quoted = function (q)\n    elem.quotetype = elem.quotetype == 'SingleQuote'\n      and 'DoubleQuote' or 'SingleQuote'\n    return elem\n  end\n}\n\nThe filter must not contain numerical indexes, or it might be treated as a list of filters.\n    - Add list_of_figures and list_of_tables to writer options (Akash Patel).\n- Use latest releases of commonmark, commonmark-pandoc, texmath, djot.\n- Stop depending on package SHA (Albert Krewinkel). Use crypton instead.\n- linux/make_artifacts.sh: add riscv64 support (Olivier Benz).\n- Fix invalid XML in test/docx/normalize.docx (#10242).\n- doc/lua-filters.md: list functions in pandoc.utils alphabetically (Albert Krewinkel).\n- MANUAL.txt:\n    - Clarify use of beamerarticle variable (#10250).\n    - Add clarification to address user issues like #6704 (Yehuda Katz).","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"3.5","site":"https://github.com/jgm/pandoc","source":"WinGet","license_or_tos":"GPL-2.0-or-later","resources":null,"verified":false}