{"appId":"winget_app_Logtalk.Logtalk","appShortcutName":"Winget Application","appDisplayName":"Logtalk","authorId":"winget","releaseTagName":"winget-3.85.0","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Declarative object-oriented logic programming language\n\nLogtalk is a declarative object-oriented logic programming language that extends and leverages the Prolog language with modern code encapsulation and code reuse mechanisms while also providing improved predicate semantics.\nLogtalk compiler and runtime\n- CHANGED: The logtalk_load_context/2 built-in predicate to type-check the key argument.\n- CHANGED: Attempting to define an entity/predicate alias equal to the original entity/predicate is now a compilation error instead of simply a warning.\n- CHANGED: Reclassified the underscore_variables flag as a backend flag instead of a linter flag.\n- ADDED: New meta-flag, linter, to manage the values of all the linter flags as a group.\n- ADDED: New linter flag, encodings, to control source file text encoding warnings.\n- ADDED: New linter flag, general, for warnings that are not controlled by a specific flag.\n- IMPROVED: Print a linter warning on redundant entity qualification in predicate directives.\n- IMPROVED: Detect and report as compilation errors use_module/1-2 and uses/1-2 directives when compiling a protocol.\n- IMPROVED: Report as compilation errors instead of compilation warnings use_module/1-2 directives when not compiling a module as an object while using a backend that doesn't support modules.\n- IMPROVED: Report as compilation errors export/1 and reexport/2 directives when not compiling a module as an object.\n- FIXED: The compiler to prevent trying to compile a Prolog use_module/1 directive as a Logtalk directive when compiling a module as an object.\n- FIXED: Detection of a file trying to recursively load itself to not throw a permission error when reloading a file that previously failed to load.\n- FIXED: Misleading error when compiling dynamic/1, discontiguous/1, and multifile/1 directives with arguments with redundant entity qualification.\nProlog adapter and integration files\n- UPDATED: Trealla Prolog adapter file to require version 2.59.21 or later.\nDocumentation\n- IMPROVED: Documentation of the issue_creator tool.\n- IMPROVED: The Handbook documentation on performance, adding a section on circular references.\n- IMPROVED: The Handbook documentation on the logtalk_make/0-1 built-in predicates.\n- UPDATED: The Handbook documentation on the underscore_variables flag.\nLibrary\n- ADDED: Additional test for the java library checking setting an array element to the empty list atom.\n- UPDATED: The meta_compiler library to support optimization of meta-calls with closure meta-arguments that are messages to parametric objects.\nTools\n- ADDED: Support to the diagrams tool for VSCode, VSCodium, Cursor, Zed, BBEdit, MacVim, and TextMate local file links.\n- UPDATED: Rewrite error and warning messages from the packs tool so that they can be explained by the tutor tool.\n- UPDATED: The tutor tool to explain the new redundant entity qualifier linter warning.\n- FIXED: Case where the packs tool would print repeated \"Pack dependency not available\" error messages when trying to install or update a pack with alternative dependencies where none is available.\n- FIXED: The debugger tool description of the p (print) port command.\n- FIXED: Typos in the mode/2 directives for the debuggerp protocol logging/3 and nolog/3 public predicates.\n- FIXED: Typo in the info/2 directive for the tutor object explain//1 public non-terminal.\n- FIXED: Harmless linter warning when loading the debugger tool with some backends.\nExamples\n- IMPROVED: The searching example representation of some of the problems.\n- UPDATED: The errors example for the new redundant entity qualifier linter warning.\n- FIXED: Portability issue in the errors example tests.\n- FIXED: Cannot run the module_aliases example with XSB and Tau Prolog.\n- FIXED: The symbiosis example for Trealla Prolog removing its apply module.\nTests\n- CHANGED: Tests for the Prolog standard initialization/1 directive to not depend on support for the ensure_loaded/1 directive.\n- ADDED: Additional tests for the user built-in entity.\n- ADDED: Tests for the Logtalk consistency_error/3 built-in method.\n- ADDED: Additional tests for the Prolog standard bagof/3 and setof/3 built-in predicates.\n- ADDED: Tests for the Prolog standard write_term/2-3 built-in predicates support for the portrayed/1 option implemented by most systems.\n- ADDED: Tests for the Prolog de facto standard print/1-2 built-in predicates and the portray/1 user-defined hook predicate.\n- ADDED: Additional tests for the de facto Prolog standard format/2-3 predicates (~p control sequence).\n- IMPROVED: Tests for the de facto standard Prolog built-in predicates that take a clause reference argument.\n- FIXED: Compilation errors when running the always_true_or_false_goals and deprecated linter flag tests with XSB.\n- FIXED: Missing condition in test for Unicode UTB-8 (no BOM) encoding.\n- FIXED: Portability issue when running the tests for the Prolog standard call/1 control construct and call/N built-in predicates with JIProlog.\nInstallers and installation scripts\n- UPDATED: The Trealla Prolog embedding scripts to create a loader.pl file when the application loader option is provided.\n- UPDATED: The CxProlog, ECLiPSe, Trealla Prolog, and XVM embedding scripts to accept an optional startup application goal argument.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"3.85.0","site":"https://logtalk.org/","source":"Logtalk.org","license_or_tos":"Apache-2.0","resources":null,"verified":false}