{"appId":"winget_app_PostgreSQL.pgAdmin","appShortcutName":"Winget Application","appDisplayName":"pgAdmin 4","authorId":"winget","releaseTagName":"winget-8.13","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://ftp.postgresql.org/pub/pgadmin/pgadmin4/v8.13/windows/pgadmin4-8.13-x64.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Open Source administration and development platform for PostgreSQL\n\npgAdmin is designed to answer the needs of all users, from writing simple SQL queries to developing complex databases.\nThe graphical interface supports all PostgreSQL features and makes administration easy.\nThe application also includes a syntax highlighting SQL editor, a server-side code editor, an SQL/batch/shell job scheduling agent, support for the Slony-I replication engine and much more.\nServer connection may be made using TCP/IP or Unix Domain Sockets (on *nix platforms), and may be SSL encrypted for security.\nNo additional drivers are required to communicate with the database server.\nThe pgAdmin Development Team is pleased to announce pgAdmin 4 version 8.13. This release of pgAdmin 4 includes 25 bug fixes and new features. For more details please see the release notes.\nNotable changes in this release include:\nFeatures:\n- Replace infinite scrolling with pagination in query tool data output for better UX and performance.\n- Add an object menu option to disconnect all server and database connections.\n- Alternate the background color of rows to enhance readability.\n- Allow to pass PGADMIN_CONFIG_CONFIG_DATABASE_URI from docker secrets.\n- Format dashboard graph metrics for better readability.\n- Added support for auto-detecting and setting the End-of-line character (LF/CRLF) in the query tool editor.\n- Make the background color for the serial number and header cells distinct.\nBugs/Housekeeping:\n- Updated the react-menu library from v2 to v4.\n  - Fixed an issue that allowed the Enter key to save data in the result grid text editor.\n    - Move 'About pgAdmin 4' to the app menu on macOS.\n    - Fixed an issue where the query tool was crashing when an empty geometry was being rendered.\n    - Fixed an issue where the Dashboard tab showed 'Something went wrong'.\n    - Fixed an issue where cursor selection is not visible in the PSQL tool.\n    - Allow OAuth2 params OAUTH2_NAME, OAUTH2_DISPLAY_NAME, OAUTH2_ICON, OAUTH2_BUTTON_COLOR to be optional.\n    - Add appropriate minimum width and height settings for desktop apps to avoid apps accidentally going below visibility levels.\n    - Fixed an issue where the graphical explain kept the node details open even after the plan changed.\n    - Fixed an issue in the debugger where the character data type function arguments were being truncated.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"8.13","site":"https://www.pgadmin.org/","source":"The pgAdmin Development Team","license_or_tos":"PostgreSQL","resources":null,"verified":false}