{"appId":"winget_app_Gramps.Gramps","appShortcutName":"Winget Application","appDisplayName":"GrampsAIO","authorId":"winget","releaseTagName":"winget-5.2.3","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/gramps-project/gramps/releases/download/v5.2.3/GrampsAIO-5.2.3-2_win64.exe"}},"install":{"win32":{"assetId":1,"exec":null,"installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Research, organize and share your family tree with Gramps.\n\nGramps is a free software project and community.\nWe strive to produce a genealogy program that is both intuitive for hobbyists and feature-complete for professional genealogists.\nIt is a community project, created, developed and governed by genealogists.\nChanges since v5.2.2:\n\n- Updated translations: da, de_AT, en_GB, es, fr, he, hr, hu, mk, nb, nl, pt_PT, ru, tr, zh_HK, zh_TW.\n- Fix bug with regular expressions in check_po script.\n- Update translation template for new release.\n- Corrected terminology. Replaced \"matronymic\" with \"matrilineal\" to accurately reflect genetic inheritance rather than naming conventions.\n- Clarified terminology for father lineage description. Changed \"patronymic lineage\" to \"patrilineal lineage\" for accuracy.\n- Fix PDF generation failure with LaTeX-based reports on Windows. Fixes #10696.\n- Fix fallback for the image_size utility function Use Gdk if the size of the image cannot be determined by imagesize. Fixes #13310.\n- Disable rounding glyph positions in cairo document generator.\n- Package Gramps 5.2.3 for macOS.\n- Fix NoteType values in CSV import.\n- Some short french month names can not be entered. Fixes #13307.\n- Remove detached process flag when running lualatex.\n- Check that pdf output file exists in genealogy tree reports. Fixes #10696.\n- Fix error when changing the style of misspelt words. In the note editor, changing the style of text failing the spell check caused an error. Fixes #13282.\n- Update span characters for zh_TW. Add span characters so that the new display format is accepted as a valid input format.\n- Restore BerkelyDB, Gramps still uses it.\n- Update gramps.modules:\n  - Remove obsolete comment and comment out the private include.\n  - Update the branch in gramps-git.\n  - Remove BerkeleyDB and pybsddb dependencies.\n  - Remove unused patches.\n- Fix missing media in narrative web report person pages. Fixes #13252, #13272.\n- Remove the spaces padding the connector in a hyphenated surname. This fixes the previous code which replaced \" - \" with \"-\" within the entire name. Fixes #13274.\n- Url-quote norm_path and use urljoin to attach the scheme. Assumes that if the path is already a URI it is also already quoted. Fixes #13218, #13197.\n- Prevent hyperlink tagging being added as an undo action. Clicking the undo button in the note editor sometimes had no noticeable effect. Fixes #13267.\n- Change repository \"Title\" to \"Name\" in the source editor. Fixes #13258.\n- Better error handling in the narrative web report.\n- Handle not found when creating the narrative web report updates page. Fixes #13216.\n- Add workflow for Debian build.\n- Package Gramps 5.2.2 for macOS.\n- Use README.md for PyPI long description.\n- Fix Windows AIO build.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"5.2.3","site":"https://gramps-project.org/","source":"WinGet","license_or_tos":"GPL-2.0","app_page":"https://gramps-project.org/","resources":null}