{"appId":"winget_app_joncampbell123.DOSBox_X","appShortcutName":"Winget Application","appDisplayName":"DOSBox-X","authorId":"winget","releaseTagName":"winget-2023.10.06","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/joncampbell123/dosbox-x/releases/download/dosbox-x-v2023.10.06/dosbox-x-windows-2023.10.06-setup.exe"}},"install":{"win32":{"assetId":1,"exec":null,"installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"DOSBox-X is an open-source DOS emulator for running DOS games and applications.\n\nDOSBox-X emulates a PC necessary for running many DOS games and applications that simply cannot be run on modern PCs and operating systems, similar to DOSBox.\nHowever, while the main focus of DOSBox is for running DOS games, DOSBox-X goes much further than this.\nStarted as a fork of the DOSBox project, it retains compatibility with the wide base of DOS games and DOS gaming DOSBox was designed for.\nBut it is also a platform for running DOS applications, including emulating the environments to run Windows 3.x, 9x and ME and software written for those versions of Windows.\nBy adding official support for Windows 95, 98, ME emulation and acceleration, we hope that those old Windows games and applications could be enjoyed or used once more.\nMoreover, DOSBox-X adds support for DOS/V and NEC PC-98 emulations so that you can play DOS/V and PC-98 games with it.\n- Add \"VRD\" debugger command to force redraw of the VGA screen.\n- Add VGA debug set commands to force a video start address and another\n- Add \"PITSYNC\" option to VFRCRATE command. \"VFRCRATE PITSYNC ON\"\n- IMGMAKE: Fix bug where if -bat was specified, the generated .bat\n- IMGMAKE: If -nofs and -bat was specified, the generated .bat file\n- DOS FAT driver: When the guest sends in a new BIOS Parameter Block,\n- DOS FAT driver: If the partition is unformatted and looks as if\n- DOS FAT driver: Add options -o sectoff and -o sectlen to make it\n- IMGMOUNT: Allow *: as a drive letter to mean automatically pick a\n- Fix debugger to use toupper(), but only for ASCII range ncurses\n- Timer PIT: If the guest writes the counter value while the counter\n- Fix restoring minimized window on TTF output (Issue #4248) (maron2000)\n- Fix macos crash on launch when output=surface or auto (SDL2) (maron2000)\n- Update in-tree SDL2 library to ver 2.28.2 (maron2000)\n- Updated build tool for MinGW lowend builds required for the updated SDL2\n- Debugger RUN and RUNWATCH commands were broken, fix.\n  Make sure debugger\n- Fix SETCOLORS command didn't change color when output=ttf.(Issue #4503)\n- BIOS CMOS date/time functions will now idle the CPU 4 times after reading\n- Fix segfault when mounting hard disk images with no file extension","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"2023.10.06","site":"https://dosbox-x.com","source":"joncampbell123 [DOSBox-X Team]","license_or_tos":"GNU General Public License v2.0","resources":null,"verified":false}