{"appId":"winget_app_stevencohn.OneMore","appShortcutName":"Winget Application","appDisplayName":"OneMoreAddIn","authorId":"winget","releaseTagName":"winget-5.9.0","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/stevencohn/OneMore/releases/download/5.9.0/OneMore_5.9.0_Setupx64.msi"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A OneNote add-in with simple, yet powerful and useful features\n\n\nFeature Updates\n- Added a command, Compress Images, to minimize the stored size of selected images on the page, #1081\n- Added a keyboard mapping, Ctrl+Shift+0, to clear the background highlighting of selected text, #1090\n- Added a keyboard mapping, Ctrl+Shift+J, to reuse the most recently used color in the Rotating Highlighter, #1091\n- Added a section character prefix to sections titles in the Table of Contents, #1100\n- Fixed an issue where the installer would fail when attempting to download WebView2 while offline, #941\n- Fixed a typo on the Resize dialog and remember image settings, #1060\n- Fixed an issue where File Quick Notes did nothing when using a custom quick notes section, #1064\n- Fixed an issue in the Settings dialog when deleting the last Favorite, causing an exception, #1067\n- Fixed an issue where Copy Link to Page displayed an exception when there were clipboard conflicts due to running other tools such as Delphi Clipboard Viewer, #1071\n- Fixed an issue where the default text color was not properly set when Colorizing over a dark mode background, #1083\n- Fixed an issue where Search failed when the query string contained word-break symbols.\n  This confused the underlying Windows Search engine. #1088\n- Fixed an issue where Export Page failed when there were path delimiters in the page title.\n  Also changes the default option to always strip these characters from the page title and now, optionally, to replace spaces with underscores. #1107\nInternal Updates\n- Accepted PR #1049 to improve German translations\n- Accepted PR #1080 to improve Chinese translations\n- Added a progress dialog to Insert TOC command when scanning more than 25 pages\n- Fixed an issue with Insert TOC snippet that caused an exception when OCR text contained HTML or XML text\n- Fixed an issue with Remove Duplicates that caused an exception when OCR text contained HTML or XML text","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"5.9.0","site":"https://stevencohn.net","source":"River","license_or_tos":"MPL-2.0","resources":null,"verified":false}