{"appId":"winget_app_ThioJoe.FullStackAIMemeGenerator","appShortcutName":"Winget Application","appDisplayName":"Full Stack AI Meme Generator","authorId":"winget","releaseTagName":"winget-1.0.4","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/microsoft/winget-pkgs/releases/download/winget-1.0.4/"},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/microsoft/winget-pkgs/releases/download/winget-1.0.4/"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Allows you to automatically generate meme images from start to finish using AI. It will generate the text for the meme (optionally based on a user-provided concept), create a related image, and combine the two into a final image file.\n\n\n🟢 1.0.2 → 1.0.4 -- Fixes and Improvements:\n- Default model is now gpt-3.5-turbo because everyone has access to it, unlike GPT-4 which has additional requirements\n- After completion, now asks for user confirmation before closing the window, and displays output path\n- Now explains \"The model gpt-4 does not exist\" error returned by OpenAI if the user does not have access to GPT-4\n- Add general error handling.\n  Also will allow users to actually see the error message because it won't immediately close the window.\n- The noUserInput command line argument should now be respected even during error messages.\n  Only exception is the first-time run when it creates the api and settings files.\n- Removed unnecessary 'you have the latest version' message\n- Fixed crash when certain Unicode characters were in the config file\n1.0.1 → 1.0.2:\n- Fixed incorrect passing of variables and API key validation because of leftover global variables, which caused issues when using Stability AI as image platform (#5)\n- Added clarification about OpenAI option using DALLE2 in settings file","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"1.0.4","site":"https://github.com/ThioJoe","source":"WinGet","license_or_tos":"GPL-3.0","app_page":"https://github.com/ThioJoe/Full-Stack-AI-Meme-Generator","resources":null}