{"appId":"winget_app_Alex313031.Thorium","appShortcutName":"Winget Application","appDisplayName":"Thorium","authorId":"winget","releaseTagName":"winget-128.0.6613.189","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/Alex313031/Thorium-Win/releases/download/M128.0.6613.189/thorium_SSE3_mini_installer.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Chromium fork for Linux, Windows, macOS, Android, and Raspberry Pi named after radioactive element No. 90.\n\n\nM128 Thorium 2024 UI \"Th24\" is complete. Please see the past 3 beta releases if you aren't up to speed about it. On top of those, we now:\n- Have the restored bookmarks folder icon used in the bookmarks ui and bookmarks bar\n- Fixed spacing of the new tab button\n- Added 180px as an option to the new custom-tab-width chrome flag\n- Tab separators are 2px again after I had temporarily reverted back to 1px\n- More WebUI stuff is reverted to its pre-Chrome 2023 appearance.\n- I am writing a full write-up/explainer on what Cr23 is, what Th24 is, and why I made it. It will have pictures to illustrate as well. It isn't finished yet but you can find it Here.\n\nNow, other stuff:\n- New flag chrome://flags#classic-omnibox \"classic omnibox\". When enabled, the omnibox (i.e. url bar) takes on a more squareish shape similar to classic versions of Chromium/Chrome. It was adapted from the same flag in Supermium, but I adjusted the radius, and I fixed an issue with stuff not showing up quite right when the omnibox is focused, i.e. when the results are all showing up. Might make a pull request upstream.\n- The Thorium 2024 flag was added to \"Chrome Labs\" to make it easier to enable than going to chrome://flags. Just click the \"beaker\" icon (actually an Erlenmeyer flask lol) in the top bar, and you can enable it there.\n- New flag chrome://flags/#remove-tabsearch-button to remove the tab search button from the tab strip.\n- The bug on Linux where me setting it to the classic theme by default was causing crashes is now fixed.\n- I finally added some background music to the Chrome Dino game. You can hear it on chrome://dino\n- Added a new WebUI page chrome://eggs that has images from the easter egg contest on it.\n- I enabled the Customize Toolbar feature ahead of schedule (the official stable enabled by default release was in M129). This lets you add a bunch of stuff to the toolbar.\n- The size of the main menu button (aka the \"hamburger menu\" or \"three dots menu\") has been corrected to be smaller\n- Better compiler tuning on MacOS\n- \"About Thorium\" item in the main menu is now in a better place and doesn't have a blue \"i\" icon on it anymore.\n- New flag chrome://flags#transparent-tabs, which makes tabs semi-transparent (Windows only)\n- Limits of MV3 were removed. A MV3 extension like UBlock Origin Lite, if it were coded to take advantage of Thorium, now has limits on declarativeNetRequest that are similar to MV2. Thorium still intends to restore MV2 code when the time comes, but I thought this would be an interesting experiment. I might try to fork Ublock, so if you're interested in this, watch my GitHub account for a new repo.\nIncludes a build of Thorium UI Debug Shell (AVX only) TODO: Fix alignment of tab search button, fix FTP link clicking.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"128.0.6613.189","site":"https://thorium.rocks/","source":"WinGet","license_or_tos":"BSD-3-Clause","resources":null,"verified":false}