{"appId":"winget_app_RoyQu.RedPanda_C++","appShortcutName":"Winget Application","appDisplayName":"Red Panda C++","authorId":"winget","releaseTagName":"winget-3.2","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A powerful, lighweight and cross-platform C/C++ IDE\n\n\n- change: The way to calcuate astyle path.\n- fix: Scroll bar arrow size not correct in the dark themes.\n- fix: Don't auto scroll to the caret after undo/redo.\n- fix: \"bits/stdc++\" is not openned in readonly mode.\n- fix: astyle path error when reformat.\n- fix: Slow when paste/replace bulk contents.\n- fix: Crash in windows 7. (by CyanoHao)\n- fix: While Control is pressed, can't start Drag&Drop by mouse.\n- enhancement: Auto detect gdb ACP (by CyanoHao)\n- fix: When debugging project, the executing source file is not auto switched to. （#476）\n- enhancement: Support Raw string literal with LR/UR/uR/u8R prefix.\n- change: Copy/Export as html using less restrictive header.\n- enhancement: Better gcc info detection (by CyanoHao)\n- enhancement: Copy/Export as html with line numbers.\n- enhancement: Ctrl+Drag/Drop to copy contents.\n- enhancement: Don't display big input data file for problem cases.\n- fix: Can't switch to RedPanda-Cpp by clicking on the application title bar when the options dialog is open.\n- fix: Drag&Drop folder to IDE should be prohibited.\n- fix: After dragging IDE to another screen that don't have the same DPI with the previous one, icon size are not correct.\n- enhancement: Add copy compiler set tools button in the options dialog / compiler set panel.\n- fix: Functions in seperate editing files all displayed in the function prototype list.\n- enhancement: When debugging and the current stop position is not in source files, auto focus to the stack trace panel.\n- enhancement: Adjust margin of the Search/Replace Dialog.\n- enhancement: When Search/Replace invoked, auto focus the find inputbox.\n- fix: Problem case limit settings not correctly loaded.\n- fix: Edit and switch editor out quickly may leave function tip wrongly appeared.\n- fix: The function parameters' order in the generated doxygen doclet is wrong.\n- enhancement: If current compiler set's compiler / debugger / make path is wrong, show a warning message box.\n- enhancement: Display a cross before compiler set that has errors in compiler / debugger / make path.\n- enhancement: Display a warning message if no compiler set is found at the first time RedPanda C++ runs.\n- fix: Can't find the single word if the caret is inside it.\n- fix: Search Dialog always returns to center each time starting a search.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"3.2","site":"https://github.com/royqh1979","source":"Roy Qu (royqh1979@gmail.com)","license_or_tos":"GPL-3.0","resources":null,"verified":false}