{"appId":"winget_app_GDevelop.GDevelop","appShortcutName":"Winget Application","appDisplayName":"GDevelop","authorId":"winget","releaseTagName":"winget-5.4.218","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/4ian/GDevelop/releases/download/v5.4.218/GDevelop-5-Setup-5.4.218.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"The fastest, easiest, most powerful no-code game engine.\n\nGDevelop is a free, open-source game engine that's 10x easier and faster to use than anything else. Build from anywhere — even on your phone. Publish everywhere: iOS, Android, Steam, web, gaming platforms. Reach millions of players or create the next hit game you've been dreaming of.\n📈 Improved game dashboard\n\nThe game dashboards have been redesigned to provide a comprehensive view of all key aspects of your game in one convenient location, including analytics, player feedback, leaderboards, multiplayer configurations, and exports.\n📣 New \"Boost\" (one-click marketing): get thousands of players in a few days\nFrom your game dashboard, you can access new \"Boost\" packages available for purchase to enhance your game's visibility. These packages include up to 5000 guaranteed players who will try out your game in a few days or even hours. It's a perfect opportunity to attract more attention and gather insights on player retention.\n💝 Improvements\n- Various UI improvements:\n  - Improved login & signup dialogs design\n  - Community & Play tabs in the homepage have been merged.\n  - Improve landscape mode and responsiveness of the UI on small screens\n  - Prevent opening variables dialog for objects & groups if there is no object\n  - Improve object collision masks & points dialog button label\n  - Show object effect drop-down list for parameters in extension editor\n  - Add a button at the top of the object list to add new objects.\n  - Allow uploading thumbnails for games directly from the Game Dashboard.\n- Add sort field (creation date, weekly sessions, all time sessions) for the list of games in the Manage tab\n- Add a button to ask any question in the Learn page\n- Google Drive support on the web-app is now deprecated. Please use Cloud projects instead, which are better integrated and fully support all GDevelop features.\n- Add automated game screenshots when remixing a game.\n🐛 Bug fixes\n- Fix a memory leak on object instances in the Physics Engine.\n- Fix Dialogue Tree returning sometimes a string instead of a number in expressions reading variables\n- Fix login dialog stuck in loading after trying to use a provider\n- Fix destroying an object even if flagged as \"DoNothing\" in the multiplayer behavior\n- Fix dialogue tree crashing the game when syntax errors are present\n- Fix leaderboards not properly replaced in projects using them in custom objects\n- Fix game thumbnail taking too much space on mobile in Quick Customization dialog\n- Fix centering of \"UI layers\" after a screen orientation change\n  - This happened often on mobile (iOS notably) and sometimes when resizing the window on desktop too.\n- Fix 3D model sizes in the editor when aspect ratio is free\n- Fix issues when reworking a \"quick customization\" project (don't duplicate the project multiple times if already saved).\n- Fix adding an object from context menu when the Objects panel is closed\n- Fix instances paste from a scene to another\n- Custom object editor fixes:\n  - Fix instance variable editor opening in CustomObject editor\n  - Fix tilemap painting in CustomObject editor\n- Fix a crash at runtime when an animatable custom object has no animation\n- Fix object thumbnails in custom objects event functions\n- Fix sprite scaling factor when a custom size is set\n⚙️ Extensions\n- [Community] [Hedgehog platformer] A new platformer engine for Sonic-like games (thanks @Kennoir!)\n- [Rectangular flood fill] Include the features from \"Create multiple copies of objects\" extension\n- [Rectangular flood fill] Pick the created objects\n- [Community] [TweenZOrder] The extension was removed - a variable tween can be used instead.\n- [3D sprite] Fix a crash when sprites have no frame.\n- Updated to the new syntax for properties and parameters in reviewed extensions.\n🎨 Assets\n- Add a new premium audio pack: Horror SFX Halloween sounds pack (by GDevelop)\n- Add 70+ Tilemaps in ELV's packs\n- Add a new premium audio pack: Magic RPG Sounds SFX (by GDevelop)\n🕹 Examples\n- Add screen orientation checker and improve title screen centering for 3D Car Coin Hunt\n- Use custom objects in some examples:\n  - [Lane runner, Car coin hunt, Tappy plane, Run dino run] Use a custom object for the leaderboard dialog\n  - [Platformer] Use a custom object for the game over dialog\n  - [Top-down RPG] Use a custom object for the character dialog\n  - [3D city builder] Use a custom object for the tool bar\n- [360° platformer] A Sonic-like demo that uses a tile-map\n🕹 Premium Game Templates\n- New premium game template: Idle Clicker (by @VegeTato)\n🛠 Internal changes (for developers)\n- Add mention to Three.js in README (Thanks @MTSyntho!)\n- Add \"dispose\" method to RuntimeGame and various classes (Thanks @danvervlad!)\n  - This allows to fully release resources, textures and anything else that is linked to a gdjs.RuntimeGame. This can be useful if multiple games must be loaded/unloaded/changed in a single web page.\n- Only add watermark styles in case showWatermark is true (Thanks @dmyamster!)\n  - This avoids using a DOM API if not needed.\n- Add gdcore-tools hook (Thanks @arthuro555!)","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"5.4.218","site":"http://www.florianrival.com/","source":"GDevelop Team","license_or_tos":"MIT","resources":null,"verified":false}