{"appId":"winget_app_BleachBit.BleachBit","appShortcutName":"Winget Application","appDisplayName":"BleachBit","authorId":"winget","releaseTagName":"winget-4.6.2.2665","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Clean Your System and Free Disk Space\n\nWhen your computer is getting full, BleachBit quickly frees disk space. When your information is only your business, BleachBit guards your privacy. With BleachBit you can free cache, delete cookies, clear Internet history, shred temporary files, delete logs, and discard junk you didn't know was there. Designed for Linux and Windows systems, it wipes clean thousands of applications including Firefox, Adobe Flash, Google Chrome, Opera, and more. Beyond simply deleting files, BleachBit includes advanced features such as shredding files to prevent recovery, wiping free disk space to hide traces of files deleted by other applications, and vacuuming Firefox to make it faster. Better than free, BleachBit is open source.\nChanges\nThese are the changes since version 4.6.0:\n- Clean more cookies, cache, and sessions in Google Chrome.\n- Fix ValueError: Unexpected UTF-8 BOM (decode using utf-8-sig) when cleaning JSON files in Google Chrome\nLinux\n- Add packages for Ubuntu 24.04, Fedora 39 and 40, and openSUSE Slowroll.\n- Fix detection of Wayland.\n- Fix error SyntaxWarning: invalid escape sequence with Python 3.12.\n- Fix missing developer name in metainfo.xml file.\nWindows\n- There was a major update to the Winapp2.ini file on August 29, which includes many updates for various cleaners. When enabled in the preferences, it is available OTA also for older releases of BleachBit.\n- Restore the missing DLL to fix the regression causing the error \"Code execution cannot proceed because msvcr100.dll was not found\" that affected many users.\n- Renew the digital code-signing certificate and switch certificate authority. The publisher will now show as Open Source Developer, Andrew Ziem\n\n  .\n- Fix the excessively long application name in Task Manager and when the application was not responding\n- Fix errors like [WinError 3] The system cannot find the path specified: '\\\\?\\C:\\WINDOWS\\Sysnative\\config\\systemprofile\\AppData\\Local\\Microsoft\\Windows\\INetCache\\Content.IE5': Command to delete\n- Hide a Linux-specific option in the preferences.\nDevelopers\n- List of commits\n- List of closed issues\n- There were major improvements to the distribution system for Winapp2.ini, so there will be more timely Winapp2.ini updates.\n\nLooking ahead\nWe have made progress on the next-generation graphical interface with improvements focusing on the file results list. Expect these improvements in BleachBit version 5.0.\n\nUpgrade now","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"4.6.2.2665","site":"https://www.bleachbit.org/","source":"WinGet","license_or_tos":"GPL-3.0","resources":null,"verified":false}