{"appId":"winget_app_restic.restic","appShortcutName":"Winget Application","appDisplayName":"restic","authorId":"winget","releaseTagName":"winget-0.17.3","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Fast, secure, efficient backup program\n\nrestic is a backup program that is fast, efficient and secure. It supports the three major operating\nsystems (Linux, macOS, Windows) and a few smaller ones (FreeBSD, OpenBSD).\nChangelog for restic 0.17.3 (2024-11-08)\nThe following sections list the changes in restic 0.17.3 relevant to restic users. The changes are ordered by importance.Summary\n- Fix #4971: Fix unusable mount on macOS Sonoma\n- Fix #5003: Fix metadata errors during backup of removable disks on Windows\n- Fix #5101: Do not retry load/list operation if SFTP connection is broken\n- Fix #5107: Fix metadata error on Windows for backups using VSS\n- Enh #5096: Allow prune --dry-run without lock\nDetails\n- Bugfix #4971: Fix unusable mount on macOS SonomaOn macOS Sonoma when using FUSE-T, it was not possible to access files in a mounted repository. This issue is now resolved.#4971 #5048\n- Bugfix #5003: Fix metadata errors during backup of removable disks on WindowsSince restic 0.17.0, backing up removable disks on Windows could report errors with retrieving metadata like shown below.\nerror: incomplete metadata for d:\\filename: get named security info failed with: Access is denied.\n\nThis has now been fixed.#5003 #5123 https://forum.restic.net/t/backing-up-a-folder-from-a-veracrypt-volume-brings-up-errors-since-restic-v17-0/8444\n- Bugfix #5101: Do not retry load/list operation if SFTP connection is brokenWhen using restic with the SFTP backend, backend operations that load a file or list files were retried even if the SFTP connection was broken. This has now been fixed.#5101 https://forum.restic.net/t/restic-hanging-on-backup/8559\n- Bugfix #5107: Fix metadata error on Windows for backups using VSSSince restic 0.17.2, when creating a backup on Windows using --use-fs-snapshot, restic would report an error like the following:\nerror: incomplete metadata for C:\\: get EA failed while opening file handle for path \\\\?\\GLOBALROOT\\Device\\HarddiskVolumeShadowCopyXX\\, with: The process cannot access the file because it is being used by another process.\n\nThis has now been fixed by correctly handling paths that refer to volume shadow copy snapshots.#5107 #5110 #5112\n- Enhancement #5096: Allow prune --dry-run without lockThe prune --dry-run --no-lock now allows performing a dry-run without locking the repository. Note that if the repository is modified concurrently, prune may return inaccurate statistics or errors.#5096","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"0.17.3","site":"https://github.com/restic","source":"restic","license_or_tos":"BSD-2-Clause","resources":null,"verified":false}