{"appId":"winget_app_Sandakan.Nora","appShortcutName":"Winget Application","appDisplayName":"Nora","authorId":"winget","releaseTagName":"winget-3.0.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/Sandakan/Nora/releases/download/v3.0.0-stable/Nora.Setup.3.0.0-stable-win-x64.exe"}},"install":{"win32":{"assetId":1,"exec":null,"installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"An elegant music player built using Electron and React. Inspired by Oto Music for Android by Piyush Mamidwar.\n\nAn elegant music player built using Electron and React. Inspired by Oto Music for Android by Piyush Mamidwar.\nWith simplicity and design in mind, this app was made to overcome problems when using default music apps on platforms that lack essential features.\nIt packs a horizon of features including,\n- Organize your songs, artists, albums, and playlists with ease.\n- Create playlists that meet your needs.\n- Sing along with song lyrics.\n- Support for synced lyrics.\n- Keep your favorite songs and artists close to you.\n- Read your favorite artist's biography.\n- Personalized music shuffling.(Upcoming)\n- Change between Light and Dark themes with ease.\n- A mini-player to help focus on what matters at the moment.\n- Edit the metadata of your songs easily and conveniently.\n- Search through your library with the help of song filters.\n🎉  New Features and Updates\n- Added an experimental full-screen player mode. Fixes #222.\n- Added support for translating lyrics. Fixes #239.\n- Added support for dynamic themes based on the currently playing song.\n- Added experimental support auto-updating Nora.\n- Added support for navigation between prompts for supported prompts.\n- Greatly reduced unnecessary re-renders in turn improving overall performance.\n- Added a feature to prevent the display from going to sleep in situations with no user activity like displaying lyrics.\n- Moved notifications to the bottom right corner of the window.\n- Added support for Discord Rich Presence.\n- Added a progress bar to the bottom of the full-screen player.\n- Added keyboard shortcuts to control prompt menu back/forward navigation buttons.\n- Added Turkish translations. Thanks @mikropsoft.\n- Added support for filtering songs and artists in selected pages.\n🔨 Fixes and Improvements\n- Greatly improved palette generation duration. (90% faster)\n- Fixed some localization bugs in Nora.\n- Fixed a bug where Nora doesn't send albumArtist data when scrobbling songs.\n- Improved performance when sending scrobbling and now playing data to Last.fm.\n- Fixed a bug where albums related to artists are not shown.\n- Fixed a bug where special characters are not shown when localizing text in Nora.\n- Fixed a bug where metadata updates of songs outside the library fail.\n- Improved animations when displaying lyrics.\n- Fixed a bug where the auto-scrolling button in LyricsPage doesn't have a tooltip label.\n- Fixed a bug where the close button shows an incorrect tooltip label.\n- Updated English translations. Thanks @JustCallMeQuincy.\n- Added a CODE_OF_CONDUCT file to the repository.\n- Fixed a bug where buttons and dropdowns don't have enough contrast to read text when a background image is displayed.\n- ListeningActivityBarGraph now shows ListeningActivityBars according to the available width.\n- Added a possible fix to a missing dependency for Nora when launching in Linux-based operating systems.\n- Improved animations in notifications.\n- Fixed a bug where the app window would be hidden if the monitor it was in got disconnected.\n- Fixed a bug where app storage metrics show incorrect metrics when the app is installed in other than the C: drive.\n- Improved import playlist performance.\n- Fixed a bug where importing the Favorites playlist will make the app unresponsive due to many like/dislike notifications.\n- Fixed a bug where Nora will forget about sub-folders inside parent folders.\n- Improved app performance when displaying synced lyrics.\n- Fixed a bug where lyrics copyright info is positioned incorrectly in the full-screen player.\n- Fixed a bug where Nora doesn't check for LRC files in the custom LRC file path.\n- Fixed a bug where lyrics with the same timestamps don't appear correctly.\n- Fixed a bug where users can't change pages through the sidebar when the app language is changed to other than English.\n- Fixed showing the musixmatch disclaimer twice in the disclaimer dialog.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"3.0.0","site":"https://github.com/Sandakan","source":"WinGet","license_or_tos":"MIT License","resources":null,"verified":false}