{"appId":"winget_app_Tinn_R.Tinn_R","appShortcutName":"Winget Application","appDisplayName":"Tinn-R","authorId":"winget","releaseTagName":"winget-9.0.3.1","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A modern editor/word processor, perfect for R statistical language.\n\nThe Tinn-R is an editor/word processor ASCII/UNICODE generic for the Windows operating system, very well integrated into the R, with characteristics of Graphical User Interface (GUI) and Integrated Development Environment (IDE). It is a project registered under the General Public License GPL, that is, an open source software.\nTinn-R is an academical initiative, initiated and managed by D.Sc. José Cláudio Faria from the Laboratory of Computational Statistics (LEC) belonging to the State University of Santa Cruz (UESC).\nBug(s) fixed\n- An intermittent bug that sometimes prevented the application from closing has been fixed. It was a long search for a definitive solution. We apologize to users for any inconvenience caused.\nNews\n- We decided to remove the function and plotting identifiers from the R language highlighter. The justification is that with an exponential growth observed in the number of available packages over time, we no longer see any sense in coloring (highlighting) only a limited set of them. Performing dynamic coloring as packages are loaded for use in a session is a task that - in addition to being exhausting - can compromise the performance (light and fast) of the application.\n- The project is in an advanced stage of migration to Embarcadero’s new Delphi 11.3 (Alexandria) Community platform.\nInterface\n- Some adjustments have been made to the Tools interface.\nDatabase\n- The Shortcut_app.xml database has been updated and a few default shortcuts have been modified. As in these updates - whenever possible - the program takes full advantage of the user’s previous preferences, there may be some discrepancy between the shortcuts and their documentation.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"9.0.3.1","site":"https://tinn-r.org/en/","source":"Tinn-R Team","license_or_tos":"GPL-3.0","resources":null,"verified":false}