{"appId":"winget_app_Mozilla.Firefox.DeveloperEdition.kk","appShortcutName":"Winget Application","appDisplayName":"Firefox Developer Edition (kk)","authorId":"winget","releaseTagName":"winget-133.0","downloadUrls":{"0":{"installerType":"WindowsInstallerExe","asset":"","url":"https://download-installer.cdn.mozilla.net/pub/devedition/releases/133.0b2/win64-aarch64/kk/Firefox%20Setup%20133.0b2.exe"},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://download-installer.cdn.mozilla.net/pub/devedition/releases/133.0b2/win64/kk/Firefox%20Setup%20133.0b2.exe"}},"install":{"win32":{"assetId":1,"exec":null,"installerArgs":null},"winarm":{"assetId":0,"exec":null,"installerArgs":null},"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Firefox Browser Developer Edition\n\nGet the latest features, fast performance, and the development tools you need to build for the open web using Firefox Browser Developer Edition.\nNew\n- You can now show tabs from other devices in the Tab overview menu.\n- Firefox now supports touchpad hold gestures on Linux. This means that kinetic (momentum) scrolling can now be interrupted by placing two fingers on the touchpad.\n- GPU-accelerated Canvas2D is enabled by default on Windows.\n- Desktop mode browsing is now enabled by default for large devices on Firefox for Android. This can be controlled via a preference under Settings in \"Site settings\" previously named \"Site permissions\".\n- When copying text to the clipboard in Private Browsing mode, Firefox for Android now handles it as sensitive content. The toast notification for the clipboard is masked on Android 13 and higher.\nFixed\n- If we have the server time, we adjust the \"expire\" attribute value by adding the delta between the server and the local times. If the current time is set in the future, we consider valid cookies that are not expired for the server.\n- Fixed an issue that started with macOS Sonoma where the emoji picker would open and immediately close when opened with the Cmd+Ctrl+Space shortcut.\n  Thanks to research by Carlos Duarte do Nascimento (Chester) and :bintoro, and a patch by Carlos Duarte do Nascimento (Chester), we have been able to fix this universally for this shortcut and similar shortcuts going forward.\n- Fixed an issue that started with macOS Sonoma where the emoji picker would also insert the character \"e\" in the selected text field/box when opening the emoji picker using the Fn+e shortcut.\n  We have also fixed this for similar shortcuts using the Fn key.\n- The \"Picture-in-Picture: auto-open on tab switch\" feature from Firefox Labs now behaves more reliably on more sites - auto-opening more videos that you care about, and ignoring ones that you probably don't care about.\nDeveloper\n\nWeb Platform\n- Firefox now supports the keepalive option in the Fetch API. This feature allows developers to make HTTP requests that can continue to run even after the page is unloaded, such as during page navigation or closing.\n- Firefox now supports Permissions API in Worker Context.\n- Firefox now dispatches beforetoggle events just before a dialog opens and toggle events after the dialog closes, matching the behavior of popovers.\n- Methods are now available on UInt8Array to convert to and from Base64 and hexadecimal encodings. This is an implementation of a Stage 3 TC39 proposal, for more details see the proposal text.\n- Added support for image decoding as part of the WebCodecs API. This allows for decoding of images from the main and worker threads.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"133.0","site":"https://www.mozilla.org/","source":"WinGet","license_or_tos":"MPL-2.0","resources":null,"verified":false}