{"appId":"winget_app_ImageMagick.ImageMagick","appShortcutName":"Winget Application","appDisplayName":"ImageMagick Q16-HDRI","authorId":"winget","releaseTagName":"winget-7.1.1.41","downloadUrls":{"0":{"installerType":"WindowsInstallerExe","asset":"","url":"https://imagemagick.org/archive/binaries/ImageMagick-7.1.1-41-Q16-HDRI-arm64-dll.exe"},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://imagemagick.org/archive/binaries/ImageMagick-7.1.1-41-Q16-HDRI-x64-dll.exe"}},"install":{"win32":{"assetId":1,"exec":null,"installerArgs":null},"winarm":{"assetId":0,"exec":null,"installerArgs":null},"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A free, open-source software suite for editing and manipulating digital images\n\nImageMagick® is a free, open-source software suite, used for editing and manipulating digital images. It can be used to create, edit, compose, or convert bitmap images, and supports a wide range of file formats, including JPEG, PNG, GIF, TIFF, and Ultra HDR.\nImageMagick is widely used in industries such as web development, graphic design, and video editing, as well as in scientific research, medical imaging, and astronomy. Its versatile and customizable nature, along with its robust image processing capabilities, make it a popular choice for a wide range of image-related tasks.\nImageMagick includes a command-line interface for executing complex image processing tasks, as well as APIs for integrating its features into software applications. It is written in C and can be used on a variety of operating systems, including Linux, Windows, and macOS.\nMerged\n- revert map changes breaking ABI #7768\n- Fix compiler identification with Clang on Darwin #7773\nCommits\n- beta release b8c3266\n- reference cstdlib e62d04d\n- remove new operator bf5650f\n- There is no need to set the green and blue channel when the numcomps is not 1 in the jp2 coder. 2e40ca1\n- Improved decoding speed of the jp2 decoder by storing some values that won't change per image or row. 59b6dc4\n- to ensure code clarity and correctness 9b44a0f\n- Output test-suite.log when unit tests fail. abc1cf2\n- Correct install for macos. 0559150\n- Added typecast to more places where GetPixelChannels is used. 2df67a8\n- Added typecast to more places where GetPixelChannels is used. b6856ae\n- Corrected refactor mistakes. 92e7605\n- No longer get the extra_samples twice and refactored setting of the alpha and attributes. f5c6fcb\n- using ptrdiff_t is recommended for pointer arithmetic in C c3aa2b6\n- use ptrdiff_t where appropriate 1a68655\n- cosmetic bc674fc\n- use ptrdiff_t 87859fb\n- use ptrdiff_t for pointer offsets acda25d\n- use ptrdiff_t for pointer offsets 4fcb705\n- Fixed calculation of the padding in the tiff decoder. b20a90c\n- Restored setting the grue and blue channel when the number of components is two. 0f6e58c\n- RPM spec files are finicky 72fb534\n- Increased buffer size for heif_has_compatible_brand. bbf3c19\n- Only calculate the padding when there are no meta channels. d9f74c5\n- The extra_samples should not be subtracted from the samples_per_pixel when calculating the padding in the tiff coder. d7d4902\n- release 0ba42ae\n- release bbdcbf7","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"7.1.1.41","site":"https://imagemagick.org/","source":"ImageMagick Studio LLC","license_or_tos":"ImageMagick","resources":null,"verified":false}