{"appId":"winget_app_Mozilla.GeckoDriver","appShortcutName":"Winget Application","appDisplayName":"geckodriver","authorId":"winget","releaseTagName":"winget-0.35.0","downloadUrls":{"0":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/mozilla/geckodriver/releases/download/v0.35.0/geckodriver-v0.35.0-win-aarch64.zip"},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/mozilla/geckodriver/releases/download/v0.35.0/geckodriver-v0.35.0-win64.zip"}},"install":{"win32":{"assetId":1,"exec":null,"installerArgs":null},"winarm":{"assetId":0,"exec":null,"installerArgs":null},"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"WebDriver for Firefox\n\ngeckodriver is a proxy for using W3C WebDriver-compatible clients to interact with Gecko-based browsers.\nKnown problems\n- Startup hang with Firefox running in a container (e.g. snap, flatpak):\n  When Firefox is packaged inside a container (like the default Firefox browser shipped with Ubuntu 22.04), it may see a different filesystem to the host. This can affect access to the generated profile directory, which may result in a hang when starting Firefox. Workarounds are listed in the geckodriver usage documentation.\nAdded\n- Support for Permissions that allow controlling permission prompts within the browser. This enables automated tests to handle scenarios involving permissions like geolocation, notifications, and more.\n- The command line flag --enable-crash-reporter has been added, to allow the crash reporter in Firefox to automatically submit crash reports to Mozilla's crash reporting system if a tab or the browser itself crashes.\n  Note that this feature is disabled by default and should only be used when a crash situation needs to be investigated. See our documentation for crash reports in how to share these with us.\nChanged\n- The validation of the unhandledPromptBehavior capability has been enhanced to support finer configuration options for the User Prompt Handler which are particularly used by WebDriver BiDi.\nFixed\n- The Switch To Frame command now correctly raises an \"invalid argument\" error when the id parameter is missing.\nRemoved\n- Removed support for session negotiation using the deprecated desiredCapabilities and requiredCapabilities.\n- Removed support for the moz:useNonSpecCompliantPointerOrigin capability, which has not bee supported since Firefox 116.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"0.35.0","site":"https://www.mozilla.org/","source":"WinGet","license_or_tos":"MPL-2.0","app_page":"https://firefox-source-docs.mozilla.org/testing/geckodriver/","resources":null}