{"appId":"winget_app_LIJI32.SameBoy","appShortcutName":"Winget Application","appDisplayName":"SameBoy","authorId":"winget","releaseTagName":"winget-0.16.6","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/microsoft/winget-pkgs/releases/download/winget-0.16.6/"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/microsoft/winget-pkgs/releases/download/winget-0.16.6/"}},"install":{"win32":{"assetId":1,"exec":null,"installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"SameBoy is an open source Game Boy (DMG) and Game Boy Color (CGB) emulator, written in portable C.\n\n\nThis version is backwards compatible with save states from SameBoy 0.14.3 and newer, as well as save states from any BESS compliant emulator.New/Improved Features\n- You can now browse Homebrew Hub and download submitted games and demos directly in the iOS frontend.\n    - Currently, only open-source submissions can be viewed in-app. The ability to allow other submissions to appear in SameBoy will be added to Homebrew Hub soon.\n- The option to open SameBoy's Library in the Files app has been added to the iOS frontend's Library screen.\n- Screen dimming is now disabled while emulation is running in the iOS frontend.\n- Improved D-pad controls in the iOS frontend – the center point of the D-pad is now a safe \"rest\" zone; dragging a touch outside of the D-pad no longer releases the button.\n- User-provided boot ROMs can now be selected in the iOS frontend.\nAccuracy Improvements\n- Accuracy improvements to the square \"zombie stepping\" glitch in CGB-D and CGB-E, fixed Telefang title audio that was broken for these revisions.\n- Writing to NRx3 and NRx4 in the same cycle these registers are read by the APU is now emulated correctly.\n- SameBoy will now select cgbE_boot.bin, if available, when emulating CGB-E.\nBug Fixes\n- Fixed a bug that triggered occasional audio distortions on some Macs and iOS devices.\n- Fixed a bug that made the iOS version sometimes incorrectly prefer SGB over CGB emulation for some newly imported ROMs.\n- Fixed a bug that could crash SameBoy upon pausing in the iOS and Cocoa frontends.\n- Fixed a bug that made the Cocoa frontend's Debug Console windows always on top.\n- Fixed a 0.16.5 regression that broke the Cocoa frontend's Memory window on macOS Sonoma.\n- Fixed stability issues when emulating the Game Boy Camera in the iOS frontend.\n- Fixed a bug that caused haptics and rumble to temporarily stop working in the iOS frontend.\nMisc Internal Changes\n- Internal support for AGB-0's boot ROM was added to the core's API (AGB-0 remains unsupported as an emulated revision for now)","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"0.16.6","site":"https://github.com/LIJI32","source":"WinGet","license_or_tos":"X11 License","app_page":"https://github.com/LIJI32/SameBoy","resources":null}