{"appId":"winget_app_Aegisub.Aegisub","appShortcutName":"Winget Application","appDisplayName":"Aegisub","authorId":"winget","releaseTagName":"winget-3.4.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/TypesettingTools/Aegisub/releases/download/v3.4.0/Aegisub-3.4.0.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Cross-platform advanced subtitle editor\n\nAegisub is a free, cross-platform open source tool for creating and modifying subtitles. Aegisub makes it quick and easy to time subtitles to audio, and features many powerful tools for styling them, including a built-in real-time video preview.\nIt’s been a while!\nThis release, the first stable in a decade, was designed to have minimal feature changes from 3.2.2. The goal was to just cut a release that builds on modern systems, which was itself more than enough work. Further releases will include actual features and more normal changelogs. The version is 3.4.0 to avoid conflicts with forks that tagged things under 3.3.x.\nMoving forward, development will continue out of TypesettingTools/Aegisub. arch1t3cht has done a great job of running the primary fork used over the past few years, and now has commit access in TypesettingTools so that he can work out of a more centralized repository. We’d love to get all the work done across various forks back into the mainline repository, so please send PRs!\n32-bit has been dropped, and while this release runs on Windows 7 that requirement will probably be bumped to Windows 10 for following ones.\nBy default, the installer does not install DependencyControl, but it is available under the dropdown by selecting “Full installation”. For anyone unfamiliar, DependencyControl offers a simplified way to install automation scripts from a variety of repositories in Github. Many users may not want or need that functionality, especially considering it slows down startup, but it is available for advanced users.\nMacOS\nNotably missing from this release are signed and notarized MacOS binaries. This is because Apple refuses to let me into the Developer Program and will not explain why. I’m not going to spend any more time fighting their bureaucracy, so if you like MacOS binaries that work on Sequoia please consider:\n- Very politely emailing tcook@apple.com and asking that they figure this out\n- If you know an Apple employee, very politely asking them to open an issue internally\nFor any Apple employees reading this, if you’d like to help and need more personal information, please shoot me an email (which can be found on my Github profile).\nI am not interested in making an LLC to apply with, or signing binaries under anyone else’s name. If Apple wants to block a random US citizen from producing builds that run on their operating system and not even tell them why, I will not be working around their decision; they can fix their process.\nThanks\nI’d like to thank everyone who made this release possible. I’d like to especially thank the following people:\n- arch1t3cht, for far too much to list\n- ctrlctrlv, for sponsoring and getting arch a Mac to work off\n- eli-schwartz, for help with everything Meson\n- FichteFoll, for all the miscellaneous help\n- inkydragon, for all the build system and miscellaneous help\n- jfs, for getting the aegisub.org domain migrated\n- line0, also for far too much to list\n- mia-0, for the original Meson port\n- Myaamori, for tackling some of the hardest parts of the Meson fork\n- Plorkyeran, for making the transition possible and maintaining Aegisub over the years\n- seproDev, for getting the website back online\n- Shinon/Ristellise, for also maintaining a fork and keeping the program alive\n- The libass maintainers, for putting up with the PR from hell\n- torque, for landing the libass PR and moral support\n- wangqr, for the work on your fork and efforts to communicate that I should have been better about reciprocating\nAnd everyone else:\n- baonguyen0703\n- luni-4\n- funami580\n- pan93412\n- Ichunjo\n- anne-o-pixel\n- clr134\n- petzku\n- IanMitchell\n- al3xtjames\n- Totto16\n- moi15moi\n- louisroyer\n- Oneric\n- PeterDaveHello\n- EleonoreMizo\n- oborozuk1\n- 0tkl\nExtra notes for distros\nThe build has been swapped to Meson. There are fewer vendored dependencies than before, which should hopefully make life easier, but a couple still exist. If you encounter problems with the Meson build, please open an issue or email me. It’s been used for builds out of the AUR, but otherwise it’s more battle-tested on Windows and MacOS.\nAegisub can’t be built with LTO.\nRemember that you must build against LuaJIT in 5.2 compatibility mode. Failing to do so will cause many issues with commonly-used scripts. If you patch the check for this out of the build, you are on your own, and I will immediately close any issues related to those builds.\nI will not continue to publish releases in Aegisub/Aegisub; this time was a one-off to ensure everyone picked it up. You’ll want to update links to watch the TypesettingTools repository.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"3.4.0","site":"https://aegisub.org/","source":"Aegisub Team","license_or_tos":"GPL-2.0","resources":null,"verified":false}