{"appId":"winget_app_Diskuv.OCaml","appShortcutName":"Winget Application","appDisplayName":"DkML Native","authorId":"winget","releaseTagName":"winget-2.1.3","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/microsoft/winget-pkgs/releases/download/winget-2.1.3/"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/microsoft/winget-pkgs/releases/download/winget-2.1.3/"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"DkML, a Windows-friendly distribution of OCaml.\n\nThe DkML distribution is an open-source set of software that supports\nsoftware development in pure OCaml. DkML's strengths are its:\n\n✓ full compatibility with OCaml standards like Opam, Dune and ocamlfind\n✓ laser focus on \"native\" development (desktop software, mobile apps and\n  embedded software) through support for the standard native compilers like\n  Visual Studio and Xcode\n✓ ease-of-use through simplified installers and simple productivity commands;\n  high school students should be able to use it\n✓ security through reproducibility, versioning and from-source builds\n\nThere are two categories of programs installed by this DkML package:\n\n1. \"Immediate\" programs that manipulate OCaml bytecode or source code:\n   * `utop`, `ocamlc`, `ocaml`, `ocamlrun`, `ocamlformat`, `ocamllsp`, `ocamllex`,\n     `dkml` and `with-dkml`\n2. \"Shim\" programs that manipulate OCaml native code:\n   * `opam`\n\nThe shim programs have prerequisites. You should install them before you run\nthe shim programs, although if you forget the programs will tell you what you\nneed to install. The prerequisites are:\n\n* Git. If you don't have this, install Git for Windows with:\n    winget install Git.Git\n* Visual Studio Enterprise/Professional/Community/Build Tools 2019 or 2022 in a directory\n  without spaces or parentheses. For example, \"C:\\Program Files (x86)\\VisualStudio\" won't\n  work. If you don't have Visual Studio, install it with:\n    winget install Microsoft.VisualStudio.2022.BuildTools --override \"--wait --passive --installPath C:\\VS17 --addProductLang En-us --add Microsoft.VisualStudio.Workload.VCTools --add Microsoft.VisualStudio.Component.VC.14.38.17.8.x86.x64 --includeRecommended\"\n\nThe DkML package will experience problems if you have a space in your username\n(ex. C:\\Users\\Jane Smith).\n\nThese alternatives may be better depending on your use case:\n\n* Developing in a Javascript first environment? Have a look at Esy and Reason\n* Developing operating system kernels? Have a look at Mirage OS\n* Developing Linux server software like web servers? Plain old OCaml on\n  Debian, etc. works well\n* Writing compilers or proofs? Plain old OCaml works really well\n\nCommercial tools and support are available from Diskuv for mixed\nOCaml/C/C++/Java/Swift development; this pure OCaml winget package\nonly has support for mixed OCaml/C development. Contact\nsupport AT diskuv.com if you need OCaml/C/C++/Java/Swift development.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"2.1.3","site":"https://www.diskuv.com/","source":"WinGet","license_or_tos":"Apache License, Version 2.0","app_page":"https://diskuv.com/dkmlbook/","resources":null}