{"appId":"winget_app_CodeSector.DirectFolders","appShortcutName":"Winget Application","appDisplayName":"Direct Folders","authorId":"winget","releaseTagName":"winget-4.3.4","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://codesector.com/files/directfolders4.3.4.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Quick access to your favorite folders.\n\nDirect Folders is a Windows tool that speeds up folder access and file management. With quick shortcuts to favorite and recent folders, it enhances Open/Save dialogs and streamlines navigation for improved productivity.\nNew Snippets Feature\n– Press the activation key twice to open the Snippets menu.\n– The menu displays a list of Markdown files from a designated folder.\n– Selecting a snippet copies it to the clipboard and pastes it into the active window.\n– Markdown is automatically converted to HTML during pasting.\n– Snippets can be managed using Obsidian for enhanced productivity.\nAdded:\n– Provided the ability to set view, sorting, and grouping options for each favorite folder.\n– Implemented a dark mode option for the configuration window.\n– Added limited support for file dialogs within Autodesk applications.\n– Improved support for Total Commander 11.50 and Directory Opus 13.\n– Shortcuts to folders inside content menus can now be used inside file dialogs.\nFixed:\n– Resolved performance lag when displaying the favorites menu.\n– Fixed issues with dragging and dropping folders into the configuration window.\n– Corrected a problem where recent folders were not saved upon exit.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"4.3.4","site":"https://codesector.com/","source":"Code Sector","license_or_tos":"Proprietary","resources":null,"verified":false}