{"appId":"winget_app_KDE.Kdenlive","appShortcutName":"Winget Application","appDisplayName":"Kdenlive","authorId":"winget","releaseTagName":"winget-24.08.1","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/microsoft/winget-pkgs/releases/download/winget-24.08.1/"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/microsoft/winget-pkgs/releases/download/winget-24.08.1/"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Free and Open Source Video Editor\n\nKdenlive is an acronym for KDE Non-Linear Video Editor.\nIt is a free software (GPL licensed) primarily aimed at the Linux platform, but it also works on BSD1 as it relies only on portable components (Qt and MLT framework). Windows versions are also available, with some drawbacks. See Windows Issues for more information. A port on MacOS is also available.\nThrough the MLT framework Kdenlive integrates many effects for video and audio processing or creation. Furthermore, Kdenlive brings a powerful titling tool, a subtitling feature with AI-supported speech to text conversion, nested timelines (new in version 23.04), animation support through Glaxnimate integration (new in version 22.08) and thus can be used as a complete studio for video creation. Check out What’s New for the most recent feature additions.\nKdenlive 24.08.1 is out and we urge all to upgrade. This version fixes recent playback and render regressions while fixing a wide range of bugs.\nFull changelog:\n- Fix reassigning timecode to project clip. Commit. Fixes bug #492697.\n- Fix possible crash on undo/redo single selection move. Commit.\n- Fix dragging transitions to a clip cut to create a mix. Commit.\n- Fix multiple selection broken. Commit.\n- Fix clip offset not appearing on selection in timeline. Commit.\n- Ensure bin clips with effects disabled keep their effects disabled when added to a new sequence. Commit.\n- Fix keyframe at last frame prevents resizing clip on high zoom. Commit.\n- Fix effects/compositions list size. Commit. Fixes bug #492586.\n- Fix compositions cannot be easily selected in timeline. Commit.\n- Replace : and ? chars in guides names for rendering. Commit. See bug #492595.\n- Don’t trigger timeline scroll when mouse exits timeline on a clip drag, it caused incorrect droppings and ghost clips. Commit. See bug #492720.\n- Fix scolling timeline with rubberband or when dragging from file manager can move last selected clip in timeline. Commit. Fixes bug #492635.\n- Fix adding marker from project notes always adds it at 00:00. Commit. Fixes bug #492697.\n- Fix blurry widgets on high DPI displays. Commit.\n- Fix keyframe param not correctly enabled on first keyframe click. Commit.\n- Fix curveeditor crash on empty track. Commit.\n- Ensure rendering with separate file for each audio track keeps the correct audio tag in the file name. Commit.\n- Fix render project folder sometimes lost, add proper enums instead of unreadable ints. Commit. See bug #492476.\n- Fix MLT lumas not correctly recognized by archive feature. Commit. Fixes bug #492435.\n- Fix configure toolbars messing UI layout. Commit.\n- Effects List: ensure deprecated category is always listed last. Commit.\n- Fix tabulations in Titler (requires latest MLT git). Commit.\n- Titler: ensure only plain text can be pasted, prepare support for tabulations (needs MLT patch). Commit.\n- Don’t accept empty whisper device. Commit.\n- Fix ffmpeg path for Whisper on Mac. Commit.\n- Fix archive doesn’t save the video assets when run multiple times. Commit.\n- Fix document notes timecode links may be broken after project reload. Commit. See bug #443597.\n- Fix broken qml font on AppImage. Commit.\n- Remove incorrect taskmanager unlock. Commit.\nThe post Kdenlive 24.08.1 released appeared first on Kdenlive.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"24.08.1","site":"https://kde.org/","source":"WinGet","license_or_tos":"GPL-3.0","app_page":"https://kdenlive.org/","resources":null}