{"appId":"winget_app_HaystackSoftware.HaystackEditor","appShortcutName":"Winget Application","appDisplayName":"Haystack Editor","authorId":"winget","releaseTagName":"winget-1.90.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://d2dv27o1k99orf.cloudfront.net/windows-installer/HaystackEditorSetup-0.20.0.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"User","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Navigate and refactor your code with ease\n\nAn IDE built on top of a canvas, Haystack takes care of the tedious and confusing parts of coding for you\nYou can now review code in Haystack! And we have some improvements/bug fixes on the side as well.\n\nImprovements:\n1. Dramatically improved canvas performance with many editors\n2. Fixed camera panning issues when focusing on an editor\n3. Fixed editor width shrinking bug when typing into a new editor\n4. Fixed \"Compare active file with...\" functionality\n5. Dependency arrows can now be left clicked to go to the target, and right clicked to go to the source\n\n📝 New Code Review Feature:\nYou can now review GitHub PRs directly on canvas. Currently, you can only view a pull request on the canvas as a dependency graph, but we plan on adding ways to customize this view soon!\n\nHow to review code in Haystack:\n1. Click \"review pull request\" in the top navbar\n2. Select a PR from dropdown or enter a PR’s URL\n3. Add comments via “plus” icon on line numbers\n4. Submit reviews/edit PR via the “edit pull request or submit a review” button on the top right of the canvas\n5. Exit the review via the “exit pull request” button in the top navbar\n\nWe welcome any and all feedback on the code review experience.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"1.90.0","site":"https://haystackeditor.com/","source":"Microsoft Corporation","license_or_tos":"Proprietary","resources":null,"verified":false}