{"appId":"winget_app_Inkscape.Inkscape","appShortcutName":"Winget Application","appDisplayName":"Inkscape","authorId":"winget","releaseTagName":"winget-1.3.2","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/microsoft/winget-pkgs/releases/download/winget-1.3.2/"},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/microsoft/winget-pkgs/releases/download/winget-1.3.2/"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A professional vector graphics software which runs on Linux, macOS and Windows desktop computers.\n\nInkscape is a Free and open source vector graphics editor for GNU/Linux, Windows and macOS. It offers a rich set of features and is widely used for both artistic and technical illustrations such as cartoons, clip art, logos, typography, diagramming and flowcharting. It uses vector graphics to allow for sharp printouts and renderings at unlimited resolution and is not bound to a fixed number of pixels like raster graphics. Inkscape uses the standardized SVG file format as its main format, which is supported by many other applications including web browsers.\nIt can import and export various file formats, including SVG, AI, EPS, PDF, PS and PNG. It has a comprehensive feature set, a simple interface, multi-lingual support and is designed to be extensible; users can customize Inkscape's functionality with add-ons.\nThe Inkscape project has a growing international user community, and many learning materials exist to help get you started with your creations. Help and support is provided by the community, and there are lots of ways for you to get involved if you want to help improve the Inkscape project.\nInkscape is a member of the Software Freedom Conservancy, a US 501(c)(3) non-profit organization. Contributions to Inkscape are tax deductible in the United States.\nInkscape 1.3.2 is an important bugfix release, which fixes a data loss bug in the recently released Inkscape 1.3.1, along with another, smaller issue. We recommend that you update Inkscape from 1.3.1 as soon as possible. If using Windows, please first uninstall the older version.\n- Stars, polygons, spirals, 3D boxes are now saved correctly (MR #6090)\n- The data that was lost when saving these shapes with Inkscape 1.3.1 in an Inkscape SVG file can be recovered in Inkscape 1.3.2 (or any older version, too) if you manually make an edit to the affected shapes. Here's how you can do this quickly for any file:\n  - You can check your files for missing elements by looking at them with a different program, e.g. a web browser. The elements are still visible within Inkscape, but not in any other programs. This way, you will know whether you actually need to fix anything.\n  - To fix all missing shapes at once, you can select all elements in all layers (Ctrl + Alt + A, need to unlock them first), and move them right and back left again with a press on the arrow keys.\n  - Symbols and patterns containing these shapes need to be turned into normal objects to allow Inkscape to add back the missing data.\n- Unfortunately any files you have saved as plain or optimized SVG with Inkscape 1.3.1 will never be recoverable, as the shape metadata is irretrievably lost for those file types.\n- When using the new 'Text to glyphs' function, lines no longer end with @ signs, when there's a linebreak (MR #6094, Bug #4675).\n- Traditional Chinese translation updated (MR #6105)\n- Windows installer banner layout fixed (MR #6097)","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"1.3.2","site":"https://inkscape.org/","source":"WinGet","license_or_tos":"GPL-2.0","app_page":"https://inkscape.org/release/","resources":null}