{"appId":"winget_app_Redisant.MQTTAssistant","appShortcutName":"Winget Application","appDisplayName":"MQTT Assistant","authorId":"winget","releaseTagName":"winget-2.0.6.8","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"MQTT visual management and monitoring tool\n\nMQTT Visual management and monitoring - structured topics and dynamic previews, support various message types, draw message.\n\n- Structured topics and dynamic preview: MQTT Assistant organizes topics into a tree-like structure to make topics clear. Dynamic previews let you know as soon as your message arrives.\n- Drawing graphs: MQTT Assistant keeps historical messages for each topic, and then automatically parses message fields and draws graphs (polyline, quadratic fit, ladder) to make data changes over time clear at a glance.\n- Data formatting: MQTT Assistant will automatically recognize and format different data formats, including Text, JSON, XML, HEX, MessagePack, and various integer and floating point types.\n- Data Templates: Using the data templates provided by MQTT Assistant, you can generate massive, heterogeneous, real data for any development, testing or demonstration purpose.\n- Stress test: When creating messages, with data templates and timers, you can send thousands of messages at a time for performance testing to see how the system handles the load.\n- Multi-tab management, open multiple connections at the same time.\n- Supports MQTT v5.0 and MQTT v3.1.1 protocols, supports connecting to MQTT servers via WebSocket.\n- [Improved] Reliability updates\n- [Improved] Sorting of topic search results","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"2.0.6.8","site":"https://www.redisant.com/","source":"Redisant","license_or_tos":"Proprietary","resources":null,"verified":false}