{"appId":"winget_app_Zettlr.Zettlr","appShortcutName":"Winget Application","appDisplayName":"Zettlr","authorId":"winget","releaseTagName":"winget-3.2.3","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/Zettlr/Zettlr/releases/download/v3.2.3/Zettlr-3.2.3-x64.exe"}},"install":{"win32":{"assetId":1,"exec":null,"installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A Markdown Editor for the 21st century.\n\nZettlr is a supercharged markdown editor that combines many writing editor features and collect them in one application.\nIt aims at speeding up your workflow and help you write without any interruptions.\nVisual fixes | Better updates | Crash fixes\nThis update fixes issues across several areas of the app. Primarily, we have improved the rendering of elements in the editor, the usability of drag & drop and paste operations, the updater, and a few rare but severe bugs. More specifically, the image renderer is now more usable, and works and looks better. Also, we have improved some rendering issues with regard to blockquotes and highlights. Thirdly, the updater now provides both better feedback and checks once an hour, meaning that the app will notify you of new updates even if you rarely restart it. Also, it will notify you of an available update with a message box, rather than just the update icon in the toolbar. Lastly, users have reported and we have found a few issues that could freeze up individual editors, or the entire app, leading to a suboptimal experience. As always, for all changes, please consult the changelog below.\nDo you enjoy Zettlr? Consider donating to help us pay for the development costs. You can donate monthly on Patreon or once via PayPal. Additionally, you can sponsor Hendrik Erz on GitHub. Thanks for your support!\nChangelog\nGUI and Functionality\n- Fix highlight markers not appearing while the emphasis renderer is on when the user edits a highlighted span\n- Add pascal syntax highlighting to the code block autocomplete\n- Improved highlight detection around punctuation marks and other non-word characters\n- Image previews now treat escaped quotes in image titles properly (![alt](image.png \"\\\"quoted\\\" title\"))\n- Fix an issue with image caption updating that may replace text surrounding the image (#5021)\n- Too small images won't display the informational layers anymore (#3953)\n- Improve image copy and paste operations (#5408)\n- Improve dropping operations onto the main editor\n- Blockquote markers are now properly hidden with the emphasis renderer on and the cursor not within the blockquote (#4667)\n- Fix ambiguous German unsaved-changes dialog (#5072)\n- Fixed an issue where some websites could make Zettlr freeze on loading a link preview via catastrophic backtracking in a regular expression (#4883)\n- Make link preview generator more resilient\n- Updated German (de-DE) translation (#5399)\n- Fixed an issue where indented LaTeX math equations could crash the editor instance due to the code marks including superfluous newlines (#4726)\n- Fixed missing code block background on YAML Frontmatters\n- Improved visual feedback during the update process\n- Zettlr now checks for new updates once an hour instead only during startup\n- New tags are now picked up by the app immediately (#5140)\n- Fixed a UI regression where clicking on the tag filter didn't focus the text box (#5444)\n- Nightly releases are no longer considered older than the current stable version (#5429)\n- Fixed file duplication (#5360)\n- Fixed a bug that would cause a saved window state to be lost due to an issue with the active file not existing anymore\n- Zettlr now respects your chosen symbols for bold and italic formatting upon converting HTML to Markdown (e.g., during paste; #5396)\nUnder the Hood\n- Moved image preview styles into Codemirror plugin; simplified container\n- Bump Pandoc to version 3.5\n- Properly type document tree JSONs and make the logic more resilient to a lack of an active file upon hydration\n- Properly type props for MainEditor Vue component\nNew Contributors\n- @laurissss made their first contribution in https://github.com/Zettlr/Zettlr/pull/5399\n- @chiphogg made their first contribution in https://github.com/Zettlr/Zettlr/pull/5444\nFull Changelog: https://github.com/Zettlr/Zettlr/compare/v3.2.2...v3.2.3","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"3.2.3","site":"https://github.com/Zettlr/Zettlr","source":"WinGet","license_or_tos":"GPL-3.0","resources":null,"verified":false}