{"appId":"winget_app_qBittorrent.qBittorrent","appShortcutName":"Winget Application","appDisplayName":"qBittorrent","authorId":"winget","releaseTagName":"winget-5.0.2","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Free and reliable P2P Bittorent client.\n\nqBittorrent is a bittorrent client programmed in C++ / Qt that uses libtorrent (sometimes called libtorrent-rasterbar) by Arvid Norberg.\nIt aims to be a good alternative to all other bittorrent clients out there. qBittorrent is fast, stable and provides unicode support as well as many features.\nqBittorrent v5.0.2 was released.\nLibrary versions\nlibtorrent 1.2.19+git8ad05ebd41 / 2.0.11+git4b4003d0fd\nQt 6.7.3\nBoost 1.86\nv5.0.2 changelog:\n- BUGFIX: Remove trackers from previous category when moved to new one (glassez)\n- BUGFIX: Fix .torrent file could not be deleted when torrent is canceled (glassez)\n- BUGFIX: Reset tracker entries when pausing the session (glassez)\n- BUGFIX: Check real palette darkness to detect \"dark theme\" (glassez)\n- BUGFIX: Correctly handle \"torrent finished\" events (glassez)\n- BUGFIX: Preserve initial torrent progress while checking resume data (glassez)\n- BUGFIX: Avoid reapplying Mark-of-the-Web when it already exists (Chocobo1)\n- BUGFIX: Don't apply Mark-of-the-Web on existing files (Chocobo1)\n- WEBUI: Add color scheme switcher (sledgehammer999)\n- SEARCH: Correctly delete the moved search tab (glassez)\n- WINDOWS: Correctly save and restore Qt style setting (glassez)\n- WINDOWS: NSIS: update Luxembourgish, Simplified Chinese and Traditional Chinese translations (Ikko Eltociear Ashimine, 3gf8jv4dv)","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"5.0.2","site":"https://www.qbittorrent.org/","source":"The qBittorrent project","license_or_tos":"GPL-3.0","resources":null,"verified":false}