{"appId":"winget_app_GDevelop.GDevelop","appShortcutName":"Winget Application","appDisplayName":"GDevelop","authorId":"winget","releaseTagName":"winget-5.4.216","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/4ian/GDevelop/releases/download/v5.4.216/GDevelop-5-Setup-5.4.216.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"The fastest, easiest, most powerful no-code game engine.\n\nGDevelop is a free, open-source game engine that's 10x easier and faster to use than anything else. Build from anywhere — even on your phone. Publish everywhere: iOS, Android, Steam, web, gaming platforms. Reach millions of players or create the next hit game you've been dreaming of.\n📝 🏎️ Objects now directly editable from the Properties panel\n\nWhen an object is selected (or when \"Edit object\" is chosen in the Properties panel after choosing an instance), this panel will now show the object properties, behaviors, variables and effects. Everything can be directly edited from there.\nThis allows for fast edition of most elements of an object: appearance, properties, but also behaviors, variables, effects... Most work and iterations on your game should be faster, from adapting the appearance of a text to tweaking behaviors and updating the preview to check the result in realtime. For example, behaviors can be directly added, removed and configured:\n\n💡 If you keep the preview of the game opened, on the desktop app, you can then click on the \"Update\" button in the toolbar to apply changes to the live game, without restarting the preview.\n✈️ Custom objects (\"prefabs\") can now be created (Experimental)\nCustom objects are containers, composed of one or more other objects and having custom logic (made with events, like in a traditional scene) inside them. In this new version of GDevelop, you can now select a few instances on the scene and extract them into a custom object that will contain them and their associated object:\n\n\"Custom objects\" are also called \"Prefabs\" or \"Templates\" in some game engines.\nThey almost act like if they are a scene, but available as an object. Like custom behaviors, they can have actions, conditions and expressions, so they can be manipulated by the scene events. They allow to speed-up development and make games more modular by having an object that can be reused in different scenes.\nFor example, you can build:\n- A custom object that is a dialog: a background, some text, some buttons. This allows to do all the logic related to this dialog inside the custom object events, without cluttering the scene.\n- A character or some other game objects that is composed of multiple parts. For example,\nRead the documentation to learn more about their usage.\nYou can see here the two buttons extracted into a custom object. Notice the checkered background indicating that this is not a scene but a custom object that can be reused in multiple scenes:\n\n💝 Improvements\n- UI Improvements across the app\n- Allow closing & deleting an opened cloud project\n- Add icons to help understand to scroll during in app tutorial\n- See also all the improvements in version 5.4.215\n🐛 Bug fixes\n- A lot of fixes for custom object creation:\n  - Fix closing of custom object tabs when they are deleted from their extension\n  - Fix autocompletion of layers and points for custom object children\n  - Fix object lists not always up-to-date in the extension events editor after adding an object in the custom object editor\n  - Fix custom object editor not closed when the extension is renamed\n  - Fix mouse and key parameters for functions\n  - Fix custom object loading when opening a project\n  - Fix extraction to custom object sometimes using an already used name\n  - Fix wait action in custom objects\n- Fix objects owned by Multiplayer host not being properly migrated when host changes\n- Avoid intermittent game crash, due to an audio issue, when resuming the game (when focused back again)\n- Fix memory corruption/crashes when events in extensions had errors\n- Prevent players from claiming a leaderboard score as an anonymous user.\n- See also all the bug fixes in version 5.4.215\n⚙️ Extensions\n- [Auto typing] Fix the word wrapping\n🎨 Assets\n- Add a new premium pack: Casual UI and Interface SFX (by @Bouh)\n- Add a new premium pack: 2D Pixel Quest -The Dungeon by BarelyApes\n🛠 Internal changes (for developers)\n- Fix silent exceptions when resource loading finished after an instance was reset/removed\n- Add clang-tidy and builds with assertions/memory sanitizers for libGD.js\n- Fix missing or wrong arguments in GDevelop.js tests + uninitialized variables\n  - These were \"silently succeeding\" but would create issues when Emscipten is run with SAFE_HEAP=1.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"5.4.216","site":"http://www.florianrival.com/","source":"WinGet","license_or_tos":"MIT","resources":null,"verified":false}