{"appId":"winget_app_Mozilla.Firefox","appShortcutName":"Winget Application","appDisplayName":"Mozilla Firefox","authorId":"winget","releaseTagName":"winget-134.0","downloadUrls":{"0":{"installerType":"WindowsInstallerExe","asset":"","url":"https://download-installer.cdn.mozilla.net/pub/firefox/releases/134.0/win64-aarch64/en-US/Firefox%20Setup%20134.0.exe"},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://download-installer.cdn.mozilla.net/pub/firefox/releases/134.0/win64/en-US/Firefox%20Setup%20134.0.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":{"assetId":0,"exec":null,"scope":"Machine","installerArgs":null},"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Mozilla Firefox is free and open source software, built by a community of thousands from all over the world.\n\nFirefox Browser, also known as Mozilla Firefox or simply Firefox, is a free and open-source web browser developed by the Mozilla Foundation and its subsidiary, the Mozilla Corporation. Firefox uses the Gecko layout engine to render web pages, which implements current and anticipated web standards. In 2017, Firefox began incorporating new technology under the code name Quantum to promote parallelism and a more intuitive user interface. Firefox is officially available for Windows 7 or newer, macOS, and Linux. Its unofficial ports are available for various Unix and Unix-like operating systems including FreeBSD, OpenBSD, NetBSD, illumos, and Solaris Unix.\nNew\n- Firefox now supports touchpad hold gestures on Linux. This means that kinetic (momentum) scrolling can now be interrupted by placing two fingers on the touchpad.\n- Hardware-accelerated playback of HEVC video content is now supported on Windows.\n- Ecosia's availability has been expanded to all languages in the German region along with Austria, Belgium, Italy, Netherlands, Spain, Sweden and Switzerland.\nFixed\n- Various security fixes.\nChanged\n- Firefox now follows the model HTML specification for transient user activation more closely. This change makes popup blocking less strict in cases where previous versions of Firefox were overly aggressive, reducing erroneous blocking prompts.\n- A refreshed New Tab layout is being rolled out to users in the US and Canada, featuring a repositioned logo and weather widget to prioritize Web Search, Shortcuts, and Recommended Stories at the top. The update includes changes to the card UI for recommended stories and allows users with larger screens to see up to four columns, making better use of space.\n\n  Currently available in: Canada, United States\n  This feature is part of a progressive roll out.\n  What is a progressive roll out?\n  Certain new Firefox features are released gradually. This means some users will see the feature before everyone does. This approach helps to get early feedback to catch bugs and improve behavior quickly, meaning more Firefox users overall have a better experience.\nDeveloper\n- Improved support for debugging web extensions, such as automatically reloading the web extension's source code in the Debugger when the extension is reloaded.\n- Debugger log-point values are now automatically converted into profiler markers, making it easy to add information to the marker timeline directly from the Debugger.\n- The Network panel displays information about Early Hints, including a dedicated indicator for the 103 HTTP status code in the user interface.\n\nCommunity Contributions\n- With the release of Firefox 134, we are pleased to welcome the developers who contributed their first code change to Firefox in this release, 12 of whom were brand new volunteers! Please join us in thanking each of these diligent and enthusiastic individuals, and take a look at their contributions:\n  - Adam Motaouakkil: 1926634\n  - defaude: 1889914\n  - edwyn.zhou: 1926989\n  - Haoran Tang: 1814195\n  - Javier Fernandez: 1922522\n  - Lucas Enoki: 1926767\n  - majaharding: 1865148, 1913613\n  - Neri Marschik: 655445\n  - Sergei Smagin: 1851327\n  - Spencer: 1920145\n  - Swarup Ukil: 1930294\n  - Xuan Chen: 1929801, 1931493","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"134.0","site":"https://www.mozilla.org/","source":"Mozilla","license_or_tos":"MPL-2.0","resources":null,"verified":false}