{"appId":"winget_app_Poly.PolyLens","appShortcutName":"Winget Application","appDisplayName":"Poly Lens","authorId":"winget","releaseTagName":"winget-1.5.1.6079","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Allows end-users to customize their settings and get visible status of their Plantronics/Poly audio device on their desktop.\n\nPoly Lens Desktop is an application that enables you to configure and manage your Poly audio and video devices. This app allows you to connect Poly USB devices to the Poly Lens Portal for management and device Insights.\nIntroduction\nImportant:\nIMPORTANT\n- For Cisco Jabber to work seamlessly, any pre-existing version of Plantronics Hub must be uninstalled.\n- Cisco Jabber must be stopped before initiating the installation/upgrade to Poly Lens Desktop 1.5.1. Restart Cisco Jabber once the installation/upgrade is complete.\nSoftware version: 1.5.1\nRelease date: October 2024\n\nWhat's New\nThis software includes the following updates.\n- Bug fixes\n\nResolved Issues\nThis release includes the following bug fixes.\n- Fixed an issue for multiple users on a PC, the previous version of Poly Lens Desktop did not retain the app ID, leading to duplicate Poly Lens Desktop App IDs in the Poly Lens Cloud.\n- Fixed an issue when a PC was put to sleep and then awakened, the connection between Webex/Jabber and Poly Lens Desktop failed to re-establish.\n\nKnown Issues\nThis release has the following known issues:\n- When using the Cisco Webex softphone, toggling between an active call and a call on hold using a long press of the mute or call control button does not work; the active call remains active.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"1.5.1.6079","site":"https://www.hp.com/us-en/poly.html","source":"WinGet","license_or_tos":"Proprietary","app_page":"https://www.hp.com/us-en/poly/software-and-services/software/poly-lens/app.html","resources":null}