{"appId":"winget_app_Emurasoft.EmEditor","appShortcutName":"Winget Application","appDisplayName":"EmEditor","authorId":"winget","releaseTagName":"winget-24.4.1","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://download.emeditor.info/emed64_24.4.1.msi"}},"install":{"win32":{"assetId":1,"exec":null,"installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A fast, lightweight, yet extensible, easy-to-use text editor, code editor, CSV editor, and large file viewer for Windows.\n\n\nToday, we are releasing EmEditor v24.4.1.\nv24.4.1 includes the following bug fixes. Please make sure to always update to the latest version for stable operations.\n- Fixed the issue of freezing and crashing during document comparison that occurred in v24.4.0.\n- Resolved the problem where bold text was not displayed even when the “Highlight Matching Brackets” option was enabled in v24.4.0.\n- Fixed the display position of bookmarks and change line indicators in the Markdown design view in v24.4.0.\n- Addressed a potential crash issue with the OpenDocuments plugin.\n- Reduced the likelihood of crashes due to memory shortage when undoing after replacing all instances including newlines.\n- Fixed display issues that occurred when changing line wrapping methods during document comparison.\n- Improved crash reports.\n- Addressed customer reported issues (1, 2, 3).\nIf you use the Desktop Installer version, you can select Check for Updates on the Help to download the newest version. If this method fails, please download the newest version, and run the downloaded installer. If you use the Desktop portable version, you can go to the Download page to download the newest version. The Store App versions can be updated through Microsoft Store (64-bit or 32-bit) after a few days.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"24.4.1","site":"https://www.emeditor.com/","source":"WinGet","license_or_tos":"Proprietary","resources":null,"verified":false}