{"appId":"winget_app_Foxit.PhantomPDF.Subscription.MSI","appShortcutName":"Winget Application","appDisplayName":"Foxit PDF Editor (MSI)","authorId":"winget","releaseTagName":"winget-2024.3.0.26795","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Powerful desktop PDF solution to create and edit PDF documents and integrate with Foxit eSign.\n\n\nNew Features and Improvements in Foxit PDF Editor Subscription Release 2024.3.0.26795\n- Create organized PDF binders\n  The Binder feature offers an efficient way to compile and organize multiple documents in different formats into a single file - a PDF binder, with the support of various customizations like TOC (table of contents) generation. Saving the compiled set as a binder project or a template preserves the entire binder structure, including the arrangement of documents, TOC, and any customizations made. This feature is useful for users such as legal professionals or sales representatives to easily consolidate multiple related documents into one cohesive presentation or report.\n- New features and enhancements for AI Assistant\n  - Move the AI Assistant button to the end of the ribbon tabs for easy access to the feature.\n  - Allow purchasing additional quotas to use the AI features after consuming all the free quota.\n  - Provide more smart PDF commands, automatic document analysis, and enhancements in document translation.\n  - Add buttons for customer feedback on AI responses and provide optimizations such as faster loading speed, improved accuracy of AI responses, and the adjustable width of the AI Assistant panel.\n- Modify the page size for multiple documents at once.\n- Support Vietnamese and Indonesian text recognition in the OCR feature.\n- Support HKSCS (Hong Kong Supplementary Character Set) coded in ISO 10646.\n- Provide settings for more security control when opening non-PDF attachments.\n- Other enhancements to the user experience.\nIssues Addressed in Foxit PDF Editor Subscription Release 2024.3.0.26795\n- Fixed some security and stability issues. Click here for details.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"2024.3.0.26795","site":"https://www.foxit.com/","source":"WinGet","license_or_tos":"Proprietary","resources":null,"verified":false}