{"appId":"winget_app_qBittorrent.qBittorrent","appShortcutName":"Winget Application","appDisplayName":"qBittorrent","authorId":"winget","releaseTagName":"winget-5.0.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://sourceforge.net/projects/qbittorrent/files/qbittorrent-win32/qbittorrent-5.0.0/qbittorrent_5.0.0_x64_setup.exe/download"}},"install":{"win32":{"assetId":1,"exec":null,"installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Free and reliable P2P Bittorent client.\n\nqBittorrent is a bittorrent client programmed in C++ / Qt that uses libtorrent (sometimes called libtorrent-rasterbar) by Arvid Norberg.\nIt aims to be a good alternative to all other bittorrent clients out there. qBittorrent is fast, stable and provides unicode support as well as many features.\nqBittorrent v4.6.6 and v5.0.0rc1 were released.\nmacOS: The minimum version for v5.0.0rc1 is macOS 11 (Big Sur).\nAppImage: The v5.0.0rc1 AppImage is created on Ubuntu 22.04 (Jammy Jellyfish). It should work on similarly aged distros.\nLibrary versions\nlibtorrent 1.2.19+git0ca20a38c9 / 2.0.11+git2ab8fedabb\nQt 6.4.3 (Windows, macOS) / 6.6.3 (AppImage) / 6.7.2 (Windows rc, macOS rc, AppImage rc)\nBoost 1.86\nv4.6.6 changelog:\n- BUGFIX: Fix handling of tags containing '&' character (glassez)\n- BUGFIX: Show scroll bar in Torrent Tags dialog (glassez)\n- BUGFIX: Apply bulk changes to correct content widget items (glassez)\n- BUGFIX: Hide zero status filters when torrents are removed (glassez)\n- BUGFIX: Fix Incomplete Save Path cannot be changed for torrents without metadata (glassez)\n- WEBUI: Correctly apply changed \"save path\" of RSS rules (glassez)\n- WEBUI: Clear tracker list on full update (skomerko)\n- OTHER: Update User-Agent string for internal downloader and search engines (cayenne17)\n- Full changes\nv5.0.0rc1 changelog (since beta1):\n- FEATURE: Use Start/Stop instead of Resume/Pause (thalieht)\n- FEATURE: Add the Popularity metric (Aliaksei Urbanski)\n- FEATURE: Focus on Download button if torrent link retrieved from the clipboard (glassez)\n- FEATURE: Add ability to pause/resume entire BitTorrent session (glassez)\n- FEATURE: Add an option to set BitTorrent session shutdown timeout (glassez)\n- FEATURE: Apply \"Excluded file names\" to folder names as well (glassez)\n- FEATURE: Allow to use regular expression to filter torrent content (glassez)\n- FEATURE: Allow to move content files to Trash instead of deleting them (glassez)\n- FEATURE: Add ability to display torrent \"privateness\" in UI (ManiMatter)\n- FEATURE: Add a flag in Peers tab denoting a connection using NAT hole punching (stalkerok)\n- BUGFIX: Adjust tracker tier when adding additional trackers (Chocobo1)\n- BUGFIX: Fix inconsistent naming between Done/Progress column (luzpaz)\n- BUGFIX: Sanitize peer client names (Hanabishi)\n- BUGFIX: Apply share limits immediately when torrent downloading is finished (glassez)\n- BUGFIX: Show download progress for folders with zero byte size as 100 instead of 0 (vikas_c)\n- WEBUI: Conditionally show filters sidebar (Thomas Piccirello)\n- WEBUI: Add support for running concurrent searches (Thomas Piccirello)\n- WEBUI: Improve accuracy of trackers list (Thomas Piccirello)\n- WEBUI: Fix error when category doesn't exist (Thomas Piccirello)\n- WEBUI: Improve table scrolling and selection on mobile (Thomas Piccirello)\n- WEBUI: Restore search tabs on load (Thomas Piccirello)\n- WEBUI: Restore previously used tab on load (Thomas Piccirello)\n- WEBUI: Increase default height of 'Share ratio limit' dialog (thalieht)\n- WEBUI: Use enabled search plugins by default (Thomas Piccirello)\n- WEBUI: Add columns Incomplete Save Path, Info Hash v1, Info Hash v2 (thalieht)\n- WEBUI: Always create generic filter items (skomerko)\n- WEBAPI: Provide endpoint for listing directory content (Paweł Kotiuk)\n- WEBAPI: Provide \"private\" flag via \"torrents/info\" endpoint (ManiMatter)\n- WEBAPI: Add a way to download .torrent file using search plugin (glassez)\n- WEBAPI: Add \"private\" filter for \"torrents/info\" endpoint (ManiMatter)\n- WEBAPI: Add root_path to \"torrents/info\" result (David Newhall)\n- SEARCH: Lazy load search plugins (milahu)\n- SEARCH: Add date column to the built-in search engine (ducalex)\n- SEARCH: Allow to rearrange search tabs (glassez)\n- WINDOWS: Don't access \"Favorites\" folder unexpectedly (glassez)\n- Full changes","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"5.0.0","site":"https://www.qbittorrent.org/","source":"WinGet","license_or_tos":"GPL-3.0","resources":null,"verified":false}