{"appId":"winget_app_ShareX.ShareX","appShortcutName":"Winget Application","appDisplayName":"ShareX","authorId":"winget","releaseTagName":"winget-16.1.0","downloadUrls":{"0":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/ShareX/ShareX/releases/download/v16.1.0/ShareX-16.1.0-setup.exe"},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/ShareX/ShareX/releases/download/v16.1.0/ShareX-16.1.0-setup.exe"}},"install":{"win32":{"assetId":1,"exec":null,"installerArgs":null},"winarm":{"assetId":0,"exec":null,"installerArgs":null},"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Screen capture, file sharing and productivity tool\n\nShareX is a free and open source program that lets you capture or record any area of your screen and share it with a single press of a key. It also allows uploading images, text or other types of files to many supported destinations you can choose from.\n- Added an \"Update channel\" option to the \"Application settings\" window with the following options:\n  - Release\n  - Pre-release\n  - Dev\n- Added \"Background dim strength\" region capture option.\n- Scrolling capture improvements:\n  - Added scrolling capture status indicator.\n  - Scrolling capture automatically stops if the first image combine attempt fails.\n  - Improved image combining performance.\n  - Mouse wheel input is now ignored within the scrolling capture region.\n  - Added help button to scrolling capture window, which opens this page: https://getsharex.com/docs/scrolling-screenshot\n- Update FFmpeg to version 7.0.\n- Previously, releasing the Escape key would close the active window. Now, it will also check if the Escape key was initially pressed in the active window as well.\n- Improved task icon detection in \"Quick task menu\".\n- Added \"Cut out background color\" option for image editor \"Cut out\" tool.\n- Browser extension host manifest files are now stored in app folder instead of Documents\\ShareX\\Tools folder.\n- Improved update downloader progress text.\n- Added \"Enable browser extension support\" option to setup.\n- Google has forced us to use a more restrictive API scope (/auth/drive.file) for Google Drive, which does not allow us to see files or folders anymore. Because of this, we cannot provide folder listing and selection support anymore.\n  - However, there is a workaround. You can navigate to the Google Drive website in your browser, open the folder you want to upload to, and then copy the folder ID from the browser's address bar to \"Folder ID\" textbox.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"16.1.0","site":"https://getsharex.com/","source":"WinGet","license_or_tos":"GPL-3.0","resources":null,"verified":false}