{"appId":"winget_app_Redisant.PulsarAssistant","appShortcutName":"Winget Application","appDisplayName":"Pulsar Assistant","authorId":"winget","releaseTagName":"winget-1.1.0.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Pulsar visual management and monitoring tool\n\nPulsar Assistant - manage your tenants, namespaces, topics, subscribe and consume messages, simulate messages and stress test.\n\n- SSL/TLS: Pulsar Assistant supports various authentication methods, including HTTP basic and JWT (Java Web Token), etc.; it also supports SSL/TLS transmission encryption to ensure data transmission security.\n- Publishing messages: Using Pulsar Assistant, you can publish messages to specified topics at any time; in addition, you can also combine data templates to send thousands of messages at a time for performance testing to understand how the system handles the load.\n- Data formatting: Automatically identify and format different data formats, including Text, JSON, XML, HEX, MessagePack, and various integer and floating point types.\n- Data Templates: Using the data templates provided by Pulsar Assistant, you can generate massive, heterogeneous, realistic data for any development, testing or demo purposes.\n- Perfect management: view the topic-divided bundles and assigned brokers, topics under the jurisdiction of the bundles, and perform split, unload, clear, delete, etc. on the bundles. Manage subscribers and consumers, process message rate and delay. Reset subscribers, skip a certain number of messages, etc.\n- [Improved] Upgrade dependencies\n- [Improved] Support Pulsar 3.3.0","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"1.1.0.0","site":"https://www.redisant.com/","source":"WinGet","license_or_tos":"Proprietary","resources":null,"verified":false}