{"appId":"winget_app_DataHammer.HammerPDF","appShortcutName":"Winget Application","appDisplayName":"Hammer PDF","authorId":"winget","releaseTagName":"winget-1.2.2","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/HammerPDF/Smart-Scientific-Reader/releases/download/v1.2.2/Hammer.PDF-win-1.2.2.exe"}},"install":{"win32":{"assetId":1,"exec":null,"installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"One-stop Scientific PDF Reader\n\nHammer PDF, a brand new Smart Scientific Reader developed and supported by the DataHammer Research Group at the School of Computer Science, Beijing Institute of Technology, provides fast analysis of PDF documents and reliable academic information in real time. Look here to boost your research productivity!\nHammer PDF combines academic resources such as papers, authors, report videos, datasets, codes, and blogs into an organic whole by data association and knowledge mining, etc. It not only provides basic PDF reading features, but also supports natural language processing tasks such as information extraction and semantic analysis, greatly expanding the capabilities of traditional PDF readers, offering researchers the latest and reliable extended information, and significantly improving the productivity of academic research.\nAs the core component of the application, the academic features include information extraction, information extension, academic search, and academic dialog. Hammer PDF is designed to deliver a one-stop PDF reading experience by fusing data from multiple sources and modalities on the academic search engine Hammer Scholar. The following are key features.\n- Simple Interaction. With reasonable interaction, it supports smooth operation on screens of any size.\n- Seamless Use. Windows, MacOS and Linux supported. All functions can also be used in modern browsers.\n- Info Protection. Any private information about you will not sent to the server, only for scholar analysis.\n- Extract Scholar. Relying on machine learning, structure of PDF and scientific terms can be extracted.\n- Translation. Multilingual explanations in Chinese, English can be fetched anytime, anywhere.\n- Citation Network. Analyze the citation network of papers, look at scientific frontiers in the world.\n1. (NEW) Specify the target language when translating selected text.\n2. (FIXED) Fix the bug that the context-menu texts fail to be internationalized.\n3. (IMPROVED) Fold original text that is too long to read the translation.\n4. (IMPROVED) Improved selection at the end of paragraph, no longer need to move the cursor carefully.\n5. (IMPROVED) Update PDF viewer PDF.js to v2.14.305.\n6. (IMPROVED) Update icon library to enhance aesthetics.\n7. (IMPROVED) Improve dark mode, fix the problem of blurred text edges.\n8. (IMPROVED) Update the document structure extraction engine to support more structures.\n9. (FIXED) Fix the bug when toggling visibility of academic marks.\n10. (NEW) Introduce Linux package in AppImage format.\n11. (NEW) Add guide instructions to setting panel.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"1.2.2","site":"https://hammerscholar.net/","source":"WinGet","license_or_tos":"Freeware","resources":null,"verified":false}