{"appId":"winget_app_Spyder.Spyder","appShortcutName":"Winget Application","appDisplayName":"Spyder","authorId":"winget","releaseTagName":"winget-5.5.6","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/microsoft/winget-pkgs/releases/download/winget-5.5.6/"},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/microsoft/winget-pkgs/releases/download/winget-5.5.6/"}},"install":{"win32":{"assetId":1,"exec":null,"installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Scientific Python Development Environment similar to matlab\n\n\nSimple installation\nThe easiest way to start using Spyder is by downloading our own installers for Windows, macOS and Linux (experimental):\n- Windows (Windows 10+): Spyder_64bit_full.exe\n- macOS\n  - M1 (14.0+): Spyder_arm64.dmg\n  - Intel (12.0+): Spyder.dmg\n- Linux (CentOS 7+): Linux-x86_64.sh (Experimental)\nAdvanced installation\nImportant Notes\n1. If you are new to Python or the Scientific Python ecosystem, we strongly recommend you to install and use Anaconda. It comes with Spyder and all its dependencies, along with the most important Python scientific libraries (i.e. Numpy, Pandas, Matplotlib, IPython, etc) in a single, easy to use environment.\n2. We also support pip, but please be aware that pip installations are for advanced users with good knowledge of all Spyder dependencies. Because of that, all installation problems you encounter are expected to be solved by you.\nAnaconda\nYou can easily install this version if you use Anaconda by closing Spyder and then running the following command in a system terminal (Anaconda Prompt on Windows, xterm on Linux or Terminal.app on macOS):\nconda install spyder=5.5.6\nNotes:\n- It can take several months for a new Spyder version to be part of Anaconda. Please be patient until then and do not report it as a problem because we don't have any control over that.\n- If you installed Anaconda for the first time, you need to run the following command first:\n  conda update anaconda\n  before running the command above.\nPip\nYou can also use pip to update Spyder with the following command in a system terminal (cmd.exe on Windows, xterm on Linux or Terminal.app on macOS):\npip install -U spyder\nNote: Do not use this command if you are using Anaconda because it will break your installation.\nContributors\nA big thank you to all the contributors that made this release possible: @mrclary @hmaarrfk @ccordoba12 @dalthviz @spyder-bot (our translators) 🎉\nRelease notes\nFor the full list of closed issues and merged pull requests in this release, please see our Changelog.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"5.5.6","site":"https://www.spyder-ide.org","source":"WinGet","license_or_tos":"MIT","app_page":"https://www.spyder-ide.org","resources":null}