{"appId":"winget_app_SonicTeamJr.SonicRoboBlast2Kart","appShortcutName":"Winget Application","appDisplayName":"Sonic Robo Blast 2 Kart","authorId":"winget","releaseTagName":"winget-1.6","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"SRB2Kart is a classic styled kart racer, complete with beautiful courses, and wacky items.\n\n\nHeadline changes\n- Reduced visual jitter under unstable network conditions.\n- The software renderer has gotten a significant performance boost!\n- Specifically beneficial on maps with busy visuals (many objects, midtextures, and segs visible at once).\n- One playtester with a slower computer reported \"Avant Garden Classic\", a community-created map with a reputation for bad performance, went from unplayable to a little under 35fps!\n- Controller input has been updated to use the SDL Game Controller API.\n- The game now supports a wider selection of controllers, including Xinput and Switch.\n- Controller axes now have easier-to-identify names.\n- D-Pad buttons are now considered hat switches.\n- Known issue:\n  Mayflash GameCube controller adapters are not correctly supported.\n- Delay measurements are now more accurate.\n- If the client has caught up to the server (say, during a screen transition), don't report an extremely large delay.\n- Fix an off-by-one error that slightly underestimated client delay.\n- Don't include holepunch time when measuring server ping.\n- The in-game server browser has been improved.\n- Retries getting info multiple times; consistently reaches a few more servers in testing.\n- Clear the server list when entering the menu and when refreshing.\n- Create a \"status line\" that displays:\n- When the game is checking for an update or loading the server list from the master server (removed the blue message box)\n- How many servers are available and how many the game is trying to contact.\n- If there are no servers available (no longer displays below the horizontal line)\n- Slide the server list left and right when switching pages.\n- The map command now supports using level titles, whether partial or in full.\n- This feature was previously available in multiple community-created builds.\nInterpolation changes\n- Fix a number of circumstances which could cause the screen to violently vibrate in Software mode.\n- Visual portals, such as in Fakery Way.\n- First-person mode in replays.\n- Player teleports will now adjust camera interpolation as needed.\n- Custom Lua HUDs will no longer flicker with both splitscreen and interpolation.\nChanges for online servers\n- Client timeout has become a little stricter.\n- If a client has fallen so far behind that the server is about to freeze (approximately 8 seconds), assume the lagging player is unlikely to recover and remove them.\n- Reduce the grace period where lagging clients won't get kicked to 10 seconds (from 30).\n- Adjust antigrief.\n- Instead of not running for server or admin, run for ALL players, but only avoid kicking local or admin players.\n- Don't run when there's only one player on the server.\n- Fixes a bug where having a non-interacting splitscreen player could take down your server.\n- Adjust the voting screen again.\n- If kartvoterulechanges is set to Always, the third option is always the opposite gametype, even if Encore is unlocked - that will now be present on the second option instead.\n- This is both for consistancy with having Encore inaccessible on your gamedata, and a response to community feedback.\n- The kartencore cvar being turned on will now be reflected in gametype rule changes from Battle to Race.\n  This plugs one last hole in its area of effect for Race tracks.\n- For -dedicated servers:\n- No longer immediately crash with a SIGFPE on startup.\n- No longer usurped by multiple clients joining on the same tic. (Ashnal)\n- You can now type underscores into the console on Windows, which should make runtime file additions and cvar setting much easier.\n- Enters a less-intensive idle state if no clients are present and no net commands have been issued.\n- We've tried to make it as automatic as possible, and it'll still handle incoming commands, but this feature is relatively experimental.\n  If it gets stuck on something, a simple say hi into the console should be enough to make it all better.\n- Works around the issue where dedicated servers waiting around for too long could crash due to passive netreplay recording.\nChanges for file loading\n- Maximum file and skin counts have been increased. (X.organic)\n- 255 files, including the base resources.\n- 255 characters, including the base five.\n- PK3 loader code has been improved. (X.organic)\n- PK3s created with basically any archiver are now supported.\n- PK3s that contain only \"unimportant\" entries (such as music and HUD graphic replacements) can now be added to a client or server without the other(s) needing that file.\n- Server file loading has been sped up significantly. (X.organic)\n- Some asset setup checks all added files - only do this once when joining a server, rather than once per file.\n- Files containing \"unimportant\" entries get to skip the above asset setup.\n- In-game file downloading has recieved improvements, too.\n- The client can now see whether a given download is direct from the host or over HTTP.\n- If you download a file over http and it doesn't match the server's md5, fall back to direct download.\n- If the direct file downloader fails at the first hurdle, let the would-be joiner know.\nMap changes\n- Finish lines have been adjusted across multiple maps to reduce the likelihood of players missing laps.\n- Bridge skip in Aurora Atoll is finally gone.\n- The fountain in Diamond Square will now kill those unlucky to fall in.\n- Tinkerer's Arena and Dried Battledune now have spring panel effects on their borders to prevent camping.\nMiscellaneous changes\n- A whole heaping of memory mismanagement bugs have been corrected, too numerous to individually note. (X.organic, Ashnal)\n- Notable example: maps that use an Encore executor linedef to change the weather no longer crash.\n  Community map \"Killer Skies\" no longer has a killer sky!\n- Hole punching is more performant, updating internal socket less freqeuntly.\n- Fix an issue where Discord Rich Presence joins during a title demo could short-circuit the client's ticking.\n- Polyobjects that rotate objects on top of them now netsync properly.\n- Seperate x and y deadzones for analog controller inputs. (Lonsfor)\n- Prevent \"Offline\" multiplayer from connecting to the Master Server if advertise on were turned on in that session.\n- Prevent all the join/leave sound effects from stacking super loud during major net interruption or multiple splitscreen player joins.\n- Fix spectators spawning at world origin.\n- Spectator HUD now snaps to the bottom left of the viewport.\n- V-Sync (vid_wait) can now be toggled at runtime.\n- Microsoft Windows:\n  The game now reports itself as \"DPI aware\" - this will mean a less blurry screen on screens with high pixel density, although windowed mode will be consistently smaller; you can change the DPI mode in program properties if you wish to revert this.\n- Microsoft Windows:\n  The game now prioritises the OpenGL backend for Software mode (distinct from the OpenGL renderer), replacing 1.4 and 1.5's use of Direct3D 11 due to a reported performance hit.\n- Codebase:\n  CMake build system has had a number of fixes.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"1.6","site":null,"source":"WinGet","license_or_tos":"GPL-2.0","resources":null,"verified":false}