{"appId":"winget_app_CorsixTH.CorsixTH","appShortcutName":"Winget Application","appDisplayName":"CorsixTH","authorId":"winget","releaseTagName":"winget-0.67","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A reimplementation of the 1997 Bullfrog business sim Theme Hospital. As well as faithfully recreating the original, CorsixTH adds support for modern operating systems (Windows, macOS, Linux and BSD), high resolutions and much more.\n\n\nNew Features/Enhancements\n- The backend code for MIDI playback has been changed on Windows and real pause logic\n- The original demo gameplay video now plays when the CorsixTH main menu is idle (this\n- File browser menus now have an OK button (at last!)\n- Selecting an existing file in the Save Game/Map browsers will now update the text\nChanges\n- Handymen now always stay in their assigned plots, except when going to rest\n- Staff members now have a maximum salary, which can be configured in custom levels\n- The game will now always use the GP's choice of next diagnosis room for the patient,\n- Queueing patients are now shown when hovering a door\n- Epidemics can no longer fail because an infected patient left before the epidemic was\n- Balance changes to drug improvement research\n- Check for updates can now be disabled in Settings\n- Check for updates timeout duration significantly reduced\n- \"Pause\" now shows up when the \"Build while paused\" setting is on and the game is paused.\n- The gamelog file now includes a timestamp\n- Support for detecting Theme Hospital game files from an EA Store install\n- Many, many, refactors of the code to make it better to understand for future developers\n- Contact methods to reach the CorsixTH Team have been updated\nTranslations\n- Chinese Traditional and Simplified translations have been updated.\n  Thanks @lokpro\n- Russian has been updated.\n  Thanks Matt1\nBug Fixes\n- The windows installer was unintentionally defaulting CorsixTH to full screen.\n- Fixed an instance where objects could disappear from the map\n- Fixed a bug where the empty action queue message was prevented from happening\n- Fixed a bug where dying patients became undead and would have a habit of ruining everything\n- Fixed broken dynamic info during epidemics\n- Handymen will no longer try to repair machinery while a patient is using it\n- Psychiatrist couch has less chance of causing blocked paths\n- Roujin's challenge is now properly applied (read: harder)\n- Serious Radiation is no longer contagious\n- Room blueprints can no longer go beyond external walls\n- Fixed incorrect button sounds in the Staff Management window\n- Fixed back button behaviour in Font Picker\n- Fixed a bug where word-wrapping text on dialogs could crash the game\n- Fixed a rare case where the next VIP date may be scheduled in the past\n- Fixed a rare case where awarded research points could be negative\n- Fixed a rare case of the balance sheet being victim of a green highlighter\nPackager Notes\n- Option added to build CLI tools for RNC decoding","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"0.67","site":"https://github.com/CorsixTH/CorsixTH","source":"WinGet","license_or_tos":"MIT License","app_page":"https://github.com/CorsixTH/CorsixTH","resources":null}