{"appId":"winget_app_nzbget.nzbget","appShortcutName":"Winget Application","appDisplayName":"NZBGet","authorId":"winget","releaseTagName":"winget-24.3","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Unsenet downloader\n\n\nWhat's Changed\n- Features:\n    - Disk performance tests for better analysis of user environment performance #375\n    - The STATUS page now displays WriteBuffer and InterDir disk information\n        - the API method status now returns 6 additional properties:\n            - FreeInterDiskSpaceLo (int) - Free disk space on InterDir, in bytes. This field contains the low 32-bits of 64-bit value\n            - FreeInterDiskSpaceHi (int) - Free disk space on InterDir, in bytes. This field contains the high 32-bits of 64-bit value\n            - FreeInterDiskSpaceMB (int) - Free disk space on InterDir, in MiB.\n            - TotalInterDiskSpaceLo (int) - Total disk space on InterDir, in bytes. This field contains the low 32-bits of 64-bit value\n            - TotalInterDiskSpaceHi (int) - Total disk space on InterDir, in bytes. This field contains the high 32-bits of 64-bit value\n            - TotalInterDiskSpaceMB (int) - Total disk space on InterDir, in MiB.\n    - Bits/s units are now also displayed in server speed test results\n- Bug fixes:\n    - Fixed a critical bug related to corrupt downloaded files exceeding 2.6 GB on all x32 POSIX systems using DirectWrite #378\n    - Fixed a potential buffer overflow using getrealpath function #346\n    - Added removal of unnecessary privileges if the nzbget daemon is run as root and an invalid DaemonUsername is specified #345\n- For developers:\n    - Fixed omission in CMAKE_CXX_FLAGS_DEBUG using CLang that caused a wrong debug build #338\n    - Fixed failed unit tests on POSIX systems built without ncurses #376","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"24.3","site":"https://github.com/nzbgetcom","source":"WinGet","license_or_tos":"GPL-2.0","resources":null,"verified":false}