{"appId":"winget_app_Mailbird.Mailbird","appShortcutName":"Winget Application","appDisplayName":"Mailbird","authorId":"winget","releaseTagName":"winget-3.0.23","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://download.getmailbird.com/installers/versions/3_0_23/MailbirdSetup.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A powerful, intuitive, ultra-customizable and dead set on mailing\n\nMailbird is an innovative email client that revitalizes your emailing experience with a modern design and streamlined navigation. It integrates all your communication, collaboration, and productivity apps into one workspace, allowing you to manage your inbox efficiently. With features like sender blocking and inbox categories, it helps you focus on important messages and reduce clutter. Additionally, Mailbird offers a unique email template tool and leverages artificial intelligence to create natural-sounding emails quickly, enhancing your productivity and email management.\nEnhancements\n- Improved the look of Sapling suggestion popup.\n\nFixed Bugs\n- Fixed issue with blocked senders or other filters that move messages from the inbox.\n- Fixed issue with image resizer staying visible when typing.\n- Fixed a rare Mailbird Calendar timezone issue with Google Calendar accounts.\n- Fixed issue with drafts not always saving properly and showing a warning.\n- Fixed rare Google issue with messages returning when being moved to another folder.\n- Fixed freeze and potential lost quick-reply draft when clicking a Sapling link in quick-reply that would open the app.\n- Fixed issue with duplicate phone numbers for contacts synced from Exchange.\n- Fixed 404 redirection issue in ChatGPT app.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"3.0.23","site":"https://www.getmailbird.com/","source":"WinGet","license_or_tos":"Proprietary","app_page":"https://www.getmailbird.com/","resources":null}