{"appId":"winget_app_Typst.Typst","appShortcutName":"Winget Application","appDisplayName":"Typst","authorId":"winget","releaseTagName":"winget-0.12.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A new markup-based typesetting system that is powerful and easy to learn.\n\nTypst is a new markup-based typesetting system that is designed to be as powerful as LaTeX while being much easier to learn and use. Typst has:\n- Built-in markup for the most common formatting tasks\n- Flexible functions for everything else\n- A tightly integrated scripting system\n- Math typesetting, bibliography management, and more\n- Fast compile times thanks to incremental compilation\n- Friendly error messages in case something goes wrong\nHighlights\n- Added support for multi-column floating placement and figures\n- Added support for automatic line numbering (often used in academic papers)\n- Typst's layout engine is now multithreaded. Typical speedups are 2-3x for larger documents. The multithreading operates on page break boundaries, so explicit page breaks are necessary for it to kick in.\n- Paragraph justification was optimized with a new two-pass algorithm. Speedups are larger for shorter paragraphs and go up to 6x.\n- Highly reduced PDF file sizes due to better font subsetting (thanks to @LaurenzV)\n- Emoji are now exported properly in PDF\n- Added initial support for PDF/A. For now, only the PDF/A-2b profile is supported, but more is planned for the future.\n- Added various options for configuring the CLI's environment (fonts, package paths, etc.)\n- Text show rules now match across multiple text elements\n- Block-level equations can now optionally break over multiple pages\n- Fixed a bug where some fonts would not print correctly on professional printers\n- Fixed a long-standing bug which could cause headings to be orphaned at the bottom of the page\nLayout\n- Added support for multi-column floating placement and figures via place.scope and figure.scope. Two-column documents should now prefer set page(columns: 2) over show: column.with(2) (see the page setup guide).\n- Added support for automatic line numbering (often used in academic papers)\n- Added par.spacing property for configuring paragraph spacing. This should now be used instead of show par: set block(spacing: ..) (Breaking change)\n- Block-level elements like lists, grids, and stacks now show themselves as blocks and are thus affected by all block properties (e.g. stroke) rather than just spacing (Breaking change)\n- Added block.sticky property which prevents a page break after a block\n- Added place.flush function which forces all floating figures to be placed before any further content\n- Added skew function\n- Added auto option for page.header and page.footer which results in an automatic header/footer based on the numbering (which was previously inaccessible after a change)\n- Added gap and justify parameters to repeat function\n- Added width and height parameters to the measure function to define the space in which the content should be measured. Especially useful in combination with layout.\n- The height of a block, image, rect, square, ellipse, or circle can now be specified in fractional units\n- The scale function now supports absolute lengths for x, y, factor. This way an element of unknown size can be scaled to a fixed size.\n- The values of block.above and block.below can now be retrieved in context expressions.\n- Increased accuracy of conversions between absolute units (pt, mm, cm, in)\n- Fixed a bug which could cause headings to be orphaned at the bottom of the page\n- Fixed footnotes within breakable blocks appearing on the page where the breakable block ends instead of at the page where the footnote marker is\n- Fixed numbering of nested footnotes and footnotes in floats\n- Fixed empty pages appearing when a context expression wraps whole pages\n- Fixed set block(spacing: x) behaving differently from set block(above: x, below: x)\n- Fixed behavior of rotate and scale with reflow: true\n- Fixed interaction of align(horizon) and v(1fr)\n- Fixed various bugs where floating placement would yield overlapping results\n- Fixed a bug where widow/orphan prevention would unnecessarily move text into the next column\n- Fixed weak spacing not being trimmed at the start and end of lines in a paragraph (only at the start and end of paragraphs)\n- Fixed interaction of weak page break and pagebreak.to\n- Fixed compilation output of a single weak page break\n- Fixed crash when padding by 100%\nText\n- Tuned hyphenation: It is less eager by default and hyphenations close to the edges of words are now discouraged more strongly (May lead to larger layout reflows)\n- New default font: Libertinus Serif. This is the maintained successor to the old default font Linux Libertine. (May lead to smaller reflows)\n- Setting the font to an unavailable family will now result in a warning\n- Implemented a new smart quote algorithm, fixing various bugs where smart quotes weren't all that smart\n- Added text.costs parameter for tweaking various parameters that affect the choices of the layout engine during text layout\n- Added typm highlighting mode for math in raw blocks\n- Added basic i18n for Galician, Catalan, Latin, Icelandic, Hebrew\n- Implemented hyphenation duplication for Czech, Croatian, Lower Sorbian, Polish, Portuguese, Slovak, and Spanish.\n- The smallcaps function is now an element function and can thereby be used in show(-set) rules.\n- The raw.theme parameter can now be set to none to disable highlighting even in the presence of a language tag, and to auto to reset to the default\n- Multiple stylistic sets can now be enabled at once\n- Fixed the Chinese translation for \"Equation\"\n- Fixed that hyphenation could occur outside of words\n- Fixed incorrect layout of bidirectional text in edge cases\n- Fixed layout of paragraphs with explicit trailing whitespace\n- Fixed bugs related to empty paragraphs created via #\"\"\n- Fixed accidental trailing spaces for line breaks immediately preceding an inline equation\n- Fixed text.historical-ligatures not working correctly\n- Fixed accidental repetition of Thai characters around line breaks in some circumstances\n- Fixed smart quotes for Swiss French\n- New font metadata exceptions for Archivo, Kaiti SC, and Kaiti TC\n- Updated bundled New Computer Modern fonts to version 6.0\nMath\n- Block-level equations can now break over multiple pages if enabled via show math.equation: set block(breakable: true).\n- Matrix and vector sizing is now more consistent across different cell contents\n- Added stretch function for manually or automatically stretching characters like arrows or parentheses horizontally or vertically\n- Improved layout of attachments on parenthesized as well as under- or overlined expressions\n- Improved layout of nested attachments resulting from code like #let a0 = $a_0$; $a0^1$\n- Improved layout of primes close to superscripts\n- Improved layout of fractions\n- Typst now makes use of math-specific height-dependent kerning information in some fonts for better attachment layout\n- The floor and ceil functions in math are now callable symbols, such that $ floor(x) = lr(floor.l x floor.r) $\n- The mat.delim, vec.delim, and cases.delim parameters now allow any character that is considered a delimiter or \"fence\" (e.g. |) by Unicode. The delim: \"||\" notation is not supported anymore and should be replaced by delim: bar.double (Minor breaking change)\n- Added vec.align and mat.align parameters\n- Added underparen, overparen, undershell, and overshell\n- Added ~ shorthand for tilde.op in math mode (Minor breaking change)\n- Fixed baseline alignment of equation numbers\n- Fixed positioning of corner brackets (⌜, ⌝, ⌞, ⌟)\n- Fixed baseline of large roots\n- Fixed multiple minor layout bugs with attachments\n- Fixed that alignment points could affect line height in math\n- Fixed that spaces could show up between text and invisible elements like metadata in math\n- Fixed a crash with recursive show rules in math\n- Fixed lr.size not affecting characters enclosed in mid in some cases\n- Fixed resolving of em units in sub- and superscripts\n- Fixed bounding box of inline equations when a text edge is set to \"bounds\"\nIntrospection\n- Implemented a new system by which Typst tracks where elements end up on the pages. This may lead to subtly different behavior in introspections. (Breaking change)\n- Fixed various bugs with wrong counter behavior in complex layout situations, through a new, more principled implementation\n- Counter updates can now be before the first, in between, and after the last page when isolated by weak page breaks. This allows, for instance, updating a counter before the first page header and background.\n- Fixed logical ordering of introspections within footnotes and figures\n- Fixed incorrect here().position() when place was used in a context expression\n- Fixed resolved positions of elements (in particular, headings) whose show rule emits an invisible element (like a state update) before a page break\n- Fixed behavior of stepping a counter at a deeper level than its current state has\n- Fixed citation formatting not working in table headers and a few other places\n- Displaying the footnote counter will now respect the footnote numbering style\nModel\n- Document set rules do not need to be at the very start of the document anymore. The only restriction is that they must not occur inside of layout containers.\n- The spacing property of lists, enumerations, and term lists is now also respected for tight lists\n- Tight lists now only attach (with tighter spacing) to preceding paragraphs, not arbitrary blocks\n- The quote element is now locatable (can be used in queries)\n- The bibliography heading now uses depth instead of level so that its level can still be configured via a show-set rule\n- Added support for more numbering formats: Devanagari, Eastern Arabic, Bengali, and circled numbers\n- Added hanging-indent parameter to heading function to tweak the appearance of multi-line headings and improved default appearance of multi-line headings\n- Improved handling of bidirectional text in outline entry\n- Fixed document set rules being ignored in an otherwise empty document\n- Fixed document set rules not being usable in context expressions\n- Fixed bad interaction between set document and set page\n- Fixed show figure: set align(..). Since the default figure alignment is now a show-set rule, it is not revoked by show figure: it => it.body anymore. (Minor breaking change)\n- Fixed numbering of footnote references\n- Fixed spacing after bibliography heading\nBibliography","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"0.12.0","site":"https://typst.app/","source":"Typst GmbH","license_or_tos":"Apache-2.0","resources":null,"verified":false}