{"appId":"winget_app_BinaryFortress.DisplayFusion","appShortcutName":"Winget Application","appDisplayName":"DisplayFusion","authorId":"winget","releaseTagName":"winget-11.0.3.0","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://binaryfortressdownloads.com/Download/BFSFiles/101/DisplayFusionSetup-11.0.3.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"DisplayFusion will make your multi-monitor life much easier! With powerful features like Multi-Monitor Taskbars, TitleBar Buttons and fully customizable HotKeys, DisplayFusion will make managing your multiple monitors easy.\n\n\n- Fix: Network tray icon no longer cut off on 125% monitor scaling\n- Fix: SubEdit now shows up in Alt+Tab handler\n- Fix: Resolved an issue with applications not maximizing to monitor splits in some cases\n- Fix: Resolved an issue where monitor config would revert after exiting a full screen game\n- Fix: LibreOffice now maximizes to splits\n- Fix: LibreOffice now works with middle-click moving\n- Fix: Resolved an issue with launching new instances of already running Firefox processes\n- Fix: Resolved an issue where sometimes the wallpaper wouldn't auto-fix when it should\n- Fix: DisplayFusion taskbar no longer moves above the monitor fading overlay\n- Fix: Resolved an issue where some custom taskbar button icons were bad quality\n- Fix: Resolved an async issue in scripting\n- Fix: Mirror Windows can now be maximized again by double-clicking\n- Fix: Move Window to Different Monitor dialog accepts number input again\n- Fix: Taskbar shortcuts that run explorer.exe shell::: params work again\n- Fix: OBS can now be launched from a DisplayFusion taskbar shortcut","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"11.0.3.0","site":"https://www.binaryfortress.com/","source":"Binary Fortress Software","license_or_tos":"Proprietary","resources":null,"verified":false}