{"appId":"winget_app_AntibodySoftware.WizTree","appShortcutName":"Winget Application","appDisplayName":"WizTree","authorId":"winget","releaseTagName":"winget-4.21","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://diskanalyzer.com/files/wiztree_4_21_setup.exe"}},"install":{"win32":{"assetId":1,"exec":null,"installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"WizTree is a hard drive disk space analyser similar to WinDirStat but is MUCH faster.\n\n\n- Improved threading when in non Admin mode and when scanning non NTFS drives/network drives/folders, resulting in more than 4x faster scanning of SSD drives\n- Reserved Space is now displayed for NTFS volumes. This is space reserved for the Windows operating system and can be quite significant for drives with Windows installed. It also accounts for most of the difference between the total allocated space calculated by WizTree and the \"space used\" reported by Windows. The remaining difference is made up of other NTFS file system data (such as directory indexes) which do not appear in the WizTree scan results.\n- File grouping size can now be set via Options->Tweaks->File group minimum size\n- MTP/PTP device support updated (MTP/PTP devices are things like mobile phones or digital cameras):\n  - Context menu issues with MTP/PTP devices fixed\n  - Copy/Cut now working correctly with MTP/PTP devices\n- Improved tree loading speed and treemap rendering for drives containing very large numbers of files\n- Fixed context menu issues when running on Windows XP (\"Send to\" not working, missing text in sub menus)\n- Export to CSV would not export anything when \"File view\" selected and no files selected - now exports all files on the list.\n- Context menu issues with very long file names fixed\n- Improved detection of newly inserted USB drives\n- Added \"Expand All\" (Shift+F4) option to File menu - will expand all tree nodes. Press F4 to reset the expansion\n- Portable version now defaults to starting in non admin mode. Enable \"Options->Always run as Administrator\" to have WiaTree always start in Admin mode\n- Fixed issue with config ini file settings not being read correctly when containing BOM marker (added by some text editors)","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"4.21","site":"https://antibody-software.com/","source":"WinGet","license_or_tos":"Proprietary","resources":null,"verified":false}