{"appId":"winget_app_Evernote.Evernote","appShortcutName":"Winget Application","appDisplayName":"Evernote","authorId":"winget","releaseTagName":"winget-10.111.2","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://win.desktop.evernote.com/builds/Evernote-10.111.2-win-ddl-stage-20241014151905-21ac0214b37373529b1142cea983df806d263eed-setup.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Remember everything and tackle any project with your notes, tasks, and schedule all in one place.\n\nEvernote helps you focus on what matters most and have access to your information when you need it. Input typed notes or scan handwritten notes. Add to-do’s, photos, images, web pages, or audio ... and it’s all instantly searchable. Organize notes any way you want and share with anyone. And Evernote syncs across your devices so your information is always with you, everywhere you go.\nFixes:\n- Fixes an issue where dragging and dropping a PDF into a Notebook was causing an error.\n- Repaired a problem with the color picker not showing options if navigating to note straight after login.\n- Fixed an issue where the account menu would close unexpectedly when navigating its items in focus mode.\n\nNew Features:\n- Introduced the ability to maintain individual sorting preferences within each Notebook.\n- You can now enjoy easy sharing with our new one-click sharing feature.\n- Optimized the sidebar to save valuable vertical space. You can now access keyboard shortcuts and the Help Center directly from the account menu.\n- Reduced the minimum width for table cells with attachment components, giving you more flexible layouts.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"10.111.2","site":"https://evernote.com/","source":"WinGet","license_or_tos":"Proprietary","resources":null,"verified":false}