{"appId":"winget_app_OramaInteractive.Pixelorama","appShortcutName":"Winget Application","appDisplayName":"Pixelorama","authorId":"winget","releaseTagName":"winget-1.0.3","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/Orama-Interactive/Pixelorama/releases/download/v1.0.3/Pixelorama-Windows-64bit.zip"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Unleash your creativity with Pixelorama, a powerful and accessible open-source pixel art multitool.\n\nUnleash your creativity with Pixelorama, a powerful and accessible open-source pixel art multitool. Whether you want to create sprites, tiles, animations, or just express yourself in the language of pixel art, this software will realize your pixel-perfect dreams with a vast toolbox of features.\n[v1.0.3] - 2024-09-13\nThis update has been brought to you by the contributions of:\nFayez Akhtar (@Variable-ind), alikin12, Vaibhav Kubre (@kubre), Donte (@donte5405)Built using Godot 4.3Added\n- Added new global layer buttons that change visibility, lock or expand all layers on the first level. #1085\n- Added a new Gaussian blur image and layer effect.\n- A new Index Map layer effect has been added. #1093\n- Is it now possible to adjust the opacity of onion skinning. #1091\n- Added option to trim the empty area of the exported images. #1088\n- A quality slider has been added to the export dialog, when exporting jpg files.\nChanged\n- The layer opacity and frame buttons are now fixed on top, always visible regardless of the vertical scroll position. #1095\n- The default blend mode of layer groups is now pass-through.\n- The color picker popup when editing gradients is now moveable.\nFixed\n- Fixed an issue where the '\\n` escape character got inserted inside the palette name, causing the palette to fail to be saved.\n- The export dialog has been optimized by caching all of the blended frames. Changing export options, besides the layers, no longer cause slowness by re-blending all of the frames.\n- Optimized the lasso and polygon select tools, as well as the fill options of the pencil and curve tools. The time they take to complete now depends on the size of the selection, rather than checking all of the pixels of the entire canvas.\n- Fixed a crash when re-arranging palette swatches while holding Shift.\n- Fixed a crash when using the move tool snapped to the grid.\n- Fixed wrong preview in the gradient dialog when editing the gradient and dithering is enabled.\n- Fixed a visual bug with the preview of the resize canvas dialog.\n- Fixed wrong stretch mode in the cel button previews. #1097","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"1.0.3","site":"https://www.oramainteractive.com/","source":"WinGet","license_or_tos":"MIT","app_page":"https://orama-interactive.itch.io/pixelorama","resources":null}