{"appId":"winget_app_Zettlr.Zettlr","appShortcutName":"Winget Application","appDisplayName":"Zettlr","authorId":"winget","releaseTagName":"winget-3.2.2","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/microsoft/winget-pkgs/releases/download/winget-3.2.2/"},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/microsoft/winget-pkgs/releases/download/winget-3.2.2/"}},"install":{"win32":{"assetId":1,"exec":null,"installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A Markdown Editor for the 21st century.\n\nZettlr is a supercharged markdown editor that combines many writing editor features and collect them in one application.\nIt aims at speeding up your workflow and help you write without any interruptions.\nThis update focuses mainly on cosmetic fixes that pertain to the main editor and the display of your texts. However, it also includes a few bug fixes and other improvements.\nDo you enjoy Zettlr? Then consider donating to help pay for server and certificate costs. You can donate monthly on Patreon or once via PayPal. Thanks for your support!\nChangelog\nChanges to Pandoc Profiles\nThis update fixes a workaround that Zettlr had in place for a shortcoming of Pandoc regarding the automatic numbering of headings. This workaround is no longer necessary, since Pandoc has since fixed the issue.\nZettlr now ships with changed default profiles for various export formats. Since Zettlr never overwrites any data, the new defaults will not be applied automatically. You can apply the change manually by removing the following line from the default profiles: shift-heading-level-by: 1.\nGUI and Functionality\n- change: Remove shift-heading-level-by: 1 line from default profiles\n- Fixed the \"Paste as Plain\" menu item not working (#5052)\n- Dark mode folded header's ellipsis are now properly colored (#5284)\n- Add Pascal syntax highlighting (keyword: pascal; #5368)\n- Fixed images in file previews on hovering internal file links not working (#5041)\n- Fixed the tag search from the tag cloud popover (#5124)\n- Fixed visual artifacts in the backgrounds for code blocks and comments (#5260)\n- Fixed a bug that would apply certain shortcuts to all open editor panes, rather than the last focused one (#5282)\n- The save changes dialog now offers a cancel option that will be chosen when pressing Escape (#5338)\n- Updated translation for es-ES (#5372)\n- Fixed the main editor search panel overlaying popovers/flyouts (#5397)\n- Fixed the highlighting, which now retains any syntax highlighting (and thus functions like interacting with links) between the markers (==highlight==) as well as enabling spell checking of highlighted ranges\n- Fixed an issue preventing pasting of images into the editor (#5386)\n- Fixed the maximum height of the image preview in the paste-image dialog to 50% in order to prevent it from pushing the controls out of view\n- Fixed the code and citation background colors in the Bordeaux dark theme\nUnder the Hood\n- Images across the application now have a max-width: 100% applied to them to ensure they never overflow their parent container.\n- The md2html utility function now allows a fourth parameter containing hooks that allow the further customization of the produced HTML output\n- Bumped CodeMirror and dependencies\n- Bumped ESLint and dependencies\n- Fixed HTML DOM structure in a few places where they would violate the spec\nNew Contributors\n- @victorelec14 made their first contribution in https://github.com/Zettlr/Zettlr/pull/5372\n- @TeaDrinkingProgrammer made their first contribution in https://github.com/Zettlr/Zettlr/pull/5073\n- @K0Stek122 made their first contribution in https://github.com/Zettlr/Zettlr/pull/5284\nFull Changelog: https://github.com/Zettlr/Zettlr/compare/v3.2.1...v3.2.2","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"3.2.2","site":"https://github.com/Zettlr/Zettlr","source":"WinGet","license_or_tos":"GPL-3.0","app_page":"https://github.com/Zettlr/Zettlr","resources":null}