{"appId":"winget_app_Emurasoft.EmEditor","appShortcutName":"Winget Application","appDisplayName":"EmEditor","authorId":"winget","releaseTagName":"winget-24.4.0","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/microsoft/winget-pkgs/releases/download/winget-24.4.0/"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/microsoft/winget-pkgs/releases/download/winget-24.4.0/"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A fast, lightweight, yet extensible, easy-to-use text editor, code editor, CSV editor, and large file viewer for Windows.\n\n\nToday, we are excited to announce the release of EmEditor v24.4.0.\nThe main feature of the latest version (v24.4) is improved Markdown support, introduced in response to customer feedback (1, 2). It includes the new Markdown Design View that offers a near-WYSIWYG experience.\nIntroduced a Markdown design view that offers a near-WYSIWYG experience for editing Markdown files.\nMarkdown, introduced by John Gruber, is widely used across various platforms due to its simple text formatting capabilities for paragraphs, links, and images. Documents in Markdown are easily readable even in basic text editors like Notepad, making it popular for blogs, StackOverflow, Wikipedia, and academic papers. Recently, it’s also been used in AI-generated responses. The enhanced Markdown support aims to improve the display of AI prompt responses, a feature introduced in the previous version (v24.3).\nA Markdown Design View button has been added to the main toolbar, allowing you to toggle the Design View on or off. When you select the Markdown configuration, opening associated files will automatically enable the Design View. This view is also applied to documents created using the AI prompt feature. You can adjust these settings on the new Markdown page in the Customize dialog.\nAdded the Markdown Design View button to the default Basic toolbar.\nSwitching to the Design View displays the Markdown toolbar. By clicking the Markdown Preview button, you can view a preview of the Markdown using the WebPreview plugin.\nAdded the Markdown toolbar.\nHere are some key differences between Markdown Preview and Design View:\n- You can edit in Design View, but not in Preview.\n- Images appear in Preview, while they’re represented as emojis (🖼) in Design View.\n- Line breaks in the source text may not be preserved in Preview, but they always appear as line breaks in Design View. Hard line breaks in the source text are marked with emojis (⏎) in Design View.\n- If table headers are missing in the source text, they are hidden in Preview but shown as empty headers in Design View and can be edited.\n- Code and regular text are displayed in different fonts in Preview, but in the same font with different colors in Design View.\n- Specified languages in fenced code blocks are highlighted in Design View according to the language configuration.\n- HTML tags, character references, and numeric character references in the source text are displayed correctly in the Preview, but they do not appear in the Design View.\n- Heading lines are displayed in the correct font size in the Preview, but in the Design View, they are always shown in the same font size if DirectWrite is not used. By default, the settings use DirectWrite, so this should not be an issue.\nGiven these differences, it’s advisable not to rely solely on EmEditor’s Design View. Instead, check your work in Preview or an external web browser during editing.\nYou can change block styles using the dropdown menu on the Markdown toolbar, like Paragraph, Heading 1, Heading 2, etc. You can also format text with buttons like Bold, Italic, Code, etc. These buttons behave differently depending on whether text is selected or already formatted. For example, clicking Bold without selecting text will bold the entire word at the cursor. If the text at the cursor is already formatted differently, only that text will be bolded. Clicking Bold with text selected toggles the bold formatting. Other buttons allow you to create/insert links, images, tables, horizontal lines, line breaks, numbered lists, bullet lists, etc. These commands are also accessible from the Markdown submenu of the Edit menu, with Ctrl+B as the shortcut for Bold.\nThere’s still room for improvement in the current Markdown Design View. Some users might notice discrepancies between Design View and Preview. For complex edits, Design View might not be ideal. For instance, adding characters at the start of a heading could change it to a regular paragraph. In such cases, it’s better to disable Design View for editing. It’s also quicker to edit source text directly when changing image or hyperlink paths and titles. However, EmEditor isn’t meant to be a full-fledged Markdown editor. Markdown’s strength lies in its readability, even in plain text. We hope you get comfortable toggling Design View on and off as needed.\nFor parsing Markdown syntax, a modified version of MD4C (Markdown parser for C) by Martin Mitáš is used. MD4C follows CommonMark, which EmEditor also uses as a reference. However, EmEditor supports tables not specified in CommonMark.\nThe new version (v24.4) also includes several other features, many based on user requests:\n- The display of differing lines in comparison results has been enhanced; similar lines previously grouped as added lines are now shown as changed lines.\n- The Copy All to Other command now closes the source document.\n- Onigmo.Perl has been added to the list of regular expression engines, with Onigmo now called Onigmo.Ruby.\n- The Find/Replace dialog’s multi-line boxes now support automatic line wrapping.\n- Menus hidden when the window width is reduced can now be accessed via keyboard shortcuts. For example, the Macros menu, accessible with Alt+M, is usable even in a small window.\n- The /ola command line option has been added, allowing offline licenses to be saved for the entire computer with admin privileges.\n- Bugs found during the preview version development have been fixed.\nWe hope you enjoy using EmEditor, whether you choose the Professional or Free version. Please contact us or write in our forums if you have any questions, feature requests, or suggestions.\nThank you for using EmEditor!\n— Yutaka Emura\nCheck out the EmEditor v24.4 New Features for more details and screenshots.\nIf you use the Desktop Installer version, you can select Check for Updates from the Help menu to download the latest version. If this method fails, please download the latest version, and run the downloaded installer. If you use the Desktop portable version, you can go to the Download page to get the latest version. Store App versions can be updated through the Microsoft Store (64-bit or 32-bit) after a few days.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"24.4.0","site":"https://www.emeditor.com/","source":"WinGet","license_or_tos":"Proprietary","app_page":"https://www.emeditor.com/","resources":null}