{"appId":"winget_app_KDE.RKWard","appShortcutName":"Winget Application","appDisplayName":"RKWard","authorId":"winget","releaseTagName":"winget-0.8.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://download.kde.org/stable/rkward/0.8.0/rkward-0.8.0-x86_64.exe"}},"install":{"win32":{"assetId":1,"exec":null,"installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"RKWard is an easy to use and easily extensible IDE/GUI for R.\n\nRKWard is an easy to use and easily extensible IDE/GUI for R. It aims to combine the power of the R-language with the ease of use of commercial statistics tools.\n\nRKWard’s features include:\n- Spreadsheet-like data editor\n- Syntax highlighting, code folding and code completion\n- Data import (e.g. SPSS, Stata and CSV)\n- Plot preview and browsable history\n- R package management\n- Workspace browser\n- GUI dialogs for all kinds of statistics and plots\n\nRKWard’s features can be extended by plugins, and it’s all free software.\n- Fixed: Crash when trying to edit a data.frame containing columns that are not vectors\n- Fixed: Basic statistics would refuse to \"overwrite file\", even if saving to file was unchecked\n- Changed: Status indicator for preview windows (updating/ready) is less obstrusive\n- Added: Ability to open PDF documents inside the RKWard window, and associated R function rk.show.pdf()\n- Fixed: Add breeze icons as a fallback on systems that use a different icon theme (fixes missing icons)\n- Added: Setup dialog includes setting to select a different R installation\n- Added: Command line option \"--setup\" to force (re-)initialization as if a new version of RKWard had been installed\n- Fixed: R functions loadhistory(), savehistory(), and timestamp() broken\n- Changed: R shared library is now loaded, dynamically, rather than linked at compile time.\n           This allows more flexibility on which R version to use at runtime, esp. in the context of AppImage binaries\n- Fixed: References to the package cairoDevice (removed on CRAN) have been replaced with Cairo\n- Fixed: Creating new output window from the UI would sometimes show empty window\n- Fixed: Better support for running from non-standard paths on Linux (e.g. user-local installation in home dir)\n- Fixed: Added REUSE license information where missing\n- Fixed: Handling of carriage returns in R Console window (used in progress bars, importantly)\n- Fixed: Crash when renaming top level object from context menu\n- Changed: First version to be based on Qt6/KF6","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"0.8.0","site":"https://kde.org/","source":"KDE e.V.","license_or_tos":"GPL-2.0-or-later","resources":null,"verified":false}