{"appId":"winget_app_Logitech.LogiTune","appShortcutName":"Winget Application","appDisplayName":"Logi Tune","authorId":"winget","releaseTagName":"winget-3.7.187.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://software.vc.logitech.com/downloads/tune/LogiTuneInstall.exe"}},"install":{"win32":{"assetId":1,"exec":null,"installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Get more out of your headsets and webcams, and book your spaces for better days in the office.\n\nTake charge of your workplace experience wherever you are — at home, in the office or on the go. Webcam and headset settings are all at your fingertips to ensure you look and sound the way you want in video meetings.\n\nIn addition, if your organization uses Logitech room and desk booking, you can easily find the right space, with the right tools at the right time and with the right people for better days in the office.\nFeatures\n- Introducing Mice and Keyboard Settings!\n  - You can now configure your Logitech keyboards and mice with an initial set of settings.\n    - Note: If Options+ is installed, mice and keyboard settings won't be visible in Tune.\n\nImprovements\n- You can now manage common settings for non-Logitech webcams, centralizing control of all your devices in one place.\n- We've enhanced the webcam positioning control. After zooming in, you can simply click and drag to fine-tune your webcam video feed quickly.\n- Meeting provider icons are now shown on agenda items and meeting notifications if the event has a video conferencing link. This allows you to quickly see what provider is being used before jumping into the meeting.\n- Logitech Desk Booking:\n  - Booking a desk in a different time zone is now simpler. Your desk booking will now reflect the time zone of the building in which it's located.\n  - When another date is selected, the current date will be highlighted in purple, making it easier to identify.\n  - Your profile image will now be shown in the top right corner of the app instead of the default profile image.\n  - When viewing your organization's people list, your already-added teammates will be highlighted. This makes it easy to identify who's already your teammate.\n\nBugs\n- Fixed an issue where teammate names could show incorrectly.\n- Fixed an issue where Logi Tune may not show up correctly when using a second monitor.\n- Fixed an issue where a desk's booked state may not correctly update.\n- General bug fixes.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"3.7.187.0","site":"https://www.logitech.com/","source":"WinGet","license_or_tos":"Proprietary","resources":null,"verified":false}