{"appId":"winget_app_Robware.RVTools","appShortcutName":"Winget Application","appDisplayName":"RVTools","authorId":"winget","releaseTagName":"winget-4.6.1","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://resources.robware.net/resources/prod/RVTools4.6.1.msi"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"RVTools is a Windows .NET (4.6.2 or higher) application which uses VMware vSphere Management SDK 8.0 and CIS REST API to display information about your virtual environments.\n\nRVTools is a Windows .NET (4.6.2 or higher) application which uses VMware vSphere Management SDK 8.0 and CIS REST API to display information about your virtual environments. Interacting with VirtualCenter 5.x, ESX Server 5.x, VirtualCenter 6.x, ESX Server 6.x, VirtualCenter 7.0, ESX server 7.0, VirtualCenter 8.0 and ESX server 8.0. RVTools is able to list information about VMs, CPU, Memory, Disks, Partitions, Network, CD drives, USB devices. Snapshots, VMware tools, vCenter server, Resource pools, Clusters, ESX hosts, HBAs, Nics, Switches, Ports, Distributed Switches, Distributed Ports, Service consoles, VM Kernels, Datastores, multipath info, license info and health checks.\nFIXED:\n- Issue requiring working directory to be set to RVTools installation directory when using command line scripting.\n- Issue occurring when a leading or trailing space was included as a result of copying/pasting Hostname or Username.\n- Condition where background errors prevented RVTools from completing successfully in a non-interactive mode as a scheduled job.\n- Error logging is now enabled by default to facilitate faster troubleshooting. Manually changing to debug level will now only be requested for situations requiring more detailed troubleshooting information. NOTE: Default location of log files has been moved to the user's AppData/Local/RVTools folder.\n- Issue with values containing double quotes corrupting csv files.\n\nADDED:\n- Optional Product Improvement Program to gather minimal anonymous telemetry data for use in optimizing the user interface and effectiveness of RVTools. See additional information on RVTools website About page.\n- On vHost tab page new columns: Compliance Check State, Domain List, Memory Tiering Type.\n- On vHost tab page new Certificate columns: Certificate Issuer, Certificate Start, Certificate Expiry, Certificate Status, Certificate Subject.\n- On vInfo tab page new columns: Suspended To Memory, Suspend Interval.\n- On vInfo tab page new columns: Overall Cpu Readiness, Active Memory, Fixed Passthru Hot Plug, Op Notification Timeout, VM Failover In Progress.\n- On vInfo tab page new Customization Info column.\n- On vInfo tab page new Guest Detailed Data column which includes - architecture, bitness, buildNumber, cpeString, distroName, distroVersion, familyName, kernelVersion, prettyName.\n- On vHealth tab page: Added warning “Certificate within XX days of expiring or has expired.” (configurable XX days).\n- Health Properties: New checkbox to enable/disable certificate expiration warning and configure desired timeframe. (default = 90 days).\n\nUPDATED:\n- Upgraded RVTools solution to use VMware vSphere Management SDK 8u2.\n- Deserialize error section to include example PowerShell script for identifying VMs causing error, and instructions on using sample script (now also provided in installer).\n- Product Documentation for new columns.\n- Product Documentation to include recommended steps to run RVTools with Windows scheduler to avoid password encryption issues.\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"4.6.1","site":"https://www.robware.net/home","source":"Dell","license_or_tos":"Freeware","resources":null,"verified":false}