{"appId":"winget_app_Cisco.Webex","appShortcutName":"Winget Application","appDisplayName":"Webex","authorId":"winget","releaseTagName":"winget-44.10.0.30906","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/microsoft/winget-pkgs/releases/download/winget-44.10.0.30906/"},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/microsoft/winget-pkgs/releases/download/winget-44.10.0.30906/"}},"install":{"win32":{"assetId":1,"exec":null,"installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"With industry leading video conferencing, calling, and contact center solutions, Webex fuels hybrid work for businesses of all sizes.\n\nCisco Webex is an app for continuous teamwork. Move work forward in secure work spaces where everyone can contribute anytime with messaging, file sharing, white boarding, video meetings, calling, and more. It works on virtually any device, with these top benefits for mobile app users:\n- Streamline Teamwork: One place for all the tools that help you do your job better and faster. Create spaces for you and another person or for a group working on a project.\n- Make Better Decisions: Start and join meetings instantly. See everyone with an amazing HD video experience. Share your screen. Keep teamwork going in the connected work space.\n- Stay Informed About All Your Work: Select from our growing catalog of integrations and bots to keep up to date with what's happening in other apps such as Box and Salesforce\n- Find Anything Fast: Search for people, messages, and files across all your spaces - no need to switch accounts or views\n- Bring The Experience Into Meeting Rooms: Pair your app to a Webex device, such as the Webex Board, to do things like wirelessly control meetings and save whiteboard drawings\n- Work Securely: Built for business collaboration with end-to-end encryption\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"44.10.0.30906","site":"https://www.webex.com/","source":"WinGet","license_or_tos":"Proprietary","app_page":"https://www.webex.com/downloads.html","resources":null}