{"appId":"winget_app_Sonosaurus.SonoBus","appShortcutName":"Winget Application","appDisplayName":"SonoBus","authorId":"winget","releaseTagName":"winget-1.7.2","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/microsoft/winget-pkgs/releases/download/winget-1.7.2/"},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/microsoft/winget-pkgs/releases/download/winget-1.7.2/"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"SonoBus is an easy to use application for streaming high-quality, low-latency peer-to-peer audio between devices over the internet or a local network.\n\n\n- Made the use of the universal font optional (defaulting to off), because it was causing slowdowns on some systems.\n  Only enable it if you need to have universal language character support.\n- Added dedicated button on main window for getting to VDO.\n  Ninja group video link (for those who didn't even know it was there!)\n- Fixed VDO.\n  Ninja link generator, Open in browser now operates properly (which it never did)\n- Fixed font size issue on Windows\n- Other minor fixes\n- Added \"Suggest New Group\" feature.\n  From the group popup (the button just below Connect showing group info) a new item was added that lets you pick who from the currently connected group you would like to join you in a new group, makes the request and connects you to the new group.\n  If the others accept they will immediately connect to the new group with you.\n  This feature can be used in the situation where you are in a public group, but would like to continue to play/talk with a subset of them in a new private (or public) group, with the least amount of effort.\n- Added Reset All Jitter Buffer button (near the bottom next to FX) with keybinding (cmd/ctrl-J)\n- Added additional features to the VDO.\n  Ninja link generator, allowing you to create links for both webcam and screenshare usage, which you can use at the same time in multiple browser windows/tabs.\n  Also, an option was added to generate the link so that your content is only pushed, viewing no one... which can be handy if you are using both webcam and screenshare at the same time, and pick one to not view anyone.\n- Added LV2 plugin for Linux (could be other platforms too if people request it)\n- Added Soundboard volume control and send-to-group controls at the bottom of the Soundboard\n- The used font now supports all translated languages, so you can use Chinese, Japanese, or Korean text in names or chat messages, even if the app isn't set for that language.\n  It has fewer other symbols, however.\n- Added an option (and made it the default to on) to make the Mute controls in the Input Mixer and the overall input mute at the top be respected when recording yourself.\n  Before the self-recordings would include the input even though they were muted.\n  You can get back to the old way with a new option in the recording options.\n- Fixed drag and drop of files onto Soundboard\n- Fixed user scrolling area size issue\n- Fixed occasional crash on record","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"1.7.2","site":null,"source":"WinGet","license_or_tos":"GPL3","app_page":"https://github.com/sonosaurus/sonobus","resources":null}