{"appId":"winget_app_LoftLabs.DevPod","appShortcutName":"Winget Application","appDisplayName":"DevPod","authorId":"winget","releaseTagName":"winget-0.6.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/loft-sh/devpod/releases/download/v0.6.0/DevPod_windows_x64_en-US.msi"}},"install":{"win32":{"assetId":1,"exec":null,"installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"DevPod is a tool used to create reproducible developer environments. Each developer environment runs in a separate container and is specified through a devcontainer.json.\n\nDevPod is a tool used to create reproducible developer environments.\nEach developer environment runs in a separate container and is specified through a devcontainer.json.\nDevPod providers can create these containers on the local computer, any reachable remote machine, or in a public or private cloud.\nIt's also possible to extend DevPod and write your own custom providers.\nv0.6.0 - IDEs, Docs and Tauri v2\nIt’s been quite a while since we’ve last released a new minor release, in fact it’s been almost a year since the release of 0.5.0 at January 30th. We’ve worked on tons of fixes and small improvements ever since and will continue to work hard to support your workflow with devcontainers.Before we go into new features we want to take a moment to thank everyone using DevPod and specially the people reporting problems in the GitHub Issues and our Slack community. Without your curiosity, engagement and feedback DevPod would not be possible.Thank you!More IDEs\nEveryone has their favourite way of working and we want to enable as many people as possible to take advantage of devcontainers by bringing them to their existing workflow. For this reason we’ve added 6 new experimental IDEs (and a stable one) to choose from:\n1. Cursor - a highly requested, AI first editor\n2. Zed - one of the coolest new IDE projects we’ve come across, from the creators of Atom and Treesitter\n3. VSCodium - community supported FOSS distribution of VSCode without Microsoft licenses\n4. Positron - a next generation data science IDE from the makers of R Studio. They currently don’t publish ARM builds so make sure your provider target architecture is x86-64\n5. Marimo - modern, reactive python notebooks you can fearlessly check into git\n6. Jupyter Desktop - this is just a little bonus on top for everyone who prefers Desktop apps over pure web applications. We surely are fans of it and encourage you to try it as well\n7. Dataspell - extending our support of the full JetBrains suite of products\n“How it works” documentation\nDevelopers are curious by nature and want to know how their tools work - we do, too! This is why @bkneis took the time to write a dedicated architecture section in the docs: https://devpod.sh/docs/how-it-works/overviewLet us know if this is helpful and what you’re missing from the overall picture.Experimental per-user installer for Windows\nNot everybody has admin permissions on their machine and DevPod is especially useful in these situations to help you escape into your safe devcontainer space where you can install python packages to your hearts content.Unless you have a good relationship with your IT department installing DevPod on locked down Windows machines was a pain so far. With this version we’re adding experimental (!) support for a per-user installer: https://github.com/loft-sh/devpod/releases/download/v0.6.0/DevPod_0.6.0_x64-setup.exeA word of caution though: Auto updates currently don’t work with this installer because we need. to change the upgrade process to support MSI and NSIS based installations side by side.More Linux installers (?)\nWe’ve upgraded DevPod Desktop to Tauri v2, a secure, rust based electron alternative.They’ve worked hard to support more ways of distributing desktop apps on Linux and we intend to take advantage of this. Tell us your favourite way of installing packages on Linux in the GitHub issues (…but check for duplicates first please).New Contributors\n- @PRTTMPRPHT made their first contribution in #1378\nFull Changelog: https://github.com/loft-sh/devpod/compare/v0.5.22...v0.6.0","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"0.6.0","site":"https://devpod.sh/","source":"Loft Labs, Inc.","license_or_tos":"MPL-2.0","resources":null,"verified":false}