{"appId":"winget_app_GDevelop.GDevelop","appShortcutName":"Winget Application","appDisplayName":"GDevelop","authorId":"winget","releaseTagName":"winget-5.4.217","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/4ian/GDevelop/releases/download/v5.4.217/GDevelop-5-Setup-5.4.217.exe"}},"install":{"win32":{"assetId":1,"exec":null,"installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"The fastest, easiest, most powerful no-code game engine.\n\nGDevelop is a free, open-source game engine that's 10x easier and faster to use than anything else. Build from anywhere — even on your phone. Publish everywhere: iOS, Android, Steam, web, gaming platforms. Reach millions of players or create the next hit game you've been dreaming of.\n💝 Improvements\n- Allow custom objects to use leaderboard properties in order to build custom objects linked to leaderboards\n- Optimize custom object layouting in the editor\n- Display Audio Resource parameter field for function actions\n- Display context menu using an \"action sheet\" like drawer on mobile/touchscreens\n- Add larger buttons in quick customization and danger buttons in some interfaces\n🐛 Bug fixes\n- Fix to forbid behavior properties from being used as values in expressions\n- Fix autocompletion by hiding parameters and properties of type \"behavior\"\n- Fix default parameter of action with operator functions not displaying in the editor\n- Fix text input visibility when its custom object is hidden\n- Fix a crash when an instance with a wrong object name is in a custom object\n- Fix wrong custom objects duplication when updating an extension\n- Fix resource used in behavior properties not being exported\n- Fix changing the shape painter colors in the properties panel/object editor\n- Fix cloud projects incorrectly counted when saving a project\n🎨 Assets\nPremium packs\nBy @Bouh:\n- [New audio pack] Basic RPG Sounds and SFX\nBy GDevelop:\n- [New audio pack] SFX Platformer Mario Game Like\nFree assets\nMultiple tilemaps objects were added:\n- 10 by Kenney\n- 1 from VEXED\n- 1 from Robert Norenberg (0x72)\n🕹 Examples\n- Fix spine example missing sound resource\n🛠 Internal changes (for developers)\n- Ensure GDevelop.js build is done using release mode if not specified\n- Fix resource used in behavior properties not being exported","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"5.4.217","site":"http://www.florianrival.com/","source":"WinGet","license_or_tos":"MIT","resources":null,"verified":false}