{"appId":"winget_app_Nvidia.GeForceExperience","appShortcutName":"Winget Application","appDisplayName":"NVIDIA GeForce Experience","authorId":"winget","releaseTagName":"winget-3.28.0.417","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/microsoft/winget-pkgs/releases/download/winget-3.28.0.417/"},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/microsoft/winget-pkgs/releases/download/winget-3.28.0.417/"}},"install":{"win32":{"assetId":1,"exec":null,"installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"GeForce Experience is the companion application to your GeForce graphics card.\n\nCapture and share videos, screenshots, and livestreams with friends.\nKeep your drivers up to date and optimize your game settings.\nGeForce Experience™ lets you do it all, making it the super essential companion to your GeForce® graphics card or laptop.\nOptimal settings support added for 122 new games including:\nAdded for 122 new games including: Abiotic Factor, Age Of Wonders 4, Alan Wake 2, Aliens: Dark Descent, Apocalypse Party, ARK: Survival Ascended, ARMORED CORE VI FIRES OF RUBICON, Ash Echoes, Assassin's Creed Mirage, Atlas Fallen, Atomic Heart, Avatar: Frontiers of Pandora, BattleBit Remastered, Bellwright, Big Ambitions, Boundary, Call of Duty: Modern Warfare III, Cities: Skylines 2, Company of Heroes 3, Content Warning, Counter-Strike 2, Crime Boss: Rockay City, Dead Space, Desynced, Diablo IV, Dragon's Dogma 2, Dragon's Dogma 2 Dual Universe, EA SPORTS FC 24, Enshrouded, Escape from Tarkov: Arena, Exoprimal, F1 23, F1 24, F1 Manager 2023, Football Manager 2024, For The King II, Forza Motorsport, Foxhole, Ghostrunner 2, Gord, Granblue Fantasy: Relink, Gray Zone Warfare, HELLDIVERS 2, Hogwarts Legacy, Homeworld 3, Honkai: Star Rail, Horizon Forbidden West Complete Edition, House Flipper 2, Immortals of Aveum, Infection Free Zone, Jagged Alliance 3, Kerbal Space Program 2, KovaaK's, Last Epoch, Let's School, Lies of P, Lightyear Frontier, Like a Dragon Gaiden: The Man Who Erased His Name, Like A Dragon: Infinite Wealth, Like a Dragon: Ishin!, Lords of the Fallen 2023, Lost Judgment, Manor Lords, Mortal Kombat 1, Myth of Empires, NBA 2K24, Nightingale, No Rest for the Wicked, NOBUNAGA'S AMBITION: Awakening, Outpost: Infinity, Pacific Drive, Party Animals, PAYDAY 3, PERISH, Pioneers of Pagonia, Portal Prelude with RTX, Ratchet & Clank: Rift Apart, Redfall, Remnant 2, Resident Evil 4, RoboCop: Rogue City, Sengoku Dynasty, Siege Senua's Saga: Hellblade II, Six Days in Fallujah, Skull and Bones, Smalland: Survive the Wilds, Sons Of The Forest, STAR WARS Jedi: Survivor, Starfield, Starship Troopers: Extermination, Stranded: Alien Dawn, Street Fighter 6, Suicide Squad: Kill the Justice League, Summoners War: Chronicles, Sunkenland, System Shock, Thaumaturge, The Crew Motorfest, THE FINALS, The Front, The Invincible, The Last of Us Part I, The Lord Of The Rings: Gollum, The Lord of The Rings: Return to Moria, The Outlast Trials, The Settlers: New Allies, The Texas Chain Saw Massacre, Three Kingdoms Zhao Yun, THRONE AND LIBERTY, Total War: PHARAOH, Undawn, Veiled Experts, Voidtrain, Warhammer 40,000: Gladius - Relics of War, Warhammer 40,000: Rogue Trader, Warhaven, Warlander, Wayfinder, We Were Here Expeditions, Witchfire, Wo Long: Fallen Dynasty, XDefiant\n\nSquashed Bugs\n- Fixed an issue where GeForce Experience prompts for a new driver update even after installing the latest version.\n- Fixed an issue where desktop video recording stopped when HDR was enabled.\n- Fixed an issue where video recording was overexposed when HDR was enabled.\n- Fixed an issue where FPS and Latency intermittently showed \"NA\".\n- Fixed an issue where the camera indicator was incorrectly reporting that it was enabled.\n- Fixed as an intermittent issue where screenshots were not captured for a windowed mode game.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"3.28.0.417","site":"https://www.nvidia.com/","source":"WinGet","license_or_tos":"Proprietary","app_page":"https://www.nvidia.com/en-us/geforce/geforce-experience/","resources":null}