{"appId":"winget_app_AGSProjectTeam.AdventureGameStudio","appShortcutName":"Winget Application","appDisplayName":"Adventure Game Studio","authorId":"winget","releaseTagName":"winget-3.6.1.30","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Adventure Game Studio (AGS) provides the tools to make your own adventure, for free!\n\n\nThis is a 3.6.1 Patch 8.\nEditor:\n- Fixed game cannot be loaded if its GameFileName setting is an empty string.\n- Fixed pressing Alt was not selecting Main Menu.\n- Fixed error occuring when trying to assign an image to the multiple selected View Frames if they have different initial images.\n- Fixed script preprocessor directive \"#else\" in the nested conditions.\nEngine:\n- Made File.ReadStringBack() support reading back strings without null-terminator in the end\n(ReadStringBack() reads a string, which has its length prepended to the sequence of chars).\n- Improved graphic mode selection when game window is moved to a secondary monitor.\nNote that still not all graphic setups are reliable on secondary monitors, specifically \"real fullscreen\" mode may be behaving unexpectedly if you try to switch to it on non-primary display.\n- Fixed AudioChannel's Paused state is not saved when saving the game.\n- Fixed error in case a character was walking while being locked to a temporary View, and switched to a directional loop which does not exist in the locked view.\n- Fixed active item cursor's image may duplicate itself onto other cursors under certain conditions.\n(this is regression since 3.6.1 Patch 6)\n- Fixed Inventory Window in automatic mode not redrawing its contents immediately when player character changes.\n- Fixed ListBox.FillDirList() may add case-sensitive duplicates on platforms with case-sensitive filesystems.\n- Fixed room's fade-out effect playing while skipping a cutscene (it must skip instantly).\n- Fixed FadeOut or FadeIn not toggling screen state if they are inside a skipped cutscene. This could have resulted in screen not turning to black or not restored as expected if cutscene was skipped by player.\n- Fixed Wait() delay of value > 32k would be treated as infinite timeout.\n- Fixed Ctrl + Alt key combination not working (toggle mouse lock). This is a regression in 3.6.1.\n- Fixed game may fail loading on platforms with strict memory alignment (e.g. MIPS processors).\nCompatibility:\n- Fixed SetCharacterViewEx() not treating \"align\" parameter according to old-style set of values.\n- Fixed SetTextOverlay() could cause internal mistakes leading to unexpected errors in game.\n- Fixed Wait() calls for pre-3.6.0 versions of Script API, where negative delay was treated as 0.\nWinSetup:\n- Fixed setup not distinguishing \"desktop resolution\" and \"native resolution\" from explicit resolution sizes when saving or loading config. Made sure that it remembers exactly the choice that user made (\"desktop\", \"game resolution\" or explicit resolution size).\n- Fixed \"native game resolution\" not present in the list if it equals desktop resolution.\n- Fixed nearest resolution selection in case config requested a resolution equal to the native game's resolution, but that resolution was not among the supported ones.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"3.6.1.30","site":"https://www.adventuregamestudio.co.uk/","source":"AGS Project Team","license_or_tos":"Artistic License 2.0","resources":null,"verified":false}