{"appId":"winget_app_qBittorrent.qBittorrent","appShortcutName":"Winget Application","appDisplayName":"qBittorrent","authorId":"winget","releaseTagName":"winget-5.0.1","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Free and reliable P2P Bittorent client.\n\nqBittorrent is a bittorrent client programmed in C++ / Qt that uses libtorrent (sometimes called libtorrent-rasterbar) by Arvid Norberg.\nIt aims to be a good alternative to all other bittorrent clients out there. qBittorrent is fast, stable and provides unicode support as well as many features.\nqBittorrent v5.0.1 was released.\nLibtorrent 1.2.x users who stuck with it due to memory usage issues, you might want to try the libtorrent 2.0.x variant and change the disk IO type to the new option \"Simple pread/pwrite\". Memory usage issues should be eliminated with it. More info in PR #21300.\nWINDOWS: If you like a native UI look and feel and don't care about dark mode use the System Qt style in the Settings (Behavior category). If you want the best possible dark mode support use the Fusion Qt style (it should be the default already).\nLibrary versions\nlibtorrent 1.2.19+git8ad05ebd41 / 2.0.11+git6a2c1eef6f\nQt 6.7.3\nBoost 1.86\nv5.0.1 changelog:\n- FEATURE: Add \"Simple pread/pwrite\" disk IO type (Hanabishi)\n- BUGFIX: Don't ignore SSL errors (sledgehammer999)\n- BUGFIX: Don't try to apply Mark-of-the-Web to nonexistent files (glassez)\n- BUGFIX: Disable \"Move to trash\" option by default (glassez)\n- BUGFIX: Disable the ability to create torrents with a piece size of 256MiB (stalkerok)\n- BUGFIX: Allow to choose Qt style (glassez)\n- BUGFIX: Always notify user about duplicate torrent (glassez)\n- BUGFIX: Correctly handle \"torrent finished after move\" event (glassez)\n- BUGFIX: Correctly apply filename filter when !qB extension is enabled (glassez)\n- BUGFIX: Improve color scheme change detection (glassez)\n- BUGFIX: Fix button state for SSL certificate check (Chocobo1)\n- WEBUI: Fix CSS that results in hidden torrent list in some browsers (skomerko)\n- WEBUI: Use proper text color to highlight items in all filter lists (skomerko)\n- WEBUI: Fix 'rename files' dialog cannot be opened more than once (Chocobo1)\n- WEBUI: Fix UI of Advanced Settings to show all settings (glassez)\n- WEBUI: Free resources allocated by web session once it is destructed (dyseg)\n- SEARCH: Import correct libraries (Chocobo1)\n- OTHER: Sync flag icons with upstream (xavier2k6)","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"5.0.1","site":"https://www.qbittorrent.org/","source":"The qBittorrent project","license_or_tos":"GPL-3.0","resources":null,"verified":false}