{"appId":"winget_app_HARMAN.AdobeAIR","appShortcutName":"Winget Application","appDisplayName":"Adobe AIR","authorId":"winget","releaseTagName":"winget-51.1.1.5","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/microsoft/winget-pkgs/releases/download/winget-51.1.1.5/"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/microsoft/winget-pkgs/releases/download/winget-51.1.1.5/"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Enabling cross-platform application and game development\n\nHARMAN have taken over the development and support for the Adobe AIR SDK, a cross-platform framework used by a wide range of applications and games. Enabling rapid development including animations created via Adobe Animate, AIR supports the deployment of applications on desktop and mobile platforms, including the ability to develop and deploy iPhone and iPad applications using a Windows machine.\nAIR-7119: AIR Android - remove use of APIs that are restricted by strict mode\nAIR-7354: ADT fails to package a macOS app bundle if default ANEs are needed\nAIR-7355: ADT fails to package Mac App Bundle\nAIR-7360: Android AS3 keyboard mapping for Escape key events\nGithub-3330: Ensuring keyboard deactivation doesn't happen if a StageText element has focus\nGithub-3359: Updating FileStream async handling and Linux event loops\nGithub-3391: Adding ELS recovery code following format issues in 51.0 stores\nGithub-3399: Reverting AIR-7115 to ensure keyboard display works better on Android TextField touch\nGithub-3414: Ensuring Android background thread can use recreated EGL surfaces\nGithub-3460: Fixing EncryptedLocalStore.reset failure on Windows\nGithub-3467: Correcting Linux timezone offset to use ms\nGithub-3470: Correcting daylightSavingsOffset value for Linux","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"51.1.1.5","site":"https://airsdk.harman.com/","source":"WinGet","license_or_tos":"Proprietary","app_page":null,"resources":null}