{"appId":"winget_app_Alex313031.Mercury","appShortcutName":"Winget Application","appDisplayName":"Mercury","authorId":"winget","releaseTagName":"winget-129.0.2","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/Alex313031/Mercury/releases/download/v.129.0.2/mercury_129.0.2_win64_AVX_installer.exe"}},"install":{"win32":{"assetId":1,"exec":null,"installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Firefox fork with compiler optimizations and patches from Librewolf, Waterfox, and GNU IceCat.\n\nFirefox fork with compiler optimizations and patches from Librewolf, Waterfox, and Ghostery.\nIt aims to be the Firefox equivalent of my main project: Thorium (a Chromium fork).\n- Finally updated it, plz don't hate me I know ya'll been waiting\n- Builds for ALL DA OSES!\n- Incorporated some compiler flags from Zen browser, AND, made some commits to Zen as well to add some of Mercury's AVX2 stuff. See > zen-browser/desktop#1216 Thanks to the author for talking to me on Reddit and then accepting my pull request.\n- Disabled \"Normandy\", a component that allows Mozilla to alter extension configurations at will remotely. (bleh wtf is that)\n- Enabled JS_SHELL, for devs looking to use extensions like https://addons.mozilla.org/en-US/firefox/addon/scratchpad/ to get a semblance of that functionality that they removed.\n- Tabstrip functionality of Firefox View is enabled, without actually enabling firefox view due to it's other bad stuff we don't want (You can still manually enable it in about:config, then re-add it to the tabstrip with the buttons editor).\n- MacOS builds lack PGO, since I had to cross-compile them. May reduce performance.\nNOTE: For those looking to build for themselves, cross compiling for MacOS is now broken since Apple complained about Mozilla redistributing the XCode SDK (of course 🙄). The workaround involves a lengthy process to package up the SDK from a Mac, then copy it to your Linux machine. It's outside the scope of these release notes, but I may add instructions to the //docs folder at a later date.UI Update: Next release will have some UI patches from Floorp, a popular Firefox fork. However, remember that Mercury doesn't attempt to heavily modify the UI from upstream Firefox, so don't expect Mercury to end up being a compiler optimized Floorp. I promise there won't be a freakin months long delay in updating. But I also tend to put Thorium and Codium first over my other projects. One man can only do so much, even with as often as I am on the computer doing nerd stuff.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"129.0.2","site":"https://github.com/Alex313031","source":"Alex313031","license_or_tos":"MPL-2.0","resources":null,"verified":false}