{"appId":"winget_app_Intel.PresentMon","appShortcutName":"Winget Application","appDisplayName":"Intel(R) PresentMon","authorId":"winget","releaseTagName":"winget-2.2.0.0","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/GameTechDev/PresentMon/releases/download/v2.2.0/PresentMon-v2.2.0.msi"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A gaming performance overlay and telemetry application to monitor and measure your gaming experience.\n\nPresentMon is a set of tools to capture and analyze the high-level performance characteristics of graphics applications on Windows.\nPresentMon traces key performance metrics such as the CPU, GPU, and Display frame durations and latencies; and works across different graphics API such as DirectX, OpenGL, and Vulkan, different hardware configurations, and for both desktop and UWP applications.\nNew Features\n- Overhauled the ETW backend to reduce event latency from 1000ms => ~30ms; overlay now displays data instantly without 1 second lag\n- Added a new click-to-photon metric that only tracks mouse button events; renamed previous click-to-photon metric to \"all-input-to-photon\"\n- Improved input latency reporting so that input falling on dropped frames is attributed to the next displayed frame rather than being ignored\n- Enabled the client to gather log data from the service and increased log coverage, particularly at the \"debug\" severity level\n\nBug Fixes\n- Fixed column labels for summary stats file #330\n- Fixed rare crash due to a race condition #340\n- Fixed bug occurring when selecting a non-default adapter #256","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"2.2.0.0","site":"https://www.intel.com/","source":"WinGet","license_or_tos":"MIT","resources":null,"verified":false}