{"appId":"winget_app_Mozilla.Firefox","appShortcutName":"Winget Application","appDisplayName":"Mozilla Firefox","authorId":"winget","releaseTagName":"winget-133.0","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://download-installer.cdn.mozilla.net/pub/firefox/releases/133.0/win64/en-US/Firefox%20Setup%20133.0.exe"},"0":{"installerType":"WindowsInstallerExe","asset":"","url":"https://download-installer.cdn.mozilla.net/pub/firefox/releases/133.0/win64-aarch64/en-US/Firefox%20Setup%20133.0.exe"}},"install":{"win32":{"assetId":1,"exec":null,"installerArgs":null},"winarm":{"assetId":0,"exec":null,"installerArgs":null},"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Mozilla Firefox is free and open source software, built by a community of thousands from all over the world.\n\nFirefox Browser, also known as Mozilla Firefox or simply Firefox, is a free and open-source web browser developed by the Mozilla Foundation and its subsidiary, the Mozilla Corporation. Firefox uses the Gecko layout engine to render web pages, which implements current and anticipated web standards. In 2017, Firefox began incorporating new technology under the code name Quantum to promote parallelism and a more intuitive user interface. Firefox is officially available for Windows 7 or newer, macOS, and Linux. Its unofficial ports are available for various Unix and Unix-like operating systems including FreeBSD, OpenBSD, NetBSD, illumos, and Solaris Unix.\nNew\n- Firefox now has a new anti-tracking feature, Bounce Tracking Protection, which is now available in Enhanced Tracking Protection's \"Strict\" mode. This feature detects bounce trackers based on their redirect behavior and periodically purges their cookies and site data to block tracking.\n- The sidebar to view tabs from other devices can now be opened via the Tab overview menu.\n\n- GPU-accelerated Canvas2D is now enabled by default on Windows providing a performance improvement.\nFixed\n- Various security fixes.\n- The “Picture-in-Picture: auto-open on tab switch” feature from Firefox Labs now behaves more reliably across a wider range of sites, automatically opening relevant videos while ignoring others.\nChanged\n- When server time is available, the \"expire\" attribute value is adjusted by adding the difference between the server and local times. If the current time is set in the future, cookies that have not expired according to the server time are considered valid.\nEnterprise\n- You can find information about policy updates and enterprise specific bug fixes in the Firefox for Enterprise 133 Release Notes.\nDeveloper\n- Firefox now supports the keepalive option in the Fetch API. This feature allows developers to make HTTP requests that can continue to run even after the page is unloaded, such as during page navigation or closing.\n- Firefox now supports the Permissions API in Worker Context.\n- Firefox now dispatches beforetoggle events just before a dialog opens and toggle events after the dialog closes, matching the behavior of popovers.\n- Methods are now available on UInt8Array to convert to and from Base64 and hexadecimal encodings. This is an implementation of a Stage 3 TC39 proposal, for more details see the proposal text.\n- Added support for image decoding as part of the WebCodecs API. This allows for decoding of images from the main and worker threads.\nCommunity Contributions\n- With the release of Firefox 133, we are pleased to welcome the developers who contributed their first code change to Firefox in this release, 16 of whom were brand new volunteers! Please join us in thanking each of these diligent and enthusiastic individuals, and take a look at their contributions:\n  - abhijeetchawla[:ff2400t]: 1810429, 1810480, 1810482, 1810483, 1810485, 1810486, 1855165, 1855168\n  - bootleq: 1905331\n  - Chizoba ODINAKA: 1918731\n  - Christian Liebel: 1921633\n  - Collin Richards: 1086524\n  - Diego Ciudad Real: 1853990, 1878737\n  - gasc: 1868303\n  - Jason: 1882316\n  - Lukasz Gniadzik [:lgniadzik]: 1926280\n  - Maxime Thiebaut: 1915982\n  - Oliver Old [:oold]: 1640243\n  - psychpsyo: 1837773\n  - Serah Nderi: 1923710, 1923737, 1924202, 1924608\n  - Syed Bariman Jan: 1918706, 1918734, 1922523\n  - tanishkasingh2004: 1922593, 1923190\n  - tawanda: 1918735, 1923146","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"133.0","site":"https://www.mozilla.org/","source":"Mozilla","license_or_tos":"MPL-2.0","resources":null,"verified":false}