{"appId":"winget_app_DebaucheeOpenSourceGroup.Barrier","appShortcutName":"Winget Application","appDisplayName":"Barrier","authorId":"winget","releaseTagName":"winget-2.4.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/microsoft/winget-pkgs/releases/download/winget-2.4.0/"},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/microsoft/winget-pkgs/releases/download/winget-2.4.0/"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Barrier is open-source KVM software\n\n\n- Barrier now supports client identity verification (fixes CVE-2021-42072, CVE-2021-42073).\n- Barrier now uses SHA256 fingerprints for establishing security of encrypted SSL connections.\n  After upgrading client to new version the existing server fingerprint will need to be approved again.\n  Client and server will show both SHA1 and SHA256 server fingerprints to allow interoperability with older versions of Barrier.\n- Fixed build failure on mips*el and riscv64 architecture.\n- Fixed reading of configuration on Windows when the paths contain non-ASCII characters (#976, #974, #444).\n- Barrier no longer uses openssl CLI tool for any operations and hooks into the openssl library directly.\n- More X11 clipboard MIME types have been mapped to corresponding converters (#344).\n- Fixed setup of multiple actions associated with a hotkey.\n- Fixed setup of hotkeys with special characters such as comma and semicolon (#778).\n- Fixed transfer of non-ASCII characters coming from a Windows server in certain cases (#527).\n- Barrier will now regenerate server certificate if it's invalid instead of failing to launch (#802)\n- Added support for additional keys on Sun Microsystems USB keyboards (#784).\n- Updated Chinese translation.\n- Updated Slovak translation.\n- Theme icons are now preferred to icons distributed together with Barrier (#471).\n- Fixed incorrect setup of Barrier service path on Windows.\n- Added --drop-target option that improves drag and drop support on Windows when Barrier is being run as a portable app.\n- The --enable-crypto command line option has been made the default to reduce chances of accidental security mishaps when configuring Barrier from command line.\n  A new --disable-crypto command line option has been added to explicitly disable encryption.\n- Added support for randomart images for easier comparison of SSL certificate fingerprints.\n  The algorithm is identical to what OpenSSH uses.\n- Implemented a configuration option for Server GUI auto-start.\n- Made it possible to use keyboard instead of mouse to modify screen layout.\n- Added support for keyboard backlight media keys\n- Added support for Eisu_toggle and Muhenkan keys\n- Added --profile-dir option that allows to select custom profile directory.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"2.4.0","site":null,"source":"WinGet","license_or_tos":"GNU General Public License v2.0","app_page":"https://github.com/debauchee/barrier","resources":null}