{"appId":"winget_app_SimonG4ELI.SDR_Radio","appShortcutName":"Winget Application","appDisplayName":"SDR-Radio.com (V3)","authorId":"winget","releaseTagName":"winget-3.3","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Windows solution for Software Defined Radio (SDR) receivers and transceivers.\n\n\nServer\n  * Now working again when UDP is enabled.\n  * Adding a server - when clicking Edit the list of radios, soundcards and bandwidths are reset.\n  * Redesigned the server connection window - no change in function, just tidied up what previously was a very poor UI design.\nSatellites\n  * Fixed satellite problem with very low LEO satellites, problem identified with GALASSIA.\nTX Voice Keyer\n  * Corrected logic for stopping voice keyer when triggering TX from external source.\nAnalyser\n  * Minor change in FFT / DFT processing.\nSignal History\n  * Signal History now prompts when the output file already exists.\nData File Editor\n  * Title is now V3.3,\n  * Slightly changed layout,\n  * More efficient background thread management.\nExternal Radio\n  * Fixed fatal error in External Radio Options, Serial Ports, View.\nIdentities\n  * Identities windows redesigned, added Help Text.\n  * The Main identity can now be renamed.\n  * When editing an Identity title, the [X] Enable option is automatically set.\nS-Meter\n  * Added a Default option to the S-meter configuration window.\nFrequency Database\n  * Fixed error importing a custom frequency database with frequencies above 4 GHz.\nBlank Spectrum\n  * Fixed error where then Spectrum stays blank in receiver window. Took me 4 hours to find this 6 year-old bug!\nSilent Installation\n  * Fixed installer issues when using the silent (/S) switch. Had never tried a silent installation before.\nPluto\n  * Fixed bugs in the Pluto Temperature file as found by Sigi.\n  * TX channels disabled and powered down when starting the radio.\n  * I've extended the Pluto temperature file options so you can select the decimal separator if your locale-specific separator is not '.' . English and American users will not see a difference; German (Sigi) will.\nHelp\n  * Ribbon Bar, help - minor updates.\nELAD S3\n  * Fixed issues when downconverter not installed.\nPlayback\n  * Minor UI tweaks to the Playback window when Grid is selected.\n  * Made the Stop button in the Playback Selection window more obvious.\nUI\n  * Added a loudspeaker symbol in RX windows when the audio is not muted. If muted nothing is shown.\nOptimisation\n  * Probably not noticeable but makes me feel better 🙂 . I see a slight drop running 24 Broadcast FM channels and the Matrix display.\nAudio Recording\n  * Audio recording cache now only runs for the current (active) receiver, running on all was causing serious issues when many Broadcast-FM receivers were active. As part of hunting the above, I optimised the queue lists in the background threads (you'll not really notice much difference here).","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"3.3","site":"https://www.dit-dit-dit.com","source":"WinGet","license_or_tos":"Proprietary","resources":null,"verified":false}