{"appId":"winget_app_RealtimeSoft.UltraMon","appShortcutName":"Winget Application","appDisplayName":"UltraMon","authorId":"winget","releaseTagName":"winget-3.4.1","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://www.realtimesoft.com/files/UltraMon_3.4.1_en_x64.msi"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Window management utility for multi-monitor systems\n\n\nNew in this release\nThis release adds support for version 1809 of Windows 10, specifically the window buttons now work, Chrome no longer crashes at launch and when hiding the start button on secondary taskbars the search and task view button get properly hidden as well.\n\nFixed issues\n• UltraMon crashes on Windows 10 if themeing has been disabled via Handle.exe\n\nKnown issues\n  • Windows Vista: when running an application as administrator you'll get an error 'A referral was returned from the server' from UltraMonUiAcc.exe. As a workaround run regedit.exe, then go to the key HKEY_CURRENT_USER\\Software\\Realtime Soft\\UltraMon\\<version> and set the UseUiAcc value to zero. This way you won't get an error, but UltraMon still won't be able to add window buttons etc to applications running as administrator. This issue occurs because Windows Vista doesn't support the new SHA256 code signing certificate used by UltraMon\n  • Runtime error in Adobe Acrobat when moving maximized window if Acrobat was launched from CCH ProSystem Engagement. As a workaround, go to UltraMon Options > Compatibility, then configure settings for Adobe Acrobat and check the 'use alternative method to move maximized window' option\n  • Docking hints from Xceed Docking Windows library don't work if UltraMon window buttons are enabled for the application ","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"3.4.1","site":"https://www.realtimesoft.com/","source":"WinGet","license_or_tos":"Proprietary","resources":null,"verified":false}