{"appId":"winget_app_Unity.Unity.CN.2022","appShortcutName":"Winget Application","appDisplayName":"Unity 2022 (CN Version)","authorId":"winget","releaseTagName":"winget-2022.3.49f1c1","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://download.unitychina.cn/download_unity/565813905683/Windows64EditorInstaller/UnitySetup64-2022.3.49f1c1.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"The world’s leading platform for real-time content creation\n\nUnity is the ultimate game development platform.\nUse Unity to build high-quality 3D and 2D games, deploy them across mobile, desktop, VR/AR, consoles or the Web, and connect with loyal and enthusiastic players and customers.\nKnown Issues in 2022.3.49f1\n- Addressable Assets: [Android] [Entities] Build fails with the error “Asset has disappeared while building player to 'globalgamemanagers.assets' - path '', instancedID '-xxxxxx'“ when building (UUM-41830)\n- Asset - Database: \"Missing Prefab Asset\" error in a SubScene after Domain Reload (UUM-82547)\n- Asset - Database: Crash on GetAssetCachedInfoV2 when opening a project (UUM-14959)\n- DirectX12: Crash on GfxDeviceD3D12Base::DrawBuffersCommon when opening a project after changing the Graphics API to DirectX12 (UUM-77757)\n- Editor Platform: [Linux] Crash on 'PPtr::operator RuntimeAnimatorController*() const' when saving a new animation file (UUM-79812)\n- Editor Platform: [Linux] Crash on MenuController::ExecuteMenuItem when selecting recent scene (UUM-82381)\n- Environment Effects: A pink line of the size of the Tree is drawn in the Hierarchy when opening any dropdown in the Inspector (UUM-82801)\n- Hybrid Renderer: [Linux] Crash on ScriptableBatchRenderer::GenerateBuiltInCBuffer when adding \"PerObjectData.ReflectionProbes\" (UUM-79332)\n- Input: Crash on InputDeviceIOCTL when closing Unity editor (UUM-10774)\n- OpenGL: [Linux][URP][OpenGL] Scene View has a red texture overlay when the project is using URP and OpenGLCore Graphics API (UUM-44222)\n2022.3.49f1 Release Notes\nImprovements\n- Particles: Added 2 new sorting modes for reversed depth.\nAPI Changes\n- Editor: Added: Added an api in CloudProjectSettings to get the Services Gateway token.\nChanges\n- Editor: Updated OpenXR to 1.12.1.\nFixes\n- Animation: Fixed an issue where entry transitions were not reporting warnings when one of their parameters was deleted. (UUM-77622)\n- Editor: Fixed rendering issues with XRSettings.RenderViewportScale when using OpenXR. (UUM-19440)\n- Editor: Fixed the wrong texture being set (due to resource name leaking) for half res downsample: instead of using _CameraDepthTexture which could be anything, using an new explicit name _SourceDownsampleDepth.\n  When hardware DRS is on, we can safely assume that the ratio between the input and output textures is 1 because the GPU hardware sizes are watertight. (UUM-64133)\n- Editor: Skip caching MonoScripts in the accelerator that have not compiled successfully. (UUM-65374)\n- Editor: Switched to using more specific keys for caching splash screens rather than clearing the splash screen cache on all changes. Clearing out the splash screen hash could cause race conditions that would fail a build. If splash screens are not being cached properly you can clear out the cache before a build by deleting the SplashScreenCache folder in the Library. (UUM-41830)\n- Graphics: Cleared materialPropertyBlocks after each Blit to avoid interference between blits. (UUM-29958)\n- Graphics: Removed error message in Graphics.Blit when materials MainTex binding is set. (UUM-72740)\n- iOS: Fixed crash when rendering to backbuffer in Update. (UUM-72740)\n- iOS: Fixed occasional hang on some devices when tweaking autorotation. (UUM-75124)\n- Kernel: Fixed memory ordering bug which could have caused a crash or hang in the job system. (UUM-78983)\n- Package Manager: Fixed an issue where installing a non-discoverable package in the Unity Inspector would trigger an error. This update ensures smooth installation of non-discoverable packages without causing interruptions or errors in the Inspector. (UUM-78074)\n- Particles: Fixed potential unbounded memory and excessive work when using Ring Buffer mode. (UUM-72277)\n- Physics 2D: When using Rigidbody2D interpolation and changing the Transform directly, the Transform pose has the priority for interpolation whereas when changing the Rigidbody2D pose directly, the Rigidbody2D pose has the priority over the Transform. This stops \"jitter\" issues when driving the Rigidbody2D constantly via the Transform. This still isn't a recommended practice however. (UUM-82789)\n- Scene/Game View: Fixed Orientation overlay styling. (UUM-79216)\n- Tests: Fixed AsyncInstantiateObjectChildrenTransformValidationNoPositionRotationParent instability by reducing floating point comparison precision. (UUM-72578)\n- UI Toolkit: Fixed override indicator alignment for IMGUI containers. (UUM-29639)\n- UI Toolkit: Fixed zero scale issue when using group transform. (UUM-75219)\n- URP: Fixed an issue where reflection probes would not render correctly on some platforms in some cases. (UUM-54060)\n- VFX Graph: Prevent crash during the update of a Visual Effect when deleting a used Texture. (UUM-82240)\n- VisionOS: A few audio app lifecycle issues were fixed on visionOS. Previously, when moving the Unity app through the various lifecycle states (i.e. foreground, background), audio could stop playing in error. (UUM-60646)\nPackage changes in 2022.3.49f1\nPackages updated\n- com.unity.burst: 1.8.17 to 1.8.18\n- com.unity.xr.legacyinputhelpers: 2.1.10 to 2.1.11\n- com.unity.xr.oculus: 4.2.0 to 4.3.0\n- com.unity.xr.openxr: 1.12.0 to 1.12.1\n- com.unity.services.apis: 1.0.1 to 1.1.0\n- com.unity.microsoft.gdk: 1.1.0 to 1.2.3\n- com.unity.microsoft.gdk.tools: 1.1.0 to 1.2.3","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"2022.3.49f1c1","site":"https://unity.cn/","source":"Unity Technologies ApS","license_or_tos":"Proprietary","resources":null,"verified":false}