{"appId":"winget_app_Ziad.TCG","appShortcutName":"Winget Application","appDisplayName":"Temp_Cleaner GUI","authorId":"winget","releaseTagName":"winget-6.9-stable","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://deac-fra.dl.sourceforge.net/project/temp-cleaner-gui/temp_cleaner_gui_v6.9-stable_win7sp1to11_amd64_mrx.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A Free and Open-Source program to free up disk space on your PC.\n\nTemp_Cleaner GUI is yet another free and open-source piece of software made with your comfortability in mind, What makes Temp_Cleaner GUI different is that it respects your privacy and doesn't ask for a subscription unlike others, our program doesn't collect any sort of personal identification data and it has a lot of cleaning options that aren't available in many popular Free alternatives to this program.\nWhat is new in version 6.9-stable?\n  1 Fixed the issue with the Updater module that causes it to prevent Temp_Cleaner GUI from starting until it finishes checking for updates.\n  2 Improved the overall behavior of the Updater window & module.\n  3 Added a 25 seconds timeout for the check for updates function (to prevent the issue of the program staying in the background for too long)\n  4 Improved overall program exception handling\n  5 Improved the way Temp_Cleaner GUI displays and handles errors.\n  6 Major bug fixes and improvements to the behavior of some cleaners.\n  7 Minor improvements in overall code readability.\n  8 Now the Legacy Microsoft Edge Windows Store Version cleaner is automated! (I know this should have been automated since the first release of Temp_Cleaner GUI, I am sorry I forgot about it ;-;)\n  Please note that not all new features and bug fixes are listed here, and you may see other improvements/or new features that aren't listed here.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"6.9-stable","site":"https://insertx2k.github.io/mrx","source":"WinGet","license_or_tos":"GPL-2.0-or-later","resources":null,"verified":false}