{"appId":"winget_app_Logtalk.Logtalk","appShortcutName":"Winget Application","appDisplayName":"Logtalk","authorId":"winget","releaseTagName":"winget-3.83.0","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Declarative object-oriented logic programming language\n\nLogtalk is a declarative object-oriented logic programming language that extends and leverages the Prolog language with modern code encapsulation and code reuse mechanisms while also providing improved predicate semantics.\nLogtalk compiler and runtime\n- CHANGED: The representation error argument when calling context/1 built-in method would create a cyclic term from cyclic_term to acyclic_term.\n- CHANGED: The exception term when trying to define a predicate inside a protocol to use a permission type of predicate instead of clause.\n- CHANGED: All compiler domain errors for consistency errors to use the new consistency_error/3 built-in method.\n- ADDED: New consistency_error/3 built-in method.\n- IMPROVED: Linter warnings for trivial fails to distinguish between predicate and non-terminal goals.\n- IMPROVED: Compiler warnings on missing scope directives for non-terminals.\n- IMPROVED: Internal documentation of the compiler and runtime.\n- FIXED: When calling threaded engines built-in predicates using a backend that doesn't support engines, throw a resource_error(engines) instead of a resource_error(threads) error.\n- FIXED: Compiler redundant check if a recursive call to a meta-predicate complies with the expected number of additional arguments for closures.\n- FIXED: Compiler bug when using a uses/2 directive to change the order of the arguments of a predicate and using the predicate alias as a closure.\n- FIXED: Disjunction optimization bug when the left-side is a variable and the disjunction is an argument of the call/1 control construct.\n- FIXED: Case where the compiler would report the wrong error when a source file defined category declares a predicate or a non-terminal dynamic textually after its definition.\n- FIXED: Protect the linter check for goals that are always true or false from unexpected exceptions and report them instead of aborting compilation with an error.\nProlog adapter and integration files\n- UPDATED: The XVM adapter file with additional candidate built-in predicates for checking tautology and falsehood goals.\nDocumentation\n- ADDED: Handbook section with guidelines for describing predicates in info/2 directives.\n- IMPROVED: Handbook documentation of the representation_error/1, resource_error/1, existence_error/2, and permission_error/3 built-in methods.\n- IMPROVED: Handbook section on the mode/2 predicate directive.\n- IMPROVED: Handbook section on lambda expressions.\nTools\n- CHANGED: The lgtunit tool run_test_sets/1 predicate to also accept a list with a single test set or an empty list as argument.\n- UPDATED: The help tool to be aware of the new consistency_error/3 built-in method.\n- UPDATED: The tutor tool to explain consistency errors.\nExamples\n- UPDATED: The errors example to illustrate consistency errors.\nTests\n- ADDED: Additional test for the Prolog standard logical update semantics.\n- ADDED: Additional tests for the Prolog standard arg/3, atom_chars/2, atom_codes/2, number_chars/2, number_codes/2, current_predicate/1, clause/2, nl/0-1, op/3, retractall/1, and term_variables/2 built-in predicates.\n- IMPROVED: Tests for the (=..)/2, abolish/1, and functor/3 Prolog standard predicates.\n- IMPROVED: Tests for the Prolog call/1 control construct to delay expected errors to runtime.\n- UPDATED: Tests for the missing_directives and trivial_goal_fails linter flags.\n- UPDATED: The tests for the Prolog standard op/3 for Trealla Prolog which now allows defining an atom as both an infix and a postfix operator.\nInstallers and installation scripts\n- FIXED: The Docker file for building the SWI-Prolog based image to properly define the INFOPATH and MANPATH environment variables.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"3.83.0","site":"https://logtalk.org/","source":"WinGet","license_or_tos":"Apache-2.0","resources":null,"verified":false}