{"appId":"winget_app_JetBrains.Toolbox","appShortcutName":"Winget Application","appDisplayName":"JetBrains Toolbox","authorId":"winget","releaseTagName":"winget-2.4.2.32922","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://download.jetbrains.com/toolbox/jetbrains-toolbox-2.4.2.32922.exe"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Manage your IDEs the easy way\n\nOpen any of your projects in any of the IDEs with one click.\nToolbox App 2.4.2 Bugfix Update\n- Null bytes appeared in vmoptions file are now removed during IDE update to 2024.2 version. TBX-11980\n- Fix launching an installer with stricter Windows Authenticode signature verification. TBX-11938\nToolbox App 2.4.1 Bugfix Update\n- Fixed out of frame popup menus when opening on external display. TBX-12389\n- Fixed scrollbar on Android Studio license agreement screen. TBX-12439\n- Fixed the way tools are launched on Linux which may have led some IDE versions to crashes. TBX-11685\nWhat's New in Toolbox App 2.4\nToolbox App 2.4 is out! Here are the main updates:\n- The Toolbox App got a new look with a refreshed UI theme.\n- The context menu now opens when right clicking on a tool’s or project’s name in the list. TBX-6664\n- Silent install for the Toolbox App using CLI commands is available for Windows machines. TBX-3219\n- A few improvements have been introduced to the Windows Toolbox App installer.\n- IDE Services user onboarding has been streamlined. TBX-11741\nThe Toolbox App Chrome and Firefox extension now also support Gitee, on top of GitHub, GitLab and Bitbucket.\nCheck out our blog post to learn more.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"2.4.2.32922","site":"https://www.jetbrains.com/","source":"WinGet","license_or_tos":"Freeware","resources":null,"verified":false}