{"appId":"winget_app_Axosoft.GitKraken","appShortcutName":"Winget Application","appDisplayName":"GitKraken","authorId":"winget","releaseTagName":"winget-10.4.0","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/microsoft/winget-pkgs/releases/download/winget-10.4.0/"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/microsoft/winget-pkgs/releases/download/winget-10.4.0/"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"The legendary Git client with an ultra-intuitive GUI, a powerful terminal, and offers a seamless experience for Windows, Mac and Linux.\n\n\nNew ✨\n- New Launchpad filters allow you to get a more focused view of your next sprint or milestone.\n  - You can now see and filter by Jira fix versions and sprints in Launchpad.\n  - You can now see and filter by GitHub and GitLab milestones in Launchpad.\n- Insights has moved to GitKraken.dev, offering greater control and visibility into key project metrics.\n  - Clicking on the Insights icon for a Cloud Workspace in the Repo Management tab will now direct you to Insights for that Workspace on GitKraken.dev.\n- Optimize your repo on disk with the new command Perform Repo Maintenance in the Command Palette.\n  - Open the Command Palette with the shortcut Cmd/Ctrl+P.\n  - This command will execute git maintenance run, which may take several minutes on larger repositories.\n\nImprovements 🙌\n- Added support for descriptions (multiple lines) in stash messages.\n- You can now invite Azure DevOps users to your GitKraken organization from the Launchpad user filter.\n- Improved performance shortly after start-up by reducing wasteful pre-loading of data.\n- First-time onboarding:\n  - The dialog for opening a repository has improved to search for repositories in subfolders if the selected directory is not a repository.\n\nBug Fixes 🐛\n- Fixed an issue where long repository or remote names could overlap with the next column in the Repository Management tab.\n- Fixed an issue connecting the Azure DevOps integration while signing in with Azure DevOps.\n- Commit author emails with different casing should now be treated as the same email by the author filter in the Commit Graph.\n- Fixed an issue where the commit button(s) could be pushed off the bottom of the screen in some cases.\n- Adjusted several toasts to look better in Light theme.\n- Pull Requests will now only show on graph ref labels when the remotes match, not just the branch name. This will eliminate cases where PR icons could appear on a remote which was unrelated to the PR.\n- Fixed an issue where clicking on the WIP input box would deselect the WIP.\n- Fixed an issue where interactive rebase didn’t checkout the branch being rebased.\n- Fixed an issue where the Launchpad user filter did not search by users’ names in the filter dropdown.\n- Fixed showing user columns in Launchpad when they were not currently fetched.\n- Fixed a case in the Launchpad WIPS tab where opening a repository in the browser would not work.\n- The Commit Details Panel will now open when creating a Cloud Patch, even when it was previously hidden by the user.\n- Fixed cases where the Launchpad user filter would not detect a user is within an org for Azure DevOps.\n- Fixed an issue where the Launchpad summary in the status bar would show data from the Team view instead of the Personal view.\n- Experimental Feature – Git Executable:\n  - Fixed an issue where switching from a branch with submodules to a branch without them did not delete submodule folders.\n  - Fixed an issue where user.signingKey in global .gitconfig was not updated when switching between GPG and SSH signing formats.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"10.4.0","site":"https://www.axosoft.com/","source":"WinGet","license_or_tos":"Proprietary","app_page":"https://www.gitkraken.com/git-client","resources":null}