{"appId":"winget_app_Xanashi.Icaros","appShortcutName":"Winget Application","appDisplayName":"Icaros","authorId":"winget","releaseTagName":"winget-3.3.2.303","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/Xanashi/Icaros/releases/download/v3.3.3b3/Icaros_v3.3.3_b3.exe"}},"install":{"win32":{"assetId":1,"exec":null,"installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A collection of lightweight, high quality, Windows Shell Extensions\n\nIcaros is a collection of lightweight, high quality, Windows Shell Extensions.\nIcaros can provide Windows Explorer thumbnails, for essentially any video media format supported by FFmpeg, this includes popular filetypes such as: Mkv, Flv, Avi, Mp4, Mov, Rmvb, M2ts, Ogm etc.\nBesides the FFmpeg supported filetypes, Icaros also contains custom parsers, which can produce Cover Art thumbnails for Mkv, Flac, Ape, Mpc and several other filetypes.\nIcaros also provides Windows Explorer properties for the following popular filetypes: Mkv, Mk3d, Mp4, Mov, Webm, Ogm, Ogg, Flv, Avi, Rm, Rmvb, Flac, Opus, Spx, Ape, Mp3, Mpc, Mka, Tak, Tta, Ofr, Wav and more.\nProperties refer to the info shown for each file in Explorer, such as length, width, height, title, channels and so on.\nGood Afternoon Everyone,\nThis should be the last beta release, before I release 3.3.3 final, which I hope to do soon. It mostly just contains bug fixes and small improvements.\nLet me know if you find any regressions or new bugs.\nI hope you all enjoy the new release! ❤️\n\nIcaros v.3.3.3 Beta 3\n- Implemented new INDD file parser (should fix previous INDD issues)\n- Fixed thumbnailing of several HEVC files\n- Fixed MP4 'creation date' property being off by 1 hour\n- Fixed 'tiled' HEIC aspect ratio issue\n- Added orientation support for 'tiled' HEICs\n- Added thumbnailing support for webp in ID3v2 tags\n- Added AVIF, PX, EXR and PDXPRJ to the presets\n- Register PDF, SVG, EXR, HEIC, HEIF, AVIF and PSXPRJ as image formats\n- Updated FFmpeg","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"3.3.2.303","site":"https://github.com/Xanashi","source":"WinGet","license_or_tos":"Freeware","app_page":"https://github.com/Xanashi/Icaros","resources":null}