{"appId":"winget_app_GnuPG.GnuPG","appShortcutName":"Winget Application","appDisplayName":"GNU Privacy Guard","authorId":"winget","releaseTagName":"winget-2.4.6","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"GNU Privacy Guard (GnuPG or GPG) is a free-software replacement for Symantec's PGP cryptographic software suite.\n\nGnuPG is a complete and free implementation of the OpenPGP standard as defined by RFC4880 (also known as PGP). GnuPG allows you to encrypt and sign your data and communications; it features a versatile key management system, along with access modules for all kinds of public key directories. GnuPG, also known as GPG, is a command line tool with features for easy integration with other applications. A wealth of frontend applications and libraries are available. GnuPG also provides support for S/MIME and Secure Shell (ssh).\n* gpg: New command --quick-set-ownertrust.  [rG967678d972]\n\n  * gpg: Indicate disabled keys in key listings and add list option\n    \"show-ownertrust\".  [rG2a0a706eb2]\n\n  * gpg: Make sure a DECRYPTION_OKAY is never issued for a bad OCB\n    tag.  [T7042]\n\n  * gpg: Do not allow to accidently set the RENC usage.  [T7072]\n\n  * gpg: Accept armored files without CRC24 checksum.  [T7071]\n\n  * gpg: New --import-option \"only-pubkeys\".  [T7146]\n\n  * gpg: Repurpose the AKL mechanism \"ldap\" to work like the keyserver\n    mechnism but only for LDAP keyservers.  [rG068ebb6f1e]\n\n  * gpg: ADSKs are now configurable for new keys.  [T6882]\n\n  * gpgsm: Emit user IDs with an empty Subject also in colon mode.\n    [T7171]\n\n  * agent: Consider an empty pattern file as valid.  [rGc27534de95]\n\n  * agent: Fix error handling of READKEY.  [T6012]\n\n  * agent: Avoid random errors when storing key in ephemeral mode.\n    [T7129, rGfdc5003956]\n\n  * agent: Make \"SCD DEVINFO --watch\" more robust.  [T7151]\n\n  * scd: Improve KDF data object handling for OpenPGP cards.  [T7058]\n\n  * scd: Avoid buffer overrun with more than 16 PC/SC readers.\n    [T7129, rG4c1b007035]\n\n  * scd: Fix how the scdaemon on its pipe connection finishes.\n    [T7160]\n\n  * gpgconf: Check readability of some files with -X and change its\n    output format.  [rG98e287ba6d]\n\n  * gpg-mail-tube: New tool to apply PGP/MIME encryption to a mail.\n    [rG28a080bc9f]\n\n  * Fix some uninitialized variables and double frees in error code\n    paths.  [T7129]","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"2.4.6","site":"https://gnupg.org/","source":"The GnuPG Project","license_or_tos":"GPL-3.0","resources":null,"verified":false}