{"appId":"winget_app_calibre.calibre","appShortcutName":"Winget Application","appDisplayName":"calibre","authorId":"winget","releaseTagName":"winget-7.21.0","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://download.calibre-ebook.com/7.21.0/calibre-64bit-7.21.0.msi"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"calibre is the one stop solution to all your e-book needs.\n\ncalibre is an e-book manager. It can view, convert, edit and catalog e-books in all of the major e-book formats. It can also talk to e-book reader devices. It can go out to the internet and fetch metadata for your books. It can download newspapers and convert them into e-books for convenient reading. It is cross platform, running on Linux, Windows and macOS.\nNew features\n- Edit book: A new tool to create an audio overlay in EPUB files for all text using the Read aloud facility\n  This allows readers of the book to listen to it with sentence tracking, even if they do not have a functioning text-to-speech system in the reading software. You can even assign different voices to different parts of the text for a more immersive experience. The tool is available from the Tools menu in the book editor.\n- Dark mode: make scrollbar more visible with higher contrast and rounded corners\n- E-book viewer: In flow mode when scrolling across internal file boundaries using the mouse wheel/touchpad have a short half second pause to ease the transition. Can be controlled via the Scrolling section of the Viewer preferences.\n- ebook-meta.exe: Add an option to disallow rendered cover of first page for EPUB\n- Book details: Add an action to download the cover to the context menu when right clicking the cover\n  Closes tickets: 2082075\n- Read aloud: Add a restore defaults button to the configuration dialog\n  Closes tickets: 2086609\n- Auto adding: Allow excluding arbitrary file types not just known book file types\n  Closes tickets: 2086478\n- Edit metadata dialog: Add an action to open the book's folder to the context menu of the formats list\n  Closes tickets: 2083583\nBug fixes\n- Read aloud: Fix only first 32000 characters per chapter being read\n  Closes tickets: 2086571\n- Content server: Read aloud: Fix clicking on a word to skip reading aloud to that word causing word highlighting to stop working\n  Closes tickets: 2086661\n- Linux: Handle speech dispatcher with dummy output module and no voices more gracefully\n- When renaming authors fix empty author folder not being removed if it contained file explorer metadata but was otherwise empty\n- Edit metadata dialog: Fix keyboard shortcuts to edit prev/next raising an error when trying to go beyond the first/last book\n  Closes tickets: 2086193\n- Linux: ToC Editor: Fix a regression in 7.17 that broke using the Create new entry button\n  Closes tickets: 2085576\n- Content server: Fix changing the language of a book not working for non-English user interface language and for books that have no existing language\n  Closes tickets: 2085005\n- Linux: Read aloud with Piper: Fix audio not playing on some Linux systems\n- Notes browser: When searching books search over all currently selected categories not just the last selected one\nNew news sources\n- Unz Review and Sonar21 by unkn0wn\nImproved news sources\n- Substack\n- Live Mint\n- NYPost\n- Ars Technica\n- Indian Express\n- Reuters","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"7.21.0","site":"https://kovidgoyal.net/","source":"Kovid Goyal","license_or_tos":"GPL-3.0","resources":null,"verified":false}