{"appId":"winget_app_OpenEducationFoundation.OpenBoard","appShortcutName":"Winget Application","appDisplayName":"OpenBoard","authorId":"winget","releaseTagName":"winget-1.7.1","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/microsoft/winget-pkgs/releases/download/winget-1.7.1/"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/microsoft/winget-pkgs/releases/download/winget-1.7.1/"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"OpenBoard is an open source cross-platform interactive white board application designed primarily for use in schools. It was originally forked from Open-Sankoré, which was itself based on Uniboard.\n\n\nVersion 1.7.1\nNew features\n- added the possibility to move tools (ruler, compass, etc) using arrow keys.\n- added a new Latex2SVG application converting Latex formulas to SVG, that you can then drag and drop on the board. Also supports mhchem for chemistry\n- added CMake support for community-driven Linux builds, thanks to @letsfindaway and @Vekhir.\nImprovements\n- simplified the rules to be authorized to put a new text on the board, when close to another text box.\n- Improved performances on document loading time, especially for heavy documents, containing a lot of annotations.\n- changed delete icons' tooltip according to their text\n- migrated Windows build from xpdf to poppler\n- improved zLevel consistency and how the users can change it. A simple click on the \"Layer Up\" and \"Layer Down\" now simply increments or decrements the zLevel of the targeted object. Long click behavior remains unchanged.\nBug fixes\n- workaround for an issue related to QTBUG-79216, where dead keys were simply ignored in web widgets. The workaround fixes completely the issue on Linux, but not on macOS. You can workaround the issue by giving focus of an input of the widget and pressing Next page then previous page on the Board toolbar, or by simply reloading the page when possible.\n- fixed an issue where the mask would preserve aspect ratio when using the bottom right handle to resize it.\n- fixed an issue where a newly created widget would not be visible until next launch\n- fixed an issue where removing from board a newly created widget would erase it from library and disk\n- fixed an issue where drag and dropping an object from a widget to the board would never trigger mouseReleaseEvent, ending with the widget being moved when not intended\n- fixed an issue where object zLevels would not be correctly set\n- fixed crashes occurring when using the 'Add' button's functionalities in Documents Mode\n- fixed a crash occurring when trying to drag and drop an image already on the board\n- fixed an issue where an image would be copy-pasted at bad off-screen positions on Windows\n- fixed a crash occuring when directly exiting OpenBoard from Board Mode on heavy documents.\n- fixed an issue where the scale of a pdf item was not preserved when copying the page to another document, with the help of @letsfindaway\n- fixed an issue where the eraser was not working when completely inside polygon, thanks to @letsfindaway\n- fixed incorrect sRGB profile and some files rights, thanks to @letsfindaway\n- fixed an issue by avoiding access to uninitialized DisplayManager, thanks to @letsfindaway\n- fixed ruler icons behaviors when zooming, thanks to @Vekhir\n- fixed windows silent install parameters for vcredist, thanks to @PatricCunhaforWork\nKnown issues\n- Some 3rd party widgets may no longer work, as the internal widget API was changed. Please report to the widget author as well as to the OpenBoard team to help updating the widget.\n- Adding a PDF to the board from the internal browser (right click -> add to board) does not work consistently.\n- Some use cases remain where you can end up with documents at the same level having the same name.\n- An issue can occur, that is not clearly identified at this time, when importing an UBX, where users end up with the imported documents appearing multiple times in the documents tree, at the same level.\nLinux\n- In Desktop Mode, Gnome Dock should be set to bottom position to workaround the issue with the OpenBoard left palette not being usable from above it (cf. https://bugreports.qt.io/browse/QTBUG-81341 for more details).\nUbuntu 20.04\n- When Control screen is not the first screen on the left, main menu will not appear where it should. It is due to a Qt bug (cf. https://bugreports.qt.io/browse/QTBUG-84462 for more details).\nMacOS\n- Some .mp4 videos can be read, some can't.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"1.7.1","site":"https://github.com/OpenBoard-org/OpenBoard","source":"WinGet","license_or_tos":"GPL-3.0","app_page":"https://github.com/OpenBoard-org/OpenBoard","resources":null}