{"appId":"winget_app_Elgato.StreamDeck","appShortcutName":"Winget Application","appDisplayName":"Elgato Stream Deck","authorId":"winget","releaseTagName":"winget-6.7.3.21005","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://edge.elgato.com/egc/windows/sd/Stream_Deck_6.7.3.21005.msi"}},"install":{"win32":{"assetId":1,"exec":null,"installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"With Stream Deck, unleash your creative genius and make waves across Twitch and YouTube. All while focusing on what matters most your audience. As a broadcaster that likes to produce on the fly and have high quality production.\n\n\nWhat’s new in Stream Deck 6.7.3?\n\nℹ️ If you are on Stream Deck 6.7 already, to update to Stream Deck 6.7.3, please download it from the link below and install it manually. This is necessary due to a bug in the in-app update installer that causes a crash. Click here to download Stream Deck 6.7.3\nIf you have Stream Deck 6.6 or lower installed, continue the update as normal.\n🆕 Pick your power-up\nIntroducing two new accessories for Stream Deck +, XLR Dock and USB Hub.\nEquipped with XLR Dock, Stream Deck + becomes the ultimate audio station. In back, plug your premium microphone into a mighty interface for studio-like sound.\nMeanwhile, USB Hub offers additional ports to expand your setup. Connect up to four devices, with fast USB 3.0 transfer speeds and an SD card reader.\n\nNote: Both XLR Dock and USB Hub require Stream Deck + and are not compatible with other Stream Deck devices.\nLearn more about XLR Dock and USB Hub\n\n🛞 Action Wheel\nActivate any action with dials - Now, you can assign multiple key actions to a Stream Deck + dial. Simply turn the dial to select your desired action and press to activate, enabling quick and efficient access to actions.\n\n🔊 Volume Controller 2.0\nGet total control of your audio - new in this update, change volume of inputs such as microphones and outputs such as headphones or speakers with Volume Controller. On Windows, control the volume of applications* themselves.\n\n*App volume control is only available on Windows\nGet Volume Controller from Marketplace\n\n🔌 USB connectivity for Stream Deck Mobile*\nWe get it; Wi-Fi can be unreliable. Now, connect your iPhone or iPad directly to your computer with a USB cable and enjoy the reliability of a wired connection with Stream Deck Mobile, plus keep your device charged while in use.\n\n*Requires Stream Deck Mobile 2.0 on iOS or iPadOS.\n\n✅ OBS Studio Chapter Marker\nOBS Studio 30.2 introduced chapter markers, and now you can set markers during recordings easily with Stream Deck. Additionally, chapters can have custom names for powerful organization when editing.\n\nGet the OBS Studio plugin from Marketplace\n\n🛠️ Bug fixes and performance improvements\n- A new badge is shown when XLR Dock is connected\n- A new default profile has been added when using XLR Dock with Stream Deck +\n- Removed Facebook account login to optimize our Team’s resources better and focus on new exciting projects and products\n- Page names and icon customization are now available for all Stream Deck devices with pages support\n- Resolved a bug where Soundboard audio would continue looping even after stopping all audio\n- Resolved a bug that caused custom dial icons and backgrounds to disappear after Stream Deck software restarted\n- Resolved an issue that required re-pairing Stream Deck Mobile to the desktop app.\n- Fixed a problem with setting icons from the icon library for Multi Actions.\n- Corrected the Action Bar state to accurately reflect after switching pages.\n- After using the Website action, the browser will stay open when closing the Stream Deck app.\n- Prompted to sign into Marketplace when manually checking for plugin updates if not already signed in.\n- Fixed an issue where the device list was sent to incorrect mobile apps, causing ghost devices to appear.\n- Resolved a bug where Stream Deck restarted terminated plugins during log-off, leading to Windows error messages.\n- Added and updated missing localizations.\n- Fixed an issue where the second state icon was no longer dimmed automatically.\n- Resolved a crash on macOS when the action title style color picker was open while selecting a different action.\n\nWant to share feedback on Stream Deck 6.7.3? Connect with us:\n- Leave a comment on our Subreddit\n- Chat with fellow community members on Discord\n- Hit up @elgato on Twitter\n- Contact our Support Team","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"6.7.3.21005","site":"https://www.elgato.com/","source":"WinGet","license_or_tos":"Proprietary","app_page":"https://www.elgato.com/s/downloads","resources":null}