{"appId":"winget_app_GDevelop.GDevelop","appShortcutName":"Winget Application","appDisplayName":"GDevelop","authorId":"winget","releaseTagName":"winget-5.4.215","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/microsoft/winget-pkgs/releases/download/winget-5.4.215/"},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/microsoft/winget-pkgs/releases/download/winget-5.4.215/"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"The fastest, easiest, most powerful no-code game engine.\n\nGDevelop is a free, open-source game engine that's 10x easier and faster to use than anything else. Build from anywhere — even on your phone. Publish everywhere: iOS, Android, Steam, web, gaming platforms. Reach millions of players or create the next hit game you've been dreaming of.\n📝 🏎️ Objects now directly editable from the Properties panel\n\nWhen an object is selected (or when \"Edit object\" is chosen in the Properties panel after choosing an instance), this panel will now show the object properties, behaviors, variables and effects. Everything can be directly edited from there.\nThis allows for fast edition of most elements of an object: appearance, properties, but also behaviors, variables, effects... Most work and iterations on your game should be faster, from adapting the appearance of a text to tweaking behaviors and updating the preview to check the result in realtime. For example, behaviors can be directly added, removed and configured:\n\n💡 If you keep the preview of the game opened, on the desktop app, you can then click on the \"Update\" button in the toolbar to apply changes to the live game, without restarting the preview.\n✈️ Custom objects (\"prefabs\") can now be created (Experimental)\nCustom objects are containers, composed of one or more other objects and having custom logic (made with events, like in a traditional scene) inside them. In this new version of GDevelop, you can now select a few instances on the scene and extract them into a custom object that will contain them and their associated object:\n\n\"Custom objects\" are also called \"Prefabs\" or \"Templates\" in some game engines.\nThey almost act like if they are a scene, but available as an object. Like custom behaviors, they can have actions, conditions and expressions, so they can be manipulated by the scene events. They allow to speed-up development and make games more modular by having an object that can be reused in different scenes.\nFor example, you can build:\n- A custom object that is a dialog: a background, some text, some buttons. This allows to do all the logic related to this dialog inside the custom object events, without cluttering the scene.\n- A character or some other game objects that is composed of multiple parts. For example,\nRead the documentation to learn more about their usage.\nYou can see here the two buttons extracted into a custom object. Notice the checkered background indicating that this is not a scene but a custom object that can be reused in multiple scenes:\n\n💝 Improvements\n- New in-app tutorial explaining how to use a Tilemap and interact with it at runtime.\n- When choosing a font or an audio file, the Asset Store will now display a preview and will allow to quickly search in all of them. This is perfect for quickly prototyping games. Note that the Asset Store is not shown anymore when choosing an image (it was confusing as all images were shown without links to their asset packs and without consideration as if they could be used as standalone images). Instead, consider using the menu option to swap an object.\n- Add vertical alignment property for Text objects.\n- Improved \"Quick Customization\" flow in the Get Started page.\n- Tilemap improvements:\n  - Add possibility to paint Tilemaps with a rectangle selection from the tileset.\n  - Allow to filter external tile map collision per layer.\n  - Tilemaps can now be found in the Asset Store in different packs.\n  - Public domain tilemaps are now suggested when you create a new Tilemap object - allowing to quickly start building a level.\n- UI improvements:\n  - Add context menu to move Sprite object animation in list.\n  - Add a context menu options to duplicate instruction parameter or behavior property.\n  - Show the tolerance in the sentence of \"Is object turned toward\" condition\n🐛 Bug fixes\n- Fix exception 't.bind is not a function' when a resource has an empty file\n- Fix some crashes in previews with Tilemaps\n- Fix an exception when a touch is ended and then started in the same frame at runtime\n- Fix the action to change the animation elapsed time for sprites and 3D models\n- Fix text input focus messing with key pressed in the rest of the game\n- Fix ghost hitboxes on tilemap when tiles are flipped\n- Fix some more crashes happening in preview\n- Fix iOS automatic exports when using AdMob\n- Fix crashes in Preview due to ill-formed color values\n- Fix anchor behavior positioning when the object has a custom origin\n- Fix instance selection rectangle not being flipped properly\n- Fix an exception when the object position is not finite using the Physics engine\n- Forbid negative damping values in the Physics engine.\n- Disable the \"support us\" dialog during an in-app tutorial\n⚙️ Extensions\n- [Community] [WithThreeJs] Add drawing detection and improved raycasting\n  - Add \"Check 3D Object Is Within 3D Camera FOV\" condition\n  - Add \"Change 3D Object Raycast Detection\" action\n  - Thanks @PANDAKO-GitHub\n- Make some behaviors work with more object types\n- Make clearer these are both reviewed and community extensions [skip ci]\n- Update README [skip ci]\n- [Reviewed] [Mouse pointer lock] Fixed an issue where extensions did not work on Linux, etc. Fixed an issue where extensions did not work on Chromium-based browsers (this mainly happened on Linux).\n- [Corner sliding] Fix a conflict with the pixel perfect extension\n🎨 Assets\n- Add a new premium pack: Pixel Quest Vol 2: The Necromancer's Order by BarelyApes\n- Fonts and audios are now displayed in a user-friendly manner.\n🕹 Examples\n- [Pair] Simplify the cards shuffling\n- [Asteroids] Fix audio on iOS and replace deprecated actions (thanks @ddabrahim!)\n- [Goose bomberman] Updated with the new variable actions\n- [3D bomber bunny] Updated with the new variable actions\n- Updated several game templates to use Tilemaps (Top-down RPG, Multiplayer platformer pickup, Duck game, Sokoban, Tower defense war, Simple platformer)\n🕹 Premium Game Templates\n- Add a new multiplayer game template: Picle Park by @VegeTato. It includes:\n  - Objects/variables sync and ownership\n  - Smart spawn/despawn players system\n  - GDevelop built-in multiplayer usage\n  - Handling players join mid-game\n  - Handle up to 8 players\n  - Mobile support\n  - Rope mechanic\n  - Physics usage\n  - Guest login","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"5.4.215","site":"http://www.florianrival.com/","source":"WinGet","license_or_tos":"MIT","app_page":"https://gdevelop.io/","resources":null}