{"appId":"winget_app_SuperTux.SuperTux","appShortcutName":"Winget Application","appDisplayName":"SuperTux","authorId":"winget","releaseTagName":"winget-0.6.3","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"SuperTux is a open-source classic 2D jump'n run sidescroller game in a style similar to the original Super Mario games.\n\n\n- WASM compilation! SuperTux nightlies can now be played directly in the browser (thanks to Semphris)\n- Added swimming (thanks to Daniel and Zwatotem)\n- Added walljumping (thanks to Daniel)\n- Autotiles (thanks to Semphris)\n- Updated animations (thanks to Alzter, Daniel and RustyBox)\n- Refreshed many contrib worldmaps (thanks to Servalot)\n- Many updates to paths, with easing, bezier curves, path sharing between objects, and more (thanks to Semphris)\n- Remade the crystal tileset (thanks to Alzter and RustyBox)\n- Many new snow tiles (thanks to Daniel)\n- Many new objects, like the sideways bumper and falling blocks (thanks to Daniel)\n- Custom particles (thanks to Semphris)\n- A new rublight object (thanks to HybridDog)\n- Official binaries for FreeBSD, Linux 32-bit and Ubuntu Touch (thanks to Semphris)\n- Added in-game progress statistics (thanks to Semphris)\n- New color picker based on OKLab (thanks to HybridDog)\n- Add-on creator, to easily create add-on packages with your world (thanks to Semphris)\n- Rework of the Revenge in Redmond worldmap (thanks to RustyBox)\n- Added timeshift ambience in the worldmap (thanks to Semphris)\n- Skippable cutscenes (thanks to Semphris)\n- Editor auto-saves at regular intervals (thanks to Semphris)\n- Optional integration with Discord (thanks to Semphris)\n- Updated translations, of course (thanks to translators)","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"0.6.3","site":"https://www.supertux.org","source":"SuperTux Devel Team","license_or_tos":"GNU General Public License v3.0","resources":null,"verified":false}