{"appId":"winget_app_kyverno.kyverno","appShortcutName":"Winget Application","appDisplayName":"kyverno","authorId":"winget","releaseTagName":"winget-1.12.4","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/kyverno/kyverno/releases/download/v1.12.4/kyverno-cli_v1.12.4_windows_x86_64.zip"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Kyverno is a policy engine designed for Kubernetes.\n\nKyverno is a policy engine designed for Kubernetes.\nIt can validate, mutate, and generate configurations using admission controls and background scans.\nKyverno policies are Kubernetes resources and do not require learning a new language.\nKyverno is designed to work nicely with tools you already use like kubectl, kustomize, and Git.\n❗Important Notice ❗\nIf you are running 1.12, please upgrade to this version to pick up the fix for the ephemeralreports piling-up issue. Check this post and\nunderstand how to recover from an ETCD outage:Amazon EKS- managing and fixing ETCD database size[updated] If you are seeing consistent creation of ephemeralreports, you can:- disable reporting for admission events, please see this comment\n- tune --aggregationWorkers to increase the capacity of consuming ephemeralreports, see this comment. It can be configured directly via the container flag, or through Helm extraArgs.\n🐛 Fixed 🐛\n- Added condition checking to notary attestation verify chainsaw test (\n- Fixed a CLI issue to apply namespace labels in the cluster mode (\n- Fixed a gloabl context look up issue to return the error properly (\n- Fixed logging verbosity got the background scanner (\n- Shutdown the controller properly when the context is canceled (\n- Fixed duplicate updaterequest creation for background policies (\n🔧 Others 🔧\n- Bumped chainsaw (\n- Added chainsaw test for controllers leader election (","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"1.12.4","site":"https://kyverno.io/","source":"WinGet","license_or_tos":"Apache-2.0","resources":null,"verified":false}