{"appId":"winget_app_Mixxx.Mixxx","appShortcutName":"Winget Application","appDisplayName":"Mixxx","authorId":"winget","releaseTagName":"winget-2.4.2","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://downloads.mixxx.org/releases/2.4.2/mixxx-2.4.2-win64.msi"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Free and open source DJ software for Windows, macOS, and Linux\n\nMixxx integrates the tools DJs need to perform creative live mixes with digital music files.\nWhether you are a new DJ with just a laptop or an experienced turntablist, Mixxx can support your style and techniques of mixing.\nWinter and Summer are coming\nContrasts. As the leaves fall and the first snowflakes start drifting down in the North, while the southern skies start warming up with summer sun, we are thrilled to finally release Mixxx 2.4.2! \"Finally\" because a bit later than planned, perfection can take some time. So we are proud to present you this release, a major bugfix-release for the 2.4 series before stepping over to a new number. Don't be scared, development won't hibernate.\nTesting and translating\nA special thank you to everyone who takes the time to test alpha and beta versions, to who report issues and proposals and to those who propose features and improvements. Your feedback is invaluable. A lot of new users and contributors have joined our community the past months, we'd like to welcome them all, spin it up, your energy and fresh ideas have already left a mark. Everybody can contribute to Mixxx. Did you find an error on the website, an incomplete subject in the manual, an error in translation?\nContribute.\nTreasure hunt\nWhen you dive into the code to add a feature or when you are looking for a function when you want to customize a mapping, you can discover small little snippets, real pearls, the intensive work of someone to make a function smoother, to let an algorithm work some milliseconds faster, to offer a conversion of a value to another without having to write it all over again. For all these little snippets, for all these forgotten pearls: thank you to all who ever contributed.\nWhat's in the 2.4.2-bag?\nAll new and shiny: the complete changelog 2.4.2 This new stable release can be downloaded from the Download page.\nProblems that were solved:\n- Handle not supported files when dragging to waveforms and spinnies #13208 #13271 #13275\n- Fix Sqlite 3.45 builds by using only single quotes for SQL strings #13247 #13257\n- LateNight: Use default colors for sampler overviews (like main decks) #13274\n- Library: Allow to drop files to decks with unsupported or no file extensions #13209 #13204\n- Update build environment with libdjinterop 0.21.0 #13288\n- Move to GitHub workflow runner macos-12 #13296 #13248\n- Recording: with empty config, save default split size immediately #13304\n- Allow to drop files with supported MIME type regardless off the file extensions #13209 #13204\n- Add support for Ubuntu Oracular Oriole and remove Lunar Lobster #13348\n- Recordbox: Fix string decoding issues #13293 #13291\n- Mixer preferences: Don't update EQs/QuickEffects while applying #13333\n- Hardware preferences: Fix UX when applying config with missing/busy devices #13312\n- Fix minor 64 bit CPU performance issue #13355\n- Fix clicks at loop-out when looping into lead-in #13294\n- Fix wrong pitch value on startup, caused by components.Pot #11814 #13463\n- Engine Prime: Fix build-failure #13397\n- Engine Prime: Friendlier error message if export fails #13524\n- macOs: Fix Keyboard shortcuts by not catching num key modifier #13481 #13305\n- Skins: fix time display to allow AM/PM #13430 #13421\n- Fix detection last sound if track does not end with silence. #13545 #13449\n- Remove false positive critical warning related to library columns #13165 #13164\n- Fix reading metadata for files with wrong extensions #13218 #13205\n- History: remove purged tracks, auto-remove empty playlists #13579 #13578\n- Synchronize AutoDJ next deck with top track in queue #12909 #8956\n- Playlists: Update play duration and bold state in sidebar when dragging tracks into the playlist table #13591 #13590 #13575\n- Playlists: Keep correct track selection (# position) when sorting #13103\n- Track file export: Various fixes #13610\n- Controller engine: Unify/improve logging, expand error dialog's Details box #13626\n- Fix quantization in the effect engine (metronome effect) #13636 #13733\n- Musicbrainz: Improved messages #13672 #13673\n- Fix ReplayGain detection in case of short tracks #13680 #13676 #13702 #13703\n- Track menu: Avoid crash and UX issues with track nullptr #13685\n- Disable Properties shortcut in Computer feature views #13698\n- Overview waveform: Add tooltip info about left-click dragging #13739\n- Make hotcue_focus_color_next/_prev COs ControlPushButtons to allow direct mappings #13764\n- Scaled svg cache to speed up drawing in hidpi mode #13679\n- Update to libdjinterop 0.22.1 for Enigine Prime 4.0.1 support #13790\n- HID: Avoid repeated error messages from hid_write()/hid_read() in case of errors #13692 #13660\n- Fix unnecessary painting with covers in library #13715\nUpdated Controller Mappings: Denon MC7000, Korg Kaoss DJ, Novation Dicer, Novation Launchpad X, Numark PartyMix and Scratch, Pioneer DDJ-400 and DDJ-FLX4, Reloop Beatmix 2/4, Mixage MK1 and MK2, Sony SIXAXIS","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"2.4.2","site":"https://mixxx.org/","source":"Mixxx Project","license_or_tos":"GPL-2.0-or-later","resources":null,"verified":false}