{"appId":"winget_app_pizzaboxer.Bloxstrap","appShortcutName":"Winget Application","appDisplayName":"Bloxstrap","authorId":"winget","releaseTagName":"winget-2.8.1","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/bloxstraplabs/bloxstrap/releases/download/v2.8.1/Bloxstrap-v2.8.1.exe"}},"install":{"win32":{"assetId":1,"exec":null,"scope":"User","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"An open-source, feature-packed alternative bootstrapper for Roblox.\n\n\nRemovals\n- The engine setting preset for the Roblox escape menu version has been removed.\n  It's become increasingly unstable overtime as Roblox continues to make breaking changes to how it works.\n  It may be readded at a later date when we can support it properly.\nAdditions\n- We've made changes to what analytics we collect.\n  We no longer log package download states, but we do now log exceptions that occur.\n  See the privacy policy for more information about that.\n- In the main menu, pressing the tab key now jumps to selecting the \"Launch Roblox\" button.\n- We've added the ability to easily export diagnostic data through Bloxstrap Settings.\n- We've also added the ability to use the classic Bloxstrap logo in the bootstrapper, for those who fear change.\nBug fixes\n- Roblox launch detection has been improved, and should no longer false flag for some users.\n- Roblox can now be run as an Administrator.\n- Firefox launch issues should now be fixed.\n- Fixed connectivity errors in the bootstrapper not being properly handled.\n- Improved Roblox upgrade reliability.\n- Fixed an issue where deleting a modded file could cause an exception on launch.\n- Fixed the \"Open log file\" option not showing in the activity tracker menu.\n- Fixed exclusive fullscreen not working, and the \"Allow Bloxstrap to manage Fast Flags\" option is now back.\n- Fixed a bug where choosing an emoji mod preset could cause an exception.\n- Fixed issues with phantom Bloxstrap processes hanging in the background.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"2.8.1","site":"https://pizzaboxer.xyz","source":"pizzaboxer","license_or_tos":"MIT","resources":null,"verified":false}