{"appId":"winget_app_MoritzBunkus.MKVToolNix","appShortcutName":"Winget Application","appDisplayName":"MKVToolNix","authorId":"winget","releaseTagName":"winget-87.0.0","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/microsoft/winget-pkgs/releases/download/winget-87.0.0/"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://github.com/microsoft/winget-pkgs/releases/download/winget-87.0.0/"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"MKVToolNix is a set of tools to create, alter and inspect Matroska files under Linux, other Unices and Windows.\n\n\nNew features and enhancements\n- mkvmerge: chapters: added support for specifying MPLS files with --chapters, too, not just as regular source files. The documentation stated this was possible already, but that wasn't actually the case. Implements/fixes #3735.\n- MKVToolNix GUI: multiplexer: added a progress dialog that is shown during file identification.\n- MKVToolNix GUI: jobs: the status bar now differentiates between numbers of warnings/errors that occurred in the current session and those that occurred before the current session. Implements #3732.\n\nBug fixes\n- mkvmerge: AAC parser: LOAS/LATM streams: if the first AudioSpecificConfig element is not found within the first LOAS/LATM frame, mkvmerge will no longer discard the frames before it but defer parsing them until after it has found the AudioSpecificConfig element. Fixes #3727.\n- MKVToolNix GUI: job queue: fixed the GUI crashing when re-ordering the jobs in the job queue. This regression was introduced while fixing #3720. Fixes #3729.\n\nBuild system changes\n- The bundled fmt library was updated to v10.2.1.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"87.0.0","site":"https://www.bunkus.org/","source":"WinGet","license_or_tos":"GPL-2.0","app_page":"https://mkvtoolnix.download/","resources":null}