{"appId":"winget_app_restic.restic","appShortcutName":"Winget Application","appDisplayName":"restic","authorId":"winget","releaseTagName":"winget-0.17.1","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/restic/restic/releases/download/v0.17.1/restic_0.17.1_windows_amd64.zip"}},"install":{"win32":{"assetId":1,"exec":null,"installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Fast, secure, efficient backup program\n\nrestic is a backup program that is fast, efficient and secure. It supports the three major operating\nsystems (Linux, macOS, Windows) and a few smaller ones (FreeBSD, OpenBSD).\nChangelog for restic 0.17.1 (2024-09-05)\nThe following sections list the changes in restic 0.17.1 relevant to restic users. The changes are ordered by importance.Summary\n- Fix #2004: Correctly handle volume names in backup command on Windows\n- Fix #4945: Include missing backup error text with --json\n- Fix #4953: Correctly handle long paths on older Windows versions\n- Fix #4957: Fix delayed cancellation of certain commands\n- Fix #4958: Don't ignore metadata-setting errors during restore\n- Fix #4969: Correctly restore timestamp for files with resource forks on macOS\n- Fix #4975: Prevent backup --stdin-from-command from panicking\n- Fix #4980: Skip extended attribute processing on unsupported Windows volumes\n- Fix #5004: Fix spurious \"A Required Privilege Is Not Held by the Client\" error\n- Fix #5005: Fix rare failures to retry locking a repository\n- Fix #5018: Improve HTTP/2 support for REST backend\n- Chg #4953: Also back up files with incomplete metadata\n- Enh #4795: Display progress bar for restore --verify\n- Enh #4934: Automatically clear removed snapshots from cache\n- Enh #4944: Print JSON-formatted errors during restore --json\n- Enh #4959: Return exit code 12 for \"bad password\" errors\n- Enh #4970: Make timeout for stuck requests customizable\nDetails\n- Bugfix #2004: Correctly handle volume names in backup command on WindowsOn Windows, when the specified backup target only included the volume name without a trailing slash, for example, C:, then restoring the resulting snapshot would result in an error. Note that using C:\\ as backup target worked correctly.Specifying volume names is now handled correctly. To restore snapshots created before this bugfix, use the : syntax. For example, to restore a snapshot with ID 12345678 that backed up C:, use the following command:\nrestic restore 12345678:/C/C:./ --target output/folder\n\n#2004 #5028\n- Bugfix #4945: Include missing backup error text with --jsonPreviously, when running a backup with the --json option, restic failed to include the actual error message in the output, resulting in \"error\": {} being displayed.This has now been fixed, and restic now includes the error text in JSON output.#4945 #4946\n- Bugfix #4953: Correctly handle long paths on older Windows versionsOn older Windows versions, like Windows Server 2012, restic 0.17.0 failed to back up files with long paths. This problem has now been resolved.#4953 #4954\n- Bugfix #4957: Fix delayed cancellation of certain commandsSince restic 0.17.0, some commands did not immediately respond to cancellation via Ctrl-C (SIGINT) and continued running for a short period. The most affected commands were diff,find, ls, stats and rewrite. This is now resolved.#4957 #4960\n- Bugfix #4958: Don't ignore metadata-setting errors during restorePreviously, restic used to ignore errors when setting timestamps, attributes, or file modes during a restore. It now reports those errors, except for permission related errors when running without root privileges.#4958\n- Bugfix #4969: Correctly restore timestamp for files with resource forks on macOSOn macOS, timestamps were not restored for files with resource forks. This has now been fixed.#4969 #5006\n- Bugfix #4975: Prevent backup --stdin-from-command from panickingRestic would previously crash if --stdin-from-command was specified without providing a command. This issue has now been fixed.#4975 #4976\n- Bugfix #4980: Skip extended attribute processing on unsupported Windows volumesWith restic 0.17.0, backups of certain Windows paths, such as network drives, failed due to errors while fetching extended attributes.Restic now skips extended attribute processing for volumes where they are not supported.#4955 #4950 #4980 #4998\n- Bugfix #5004: Fix spurious \"A Required Privilege Is Not Held by the Client\" errorOn Windows, creating a backup could sometimes trigger the following error:\nerror: nodeFromFileInfo [...]: get named security info failed with: a required privilege is not held by the client.\n\nThis has now been fixed.#5004 #5019\n- Bugfix #5005: Fix rare failures to retry locking a repositoryRestic 0.17.0 could in rare cases fail to retry locking a repository if one of the lock files failed to load, resulting in the error:\nunable to create lock in backend: circuit breaker open for file <lock/1234567890>\n\nThis issue has now been addressed. The error handling now properly retries the locking operation. In addition, restic waits a few seconds between locking retries to increase chances of successful locking.#5005 #5011 #5012\n- Bugfix #5018: Improve HTTP/2 support for REST backendIf rest-server tried to gracefully shut down an HTTP/2 connection still in use by the client, it could result in the following error:\nhttp2: Transport: cannot retry err [http2: Transport received Server's graceful shutdown GOAWAY] after Request.Body was written; define Request.GetBody to avoid this error\n\nThis issue has now been resolved.#5018 https://forum.restic.net/t/receiving-http2-goaway-messages-with-windows-restic-v0-17-0/8367\n- Change #4953: Also back up files with incomplete metadataIf restic failed to read extended metadata for a file or folder during a backup, then the file or folder was not included in the resulting snapshot. Instead, a warning message was printed along with returning exit code 3 once the backup was finished.Now, restic also includes items for which the extended metadata could not be read in a snapshot. The warning message has been updated to:\nincomplete metadata for /path/to/file: <details about error>\n\n#4953 #4977\n- Enhancement #4795: Display progress bar for restore --verifyWhen the restore command is run with --verify, it now displays a progress bar while the verification step is running. The progress bar is not shown when the --json flag is specified.#4795 #4989\n- Enhancement #4934: Automatically clear removed snapshots from cachePreviously, restic only removed snapshots from the cache on the host where the forget command was executed. On other hosts that use the same repository, the old snapshots remained in the cache.Restic now automatically clears old snapshots from the local cache of the current host.#4934 #4981\n- Enhancement #4944: Print JSON-formatted errors during restore --jsonRestic used to print any restore errors directly to the console as freeform text messages, even when using the --json option.Now, when --json is specified, restic prints them as JSON formatted messages.#4944 #4946\n- Enhancement #4959: Return exit code 12 for \"bad password\" errorsRestic now returns exit code 12 when it cannot open the repository due to an incorrect password.#4959\n- Enhancement #4970: Make timeout for stuck requests customizableRestic monitors connections to the backend to detect stuck requests. If a request does not return any data within five minutes, restic assumes the request is stuck and retries it. However, for large repositories this timeout might be insufficient to collect a list of all files, causing the following error:List(data) returned error, retrying after 1s: [...]: request timeoutIt is now possible to increase the timeout using the --stuck-request-timeout option.#4970 #5014","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"0.17.1","site":"https://github.com/restic","source":"WinGet","license_or_tos":"BSD-2-Clause","app_page":"https://github.com/restic/restic","resources":null}