{"appId":"winget_app_ImageMagick.ImageMagick","appShortcutName":"Winget Application","appDisplayName":"ImageMagick Q16-HDRI","authorId":"winget","releaseTagName":"winget-7.1.1.39","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://imagemagick.org/archive/binaries/ImageMagick-7.1.1-39-Q16-HDRI-x64-dll.exe"},"0":{"installerType":"WindowsInstallerExe","asset":"","url":"https://imagemagick.org/archive/binaries/ImageMagick-7.1.1-39-Q16-HDRI-arm64-dll.exe"}},"install":{"win32":{"assetId":1,"exec":null,"installerArgs":null},"winarm":{"assetId":0,"exec":null,"installerArgs":null},"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A free, open-source software suite for editing and manipulating digital images\n\nImageMagick® is a free, open-source software suite, used for editing and manipulating digital images. It can be used to create, edit, compose, or convert bitmap images, and supports a wide range of file formats, including JPEG, PNG, GIF, TIFF, and Ultra HDR.\nImageMagick is widely used in industries such as web development, graphic design, and video editing, as well as in scientific research, medical imaging, and astronomy. Its versatile and customizable nature, along with its robust image processing capabilities, make it a popular choice for a wide range of image-related tasks.\nImageMagick includes a command-line interface for executing complex image processing tasks, as well as APIs for integrating its features into software applications. It is written in C and can be used on a variety of operating systems, including Linux, Windows, and macOS.\nMerged\n- uhdr: fix language choice in autoconf #7663\n- uhdr.c: update uhdr coder for gainmap metadata configuration #7635\n- Add missing Threshold command to command array of Region of Interest mode #7606\nCommits\n- beta release 1cb5d3e\n- Added null checks because AcquireProfileStringInfo can return null. e0e6ad8\n- cosmetic 1de7476\n- revert INSTALL_BASE PerlMagick patch 7cf217f\n- Also treat the group and element being zero as the end of data in a dicom file (#7610). 1e2b313\n- Also build the Q8 and Q16 msix installer during a release. 51348da\n- Also add the new msixbundles to the release. 6299383\n- LIBRARY_PATH is reserved, use LIBRARY_ABSOLUTE_PATH instead ba49d0c\n- to do: write pixel data in YCBCR subsampled format 4e48d3c\n- update to latest web pages 4250d75\n- improve URW font search 14bccf9\n- checAddk Ubuntu URW font path ca932f5\n- Update path to Dejavu fonts 67491b0\n- we prefer URW OTF fonts de884e5\n- Correct the return value for when AcquireProfileStringInfo returns null. 8169dc7\n- latest autoconf update a87bb52\n- regenerate 45c7b59\n- Added missing checks for the return value of AcquireProfileStringInfo. c429de8\n- Applied patches from Snibgo (#7622). 61f8f32\n- Activate the alpha channel in SetImageBackgroundColor instead of setting it to opaque alpha because the alpha channel will be set in the method. 0299c16\n- Make sure we read the last xmp profile inside the pdf file. a14cf06\n- check for columns overflow b227a02\n- Call SetImageProfilePrivate after call GetStringInfoDatum because it is possible that SetImageProfilePrivate destroys the profile (#7376). f70d813\n- The image should only be destroyed in case of an error. dcd543e\n- Several changes to fix reading a thumbnail from an exif profile (#7662). b719ad8\n- latest autoconf script update e339a05\n- release 18ae555","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"7.1.1.39","site":"https://imagemagick.org/","source":"WinGet","license_or_tos":"ImageMagick","resources":null,"verified":false}