{"appId":"winget_app_CliptoTeam.Clipto","appShortcutName":"Winget Application","appDisplayName":"Clipto","authorId":"winget","releaseTagName":"winget-7.2.17","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/clipto-pro/Desktop/releases/download/v7.2.17/clipto-7.2.17.exe"}},"install":{"win32":{"assetId":1,"exec":null,"installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"A comprehensive solution for convenient and efficient work with notes, snippets, clipboard, files, and other information that requires quick access via any device\n\n\nNew\n• Existing files can be attached to the notes in the same way as on Android (Note -> :menu -> Attachments -> ...)\n• In Note's text input field it is possible to use some specific hotkey combinations (the logic is applied for the selection or the current line if the selection is not set):\n  • Tab - Indent lines\n  • Shift+Tab - Outdent selection\n  • Alt+Shift+Down - Move selection down\n  • Alt+Shift+Up - Move selection up\n  • Cmd+D / Ctrl+D - Duplicate selection\n  • Cmd+U / Ctrl+U - Uppercase selection\n  • Cmd+Shift+U / Ctrl+Shift+U - Lowercase selection\n\nChanged behaviour\n• Now the app does not prevent you from saving empty notes or notes with title only or with attachments only. The change is done because the app does not know the reason why the text is not set and should not prevent you from doing so\n\nFixes\n• Write clipboard buffer in UTF-8 encoding. Let me know if it impacts the copy/paste behaviour on your platform\n• Shifted focus should correctly set focus on Title or Text depending on the chosen state\n• Hotkeys now correctly applied on change. So it should be possible to change a hotkey for 'Delete note' and use it without reopening the app\n• Auto-start issues (now it should work anywhere except for the AppImage format due to its runtime generated temporary urls). Need to switch the toggle again in order to apply this fix.\n• Use outlined icon for Settings Flat Mode\n• Fixed issues with disappeared left navigation on some platforms with specific conditions\n• Do not inform about new version if it is lower","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"7.2.17","site":"https://github.com/clipto-pro","source":"WinGet","license_or_tos":"Proprietary","resources":null,"verified":false}