{"appId":"winget_app_JetBrains.WebStorm","appShortcutName":"Winget Application","appDisplayName":"WebStorm","authorId":"winget","releaseTagName":"winget-2024.2.3","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://download.jetbrains.com/webstorm/WebStorm-2024.2.3.exe"},"0":{"installerType":"WindowsInstallerExe","asset":"","url":"https://download.jetbrains.com/webstorm/WebStorm-2024.2.3-aarch64.exe"}},"install":{"win32":{"assetId":1,"exec":null,"installerArgs":null},"winarm":{"assetId":0,"exec":null,"installerArgs":null},"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"The smartest JavaScript IDE\n\nWebStorm is an integrated development environment for JavaScript and related technologies. Like other JetBrains IDEs, it makes your development experience more enjoyable, automating routine work and helping you handle complex tasks with ease.\nWhat's fixed:\n- We've fixed the problem with inlay hints not being shown (WEB-68663).\n- We've fixed performance problems with storing JSRecord types in maps (WEB-69141).\n- We've improved performance optimizing JSFileImports.getOutFiles, JSImportGraph.add, and TypeScriptConfigImpl.getSimpleConfigImpl (WEB-69159, WEB -69158).\n- We've improved loading TypeScript configs performance optimizing JsonPsiImplUtils.getName (WEB-69157).\n- We've fixed incorrect template event resolution in Angular projects (WEB-63570).\n- We've fixed the problem with multiple file-level banners being added to the reported file on adding a file-level annotation from an external annotator (IJPL-995).\n- We've fixed broken backward compatibility for jsonSchema.xml files (IJPL-160634).\n- We've added an option to enable approving installation of third-party plugins automatically (IJPL-162211).\n- We've fixed the problem with the IDE failing to show the project folder if the path is not in the Unicode NFC form (IJPL-162082).\n- We've fixed the problem with the Remote SSH External Tools action being unavailable (IJPL -161201).\n- We've fixed the problem with navigating to selected usages (IJPL-162465).\n- We've added logging of scaling and UI initialization (IJPL -159968).\n- We've fixed the problem in HTTPClient with oauth not working for iteration through a var collection (IJPL-162077).\n- We've fixed the problem with the IDE failing to start up throwing a com.intellij.ide.plugins .PluginManagerCore.ask3rdPartyPluginsPrivacyConsent exception (IJPL-161642).\n- We've improved the appearance of the Quick Documentation popup (IJPL-161112).\n- We've fixed the problem with Find Usages for symbols (IJPL-161383).\n- We've fixed the problem with the IDE freeze on pressing Ctrl+P with NVDA screen reader used (IJPL-162086).\n- We've fixed the problem with the api-ms-win-core-console-l1-2-0.dll being not packaged with the IDE, which may cause IDE breaking on certain systems (IJPL -160489).\n- We've fixed a performance problem caused by excessive CPU usage with OpenAPI specification (IJPL-160968).\n- We've improved start-up performance of the Terminal (IJPL-159892).\n- We've fixed a bunch of highlighting-related problems (IJPL-161270, IJPL-159317, IJPL-159851).\n- We've fixed highlighting inside TODO comments so it does not disappear on editing (IJPL-159012).\n- We've added support of LSP Semantic Tokens (IJPL-15720).\n- We've fixed the problem with JCEF-preview showing top-left quarter of the page ( IJPL-162777).\nFor more details, please see the release notes.","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"2024.2.3","site":"https://www.jetbrains.com/","source":"WinGet","license_or_tos":"Proprietary","app_page":"https://www.jetbrains.com/webstorm/","resources":null}