{"appId":"winget_app_PrestonN.FreeTube","appShortcutName":"Winget Application","appDisplayName":"FreeTube","authorId":"winget","releaseTagName":"winget-0.22.0","downloadUrls":{"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/FreeTubeApp/FreeTube/releases/download/v0.22.0-beta/freetube-0.22.0-setup-x64.exe"},"0":{"installerType":"WindowsInstallerExe","asset":"","url":"https://github.com/FreeTubeApp/FreeTube/releases/download/v0.22.0-beta/freetube-0.22.0-setup-arm64.exe"}},"install":{"win32":{"assetId":1,"exec":null,"installerArgs":null},"winarm":{"assetId":0,"exec":null,"installerArgs":null},"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"FreeTube is an open source desktop YouTube player built with privacy in mind.\n\nFreeTube is an open source desktop YouTube player built with privacy in mind.\nUse YouTube without advertisements and prevent Google from tracking you with their cookies and JavaScript.\nAvailable for Windows, Mac & Linux thanks to Electron.\nSummary\nOur Video Player has undergone a massive overhaul. We have switched from video.js to shaka-player. This allows us to add allot of new features and fix many issues. Notably, it's now possible to watch higher quality video streams. A massive thank you to @absidue for their help and support on this!This is a very large change to how we handle things. If you happen to see anything that seems broken compared to the last release, please consider commenting about it in the thread below so that we can look at it.For users hoping to import their subscriptions from YouTube, the process should be much quicker and a lot smoother since we no longer fetch thumbnail information when importing from YouTube. The channel thumbnails in the sidebar will be populated as you navigate around the app.We would also like to thank all the translators that make FreeTube more accessible to all of our users!Features\n- Migrate video player from video.js to shaka-player by @absidue in #4978\n- Local API: Use IOS HLS manifest for livestreams by @absidue in #5705\n- Add a videos tab to artist topic channels by using YouTube's auto-generated playlists on the local API by @absidue in #5661\n- Implement persistent subscription cache by @PikachuEXE in #5185\n- Add ability to see comment replies of community posts through Invidious by @ChunkyProgrammer in #5589\n- Display video tags in search results with the Invidious API by @ChunkyProgrammer in #5590\n- Add support for Invidious instances that require the Basic authentication scheme to access them by @absidue in #5569\n- Implement case sensitive search in history by @PikachuEXE in #5446\n- Proxy live streams when \"Proxy Videos Through Invidious\" is enabled by @absidue in #5649\n- Add support for copying hashtag and post links from the context menu by @absidue in #5538 and #5760\n- Add a GPU Internals entry to the View menu by @absidue in #5550\n- Add support for Belarusian locale by @aliaksandr-trush in #5841\n- Add Playlist Sort By Video Duration by @Hoverth in #5627\nFixes\n- Don't make requests when importing subscriptions by @ChunkyProgrammer in #5617\n- Update playlist import to only add duplicate playlist items if the playlist already contained duplicates by @PikachuEXE in #5783\n- Fix the shorts tab being empty on the Local API by @absidue in #5679\n- Fix persistent cache incorrectly having higher priority then auto fetch feed option by @PikachuEXE in #5743\n- Fix video start time handling by @absidue in #5719\n- Fix long comments overflowing and breaking the layout by @absidue in #5774\n- Local API: Fix error when a community post has no likes by @absidue in #5759\n- Fix loading from search cache failing when no features are selected by @absidue in #5775\n- Fix subscriptions CSV import shortening channel names by @absidue in #5793\n- Fix hashtag page not using Invidious API when it should by @ChunkyProgrammer in #5794\n- fix cmd+m shortcut to minimize the window on macos and not mute the video by @jacopo-degattis in #5829\n- Fix saving Invidious thumbnail URLs for subscriptions by @absidue in #5662\n- Fix about page not reacting to locale changes by @absidue in #5393\n- Do not overwrite cache entries when hitting RSS ratelimits by @absidue in #5756\n- Fix playback of VOD/non-live videos with Invidious by @absidue in #5654\n- Fix audio track selection by @absidue in #5697\n- Properly handle Arabic hashtags by @absidue in #5545\n- Fix a few memory leaks while tearing down the player by @absidue in #5698\n- Lowercase hls manifest type to match the parser name shaka player registers by @MarmadileManteater in #5648\n- Fix wrong live stream playlist used for subscriptions by @ChunkyProgrammer in #5876\nChanges\n- Bump electron from 31.1.0 to 32.2.0\n- Change the Proxy Videos Through Invidious setting to only apply when using the Invidious API by @absidue in #5758\n- Remove \"Force Local Backend for Legacy Formats\" setting by @absidue in #5650\n- Revert \"Larger search/URL bar\" by @efb4f5ff-1298-471a-8973-3d47447115dc in #5773\n- Settings menu & UX improvements by @kommunarr in #5029\n- Allow users to pass their own hardware acceleration flags on the command line on Linux by @xsmile in #5438\n- Update icon for channels button on side nav by @PikachuEXE in #5273\n- Display a better error message on the watch page when YouTube has blocked the IP address by @absidue in #5757\n- Change Sponsorblock Default Category Colors by @Neuheit in #5686\n- Update RSS tooltip by @efb4f5ff-1298-471a-8973-3d47447115dc in #5753\n- Clarify how to add subscriptions by @efb4f5ff-1298-471a-8973-3d47447115dc in #5778\n- Update subscription cache when subscribing from the channel page by @absidue in #5717\n- Update top nav to move query text to new window instead of remaining in old window by @PikachuEXE in #5541\n- Fix incorrect/translated placeholders in locale files by @absidue in #5628\n- Update subscription details from search results by @absidue in #5795\n- Various performance improvements by @absidue in  #5666 and #5722\n- Various code cleanups by @absidue in   #5663 and #5625\nKnown Issues\nWhen using the Local API or the Invidious API it is possible that you will run into issues due to YouTube IP blocks. Please try to use a different Invidious Instance, VPN or proxy when you encounter those issues.New Contributors\n- @xsmile made their first contribution in #5438\n- @Neuheit made their first contribution in #5686\n- @jacopo-degattis made their first contribution in #5829\n- @aliaksandr-trush made their first contribution in #5841\n- @Hoverth made their first contribution in #5627\nFull Changelog: https://github.com/FreeTubeApp/FreeTube/compare/v0.21.3-beta...v0.22.0-beta","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"0.22.0","site":"https://github.com/FreeTubeApp","source":"WinGet","license_or_tos":"AGPL-3.0","resources":null,"verified":false}