{"appId":"winget_app_calibre.calibre","appShortcutName":"Winget Application","appDisplayName":"calibre","authorId":"winget","releaseTagName":"winget-7.22.0","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":"https://download.calibre-ebook.com/7.22.0/calibre-64bit-7.22.0.msi"},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":{"assetId":1,"exec":null,"scope":"Machine","installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"calibre is the one stop solution to all your e-book needs.\n\ncalibre is an e-book manager. It can view, convert, edit and catalog e-books in all of the major e-book formats. It can also talk to e-book reader devices. It can go out to the internet and fetch metadata for your books. It can download newspapers and convert them into e-books for convenient reading. It is cross platform, running on Linux, Windows and macOS.\nNew features\n- E-book viewer: Read Aloud: Add an option to control the position of the popup control bar. It can now be placed along the top or bottom edges so as to overlap less with text.\n- System tray menu: Add action to restart calibre\n  Closes tickets: 2087754\n- Tolino driver: Support new firmware\nBug fixes\n- Windows: Enable popup OS notifications even when system tray icon is disabled to match behavior on other platforms. Notifications can be disabled via Preferences->Look & feel->Disable notifications on job completion\n- Fix a regression that caused incorrect English transliteration of Japanese text even when the UI language is set to Japanese\n  Closes tickets: 2087850\n- macOS: Dark mode: Fix a regression that caused the scrollbar to no longer be transient\n  Closes tickets: 2088153\n- DOCX Input: When some text has multiple footnotes insert a space between the consecutive foot note numbers so that they are distinct\n  Closes tickets: 2089433\n- DOCX Input: Fix ToC nesting not working if the styles for the ToC levels dont use integer margins\n- E-book viewer: Fix spurious chapter transition after configuring Read aloud\n- PDF Input: Fix reflow of lines in files with little text not working\n  Closes tickets: 2089436\nNew news sources\n- Economist News by unkn0wn\nImproved news sources\n- Economist\n- Indian Express\n- Economist World Ahead\n- Frontline\n- Infobae","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"7.22.0","site":"https://kovidgoyal.net/","source":"Kovid Goyal","license_or_tos":"GPL-3.0","resources":null,"verified":false}