{"appId":"winget_app_Microsoft.DevHome","appShortcutName":"Winget Application","appDisplayName":"Dev Home (Preview)","authorId":"winget","releaseTagName":"winget-0.1901.687.0","downloadUrls":{"1":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Dev Home is a control center providing the ability to track all of your workflows and coding tasks in one place.\n\nDev Home is a control center providing the ability to track all of your workflows and coding tasks in one place.\nIt features a streamlined setup tool that enables you to install apps and packages in a centralized location,\nextensions that allow you to connect to your developer accounts (such as GitHub), and a customizable dashboard\nwith a variety of developer-focused widgets, to give you the information you need right at your fingertips.\nWelcome to version 0.19 of Dev Home! In this release, we focused on adding File Explorer source control integration, code health, and quality improvements! Check them out:\n\nAccessibility fixes\n- Narrator should now properly announce all of the content in the File Explorer source integration page. (#3906) (#3941)\n- The Learn more links on the app install page should no longer get cut off. (#3917)\n- The keyboard should no longer lose focus after opening and closing a File Explorer window from Dev Home. (#3926)\n\nChanges\n- File Explorer source control integration now supports repositories in WSL. (#3893)\n- WinAppSDK has been updated to version 1.5. (#3921)\n- You can now unassigned the version control from a selected repository in the File Explorer source integration page. (#3932)\n- The Introducing Dev Home page has been removed. (#3952)\n- The functionality to continue restoring your device after OOBE has been removed. (#3953)\n- Dev Diagnostics, an experimental feature, has been removed. (#3955)\n- Quickstart playground, an experimental feature, has been removed. (#3961)\n- Quiet background processes, an experimental feature, has been removed. (#3962)\n- Group Policy (GPO) has been added with an overall toggle to disable Dev Home. (#3965)\n- The GitHub extension is no longer automatically installed on first run. (#3975)\n\nBug fixes\n- Installing WSL distros through Dev Home should no longer time out. (#3897)\n- Dev Drive insights better handles moving package caches (Thanks @SohamDas2021!). (#3898)\n- Environments should now better handle when multiple accounts are logged in. (#3907)","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"0.1901.687.0","site":"https://www.microsoft.com/","source":"Microsoft Corporation","license_or_tos":"MIT","resources":null,"verified":false}