{"appId":"winget_app_FTB.App","appShortcutName":"Winget Application","appDisplayName":"FTB Electron App","authorId":"winget","releaseTagName":"winget-1.25.8","downloadUrls":{"0":{"installerType":"WindowsInstallerMsi","asset":"","url":""},"1":{"installerType":"WindowsInstallerExe","asset":"","url":"https://piston.feed-the-beast.com/app/ftb-app-1.25.8-x64.exe"}},"install":{"win32":{"assetId":1,"exec":null,"installerArgs":null},"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":null},"displayImages":[],"description":"Official launcher for FTB Minecraft modpacks; also supports Curseforge\n\n\nThis versions also brings the availability of our Electron only version of the FTB App for Windows! You can get it from the FTB website.\n🎉 Added\n    CurseForge mods will now have a \"CurseForge\" badge in the mod details that will take you to the mod page on the CurseForge website #716\n🔧 Changed\n    All authentication methods now use the ftb:// protocol instead of a local web server. This should improve the reliability of the authentication process\n    We now refresh your Minecraft Authentication token if it's within 6 hours of expiring to ensure you can continue to play your instances without interruption\n    Improved the wording around the \"Instance relocation system\" so it is clear that this is a relocation process and not a just a settings value #1077\n    Ram will now actually save if you change it via the input box #1024\n    Ram values now show the correct ram calculation. Thanks to @bryce-schultz\n    Hopefully fixed the app icon not working on linux machines #1098\n    Some modpack names breaking the file path due to trailing spaces #1099\n    Instances can now be relocated to basically anywhere instead of having safeguards around nested folders #1061 #1095\n    Java Licenses not linking to their respective Github Pages correctly\n","repo":{"author":"microsoft","repo":"winget-pkgs"},"version":"1.25.8","site":"https://www.feed-the-beast.com/","source":"Feed The Beast","license_or_tos":"Proprietary","resources":null,"verified":false}